import { responseItemTranformer } from './item'
import { layoutsTransformer } from './layout'

export const _projectInfo = {
  projectId: 3,
  name: '国家知识图谱',
  description: '用于测试布局 迭代一、二',
  userId: 1,
  layoutStatus: null
}

export const _graphData = {
  projectId: 5,
  nodes: [
    {
      id: 1,
      name: '川菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 57,
      name: '鲁菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 101,
      name: '闽菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 156,
      name: '粤菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 198,
      name: '苏菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 248,
      name: '浙菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 281,
      name: '湘菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 314,
      name: '徽菜',
      group: '菜系',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 3,
      name: '里脊肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增长肌肉：它对增长肌肉、增强力量特别有效。在进行训练的头几秒钟里，肌氨酸是肌肉燃料之源，它可以有效补充三磷酸腺苷，从而使训练能坚持得更久。其中肉毒碱主要用于支持脂肪的新陈代谢，产生支链氨基酸，是对健美运动员增长肌肉起重要作用的一种氨基酸。\\n2、增加免疫力：可帮你增强免疫力，促进蛋白质的新陈代谢和合成，从而有助于紧张训练后身体的恢复。\\n3、促进康复：能提高机体抗病能力，对生长发育及手术后、病后调养的人在补充失血、修复组织等方面物别适宜。\\n4、补铁补血：铁是造血所必需的元素，而牛肉中富含大量的铁，多食用牛肉有助于缺铁性贫血的治疗。',
        简介:
          '猪肉又名豚肉，是主要家畜之一。属猪科动物。其性味甘咸平，含有丰富的蛋白质及脂肪、碳水化合物、钙、磷、铁等成分。 猪肉是日常生活的主要副食品，具有补虚强身，滋阴润燥、丰肌泽肤的作用。凡病后体弱、产后血虚、面黄赢瘦者，皆可用之作营养滋补之品。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 4,
      name: '笋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、开胃健脾：具有开胃、促进消化、增强食欲的作用，可用于治疗消化不良。\\n2、宽胸利膈、通肠排便：促进胃肠蠕动，降低肠内压力，减少粪便粘度，使粪便变软利排出，用于治疗便秘，预防肠癌。\\n3、开膈消痰：竹笋具有低糖、低脂的特点，富含植物纤维，可降低体内多余脂肪，消痰化瘀滞，治疗高血压、高血脂、高血糖症，且对消化道癌肿及乳腺癌有一定的预防作用。\\n4、增强机体免疫力：竹笋中植物蛋白、维生素及微量元素的含量均很高，有助于增强机体的免疫功能，提高防病抗病能力。',
        简介:
          '笋为禾本科植物毛竹等多种竹的幼苗，去竹箨可食部分。主要生长于湖南、湖北、江西、浙江等省。',
        营养价值:
          '1.竹笋具有一定的营养价值，它含有蛋白质，脂肪、糖、钙、磷、铁以及胡萝卜素、维生素B, 维生素C等营养成分。\\n2.它含有优质蛋白质，含有赖氨酸、色氨酸、苏氨酸、苯丙氨酸、谷氨酸及肤氨酸等人体必需氨基酸。竹笋又是低糖、低脂肪、多纤维食品。'
      }
    },
    {
      id: 5,
      name: '青椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解热、镇痛：辣椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、防癌：辣椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、增加食欲、帮且消化：辣椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、降脂减肥：辣椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '青椒为植物界，双子叶植物纲，菊亚纲，茄科。果实为浆果。别名很多，大椒、灯笼椒、柿子椒、都是它的名字，因能结甜味浆果，又叫甜椒、菜椒。一年生或多年生草本植物，特点是果实较大，辣味较淡甚至根本不辣，作蔬菜食用而不作为调味料。由于它翠绿鲜艳，新培育出来的品种还有红、黄、紫等多种颜色，因此不但能自成一菜，还被广泛用于配菜。青椒由原产中南美洲热带地区的辣椒在北美演化而来，经长期栽培驯化和人工选择，使果实发生体积增大，果肉变厚，辣味消失和心皮及子房腔数增多等性状变化。中国于100多年前引入，现全国各地普遍栽培。',
        营养价值:
          '青椒果肉厚而脆嫩，维生素C含量丰富。青果含水分93、9%左右、碳水化合物约3、8%，维生素C；红熟果含维生素C最高可达460毫克。可凉拌、炒食、煮食、作馅、腌渍和加工制罐，制蜜饯。'
      }
    },
    {
      id: 6,
      name: '胡萝卜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、益肝明目：胡萝卜含有大量胡萝卜素，有补肝明目的作用，可治疗夜盲症。\\n2、利膈宽肠：胡萝卜含有植物纤维，可加强肠道的蠕动，从而利膈宽肠，通便防癌。\\n3、促进发育：维生素A是骨骼正常生长发育的必需物质，对促进婴幼儿的生长发育具有重要意义。\\n4、增强免疫功能：胡萝卜素转变成维生素A，有助于增强机体的免疫能力。\\n5、降糖降脂：胡萝卜还含有降糖物质，是糖尿病人的良好食品。',
        简介:
          '胡萝卜（Daucus carrot），又称甘荀，是伞形科胡萝卜属二年生草本植物。以肉质根作蔬菜食用。原产亚洲西南部，阿富汗为最早演化中心，栽培历史在2000年以上。',
        营养价值:
          '每100克胡萝卜中，约含蛋白质0、6克，脂肪0、3克，糖类7、6～8、3克，铁0、6毫克，维生素A原（胡萝卜素）1、35～17、25毫克，维生素B10、02～0、04毫克，维生素B20、04～0、05毫克，维生素C12毫克，热量150、7千焦，另含果胶、淀粉、无机盐和多种氨基酸。各类品种中，尤以深橘红色胡萝卜素含量最高，各种胡萝卜所含能量在79、5干焦～1339、8千焦之间。'
      }
    },
    {
      id: 7,
      name: '木耳',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补气血：每100克黑木耳中含铁185毫克，它比绿叶蔬菜中含铁量最高的菠菜高出20倍，比动物性食品中含铁量最高的猪肝还高出约7倍，是各种荤素食品中含铁量最多养血驻颜，令人肌肤红润，容光焕发，并可防治缺铁性贫血；减少血小板凝块，预防血栓的发生，预防动脉粥样硬化和冠心病的发生。\\n2、减肥防癌治便秘：能够促进胃肠蠕动，促进肠道脂肪食物的排泄、减少食物中脂肪的吸收，从而防止肥胖；同时，由于这两种物质能促进胃肠蠕动，防止便秘，有利于体内大便中有毒物质的及时清除和排出，从而起到预防直肠癌及其它消化系统癌症的作用。所以，老年人特别是有便秘习惯的老年人，坚持食用黑木耳，常食木耳粥，对预防多种老年疾病、抗癌、防癌，延缓衰老都有良好的效果。\\n3、清肠胃：木耳可以把残留在人体消化系统内的灰尘、杂质吸附集中起来排出体外，从而起到清胃涤肠的作用，它对胆结石、肾结石等内源性异物也有比较显著的化解功能。',
        简介:
          '木耳是木耳科真菌状如耳朵，系寄生于枯木上的一种菌类，富含铁、钙、磷和维生素B1等。新鲜的木耳呈胶质片状，半透明，侧生在树木上，耳片直径5-10厘米，有弹性，腹面平滑下凹，边缘略上卷，背面凸起，并有极细的绒毛，呈黑褐色或茶褐色。干燥后收缩为角质状，硬而脆性，背面暗灰色或灰白色；入水后膨胀，可恢复原状，柔软而半透明，表面附有滑润的粘液。木耳质地柔软，味道鲜美，营养丰富，可素可荤，不但为菜肴大添风采，而且能养血驻颜，祛病延年。现代营养学家盛赞黑木耳为“素中之荤”，其营养价值可与动物性食物相媲美。',
        营养价值:
          '1. 黑木耳中铁的含量极为丰富，故常吃木耳能养血驻颜，令人肌肤红润，容光焕发，并可防治缺铁性贫血； \\n2. 黑木耳含有维生素K，能减少血液凝块，预防血栓症的发生，有防治动脉粥样硬化和冠心病的作用； \\n3. 木耳中的胶质可把残留在人体消化系统内的灰尘、杂质吸附集中起来排出体外，从而起到清胃涤肠的作用，它对胆结石、肾结石等内源性异物也有比较显著的化解功能； \\n4. 黑木耳含有抗肿瘤活性物质，能增强机体免疫力，经常食用可防癌抗癌。\\n'
      }
    },
    {
      id: 8,
      name: '葱姜蒜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 9,
      name: '淀粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '具有补中和血、益气生津、宽肠胃、通便秘的功效。',
        简介:
          '勾芡用的淀粉,又叫做团粉,是由多个葡萄糖分子缩合而成的多糖聚合物.烹调用的淀粉,主要有绿豆淀粉、马铃薯淀粉、麦类淀粉、菱角淀粉、藕淀粉、玉米淀粉等.淀粉不溶于水,在和水加热至60℃左右时（淀粉种类不同,糊化温度不一样）,则糊化成胶体溶液.勾芡就是利用淀粉的这种特性. ',
        营养价值:
          '由于用芡粉所做的浆、粉、糊、汁、芡的处理，还可起到保护层的作用，既防止营养成分的流失或被破坏，也可避免动物蛋白接触高温焦糊而产生的不利健康的物质。'
      }
    },
    {
      id: 11,
      name: '豆腐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗血栓：制作大豆中含有的皂苷，清除体内自由基，具有显著的抗癌活性，具有抑制肿瘤细胞的生长，抑制血小板聚集，抗血栓的功效。\\n2、牛奶的替代品：豆腐的营养价值与牛奶相近，对因乳糖不耐症而不能喝牛乳，或为了控制慢性病不吃肉禽类的人而言，豆腐是最好的代替品。\\n3、更年期的“保护神”：有效的预防骨质疏松、乳腺癌和前列腺的发生。\\n4、预防心血管疾病：豆腐健脑的同时，还能抑制胆固醇的摄入。大豆蛋白显著降低血浆胆固醇、甘油三酯和低密度脂蛋白，不仅可以预防结肠癌，还有助于预防心脑血管疾病。\\n5、降低乳腺癌的几率：制作豆腐的大豆中含有大豆异黄酮，可调整乳腺对雌激素的反应，日本妇女尿中的异黄酮浓度为美国、荷兰妇女的100~1000倍，这与日本人常食大豆有关，也是日本相与欧美国家相比乳腺癌发生率较低的一个原因。此外，还可以有效的预防白血病，结肠癌，肺癌，胃癌等的发生。\\n6、有益于大脑的生长发育',
        简介:
          '豆腐是我国炼丹家——淮南王刘安发明的绿色健康食品。时至今日，已有二千一百多年的历史，深受我国人民、周边各国、及世界人民的喜爱。发展至今，已品种齐全，花样繁多，俱有风味独特，制作工艺简单食用方便的特点。有高蛋白，低脂肪，降血压，降血脂，降胆固醇的功效。是生熟皆可，老幼皆宜，养生摄生、益寿延年的美食佳品。',
        营养价值:
          '1.大豆的蛋白质生物学价值可与鱼肉相媲美，是植物蛋白中的佼佼者。大豆蛋白属于完全蛋白质，其氨基酸组成比较好，人体所必需的氨基酸它几乎都有。\\n2.制作豆腐的大豆中含有18%左右的油脂，大部分能转移到豆腐中去。大豆油中的亚油酸比例较大，且不含胆固醇，有益于人体神经、血管、大脑的生长发育。\\n3.大豆可以直接烹调食用，人体对其蛋白质的消化吸收率只有65%，而制成豆腐消化率可以提升到92%~95%。\\n'
      }
    },
    {
      id: 12,
      name: '牛肉末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增长肌肉：它对增长肌肉、增强力量特别有效。在进行训练的头几秒钟里，肌氨酸是肌肉燃料之源，它可以有效补充三磷酸腺苷，从而使训练能坚持得更久。其中肉毒碱主要用于支持脂肪的新陈代谢，产生支链氨基酸，是对健美运动员增长肌肉起重要作用的一种氨基酸。\\n2、增加免疫力：可帮你增强免疫力，促进蛋白质的新陈代谢和合成，从而有助于紧张训练后身体的恢复。\\n3、促进康复：能提高机体抗病能力，对生长发育及手术后、病后调养的人在补充失血、修复组织等方面物别适宜。\\n4、补铁补血：铁是造血所必需的元素，而牛肉中富含大量的铁，多食用牛肉有助于缺铁性贫血的治疗。',
        简介:
          '牛肉是全世界人都爱吃的食品，中国人消费的肉类食品之一，仅次于猪肉，牛肉蛋白质含量高，而脂肪含量低，所以味道鲜美，受人喜爱，享有“肉中骄子”的美称。',
        营养价值:
          '1.牛肉提供高质量的蛋白质，含有全部种类的氨基酸，各种氨基酸的比例与人体蛋白质中各种氨基酸的比例基本一致，其中所含的肌氨酸比任何食物都高。\\n2.牛肉的脂肪含量很低，但它却是低脂的亚油酸的来源，还是潜在的抗氧化剂。\\n3.牛肉含有矿物质和维他命B群，包括烟酸，维生素B1和核黄素。牛肉还是每天所需要的铁质的最佳来源。\\n4.牛肉还含肉毒碱。\\n'
      }
    },
    {
      id: 13,
      name: '青蒜末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 14,
      name: '花椒面',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、花椒气味芳香，可以除各种肉类的腥臊臭气，改变口感，能促进唾液分泌，增加食欲。\\n2、医学研究发现，花椒能使血管扩张，从而能起到降低血压的作用。\\n3、服食花椒水能驱除寄生虫。',
        简介:
          '花椒粉就是将花椒碾碎之后的成果，一般都是用作作料，能够去腥增味。',
        营养价值:
          '花椒果皮含有挥发油，油的主要成分为柠檬烯、枯醇、牛儿醇。此外并含有植物甾醇及不饱和有机酸等多种化合物。'
      }
    },
    {
      id: 15,
      name: '香菜末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 17,
      name: '鸡肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强身健体：鸡肉的消化率高，很容易被人体吸收利用，有增强体力、强壮身体的作用。\\n2、提高免疫力：现代社会中天天忙忙碌碌，常处于亚健康状态的白领最好多吃一些，以增强免疫力，减少患病几率。鸡肉具有温中益气、补精填髓、益五脏、补虚损的功效，用于治疗虚劳瘦弱、中虚食少、泄泻头晕心悸、月经不调、产后乳少、消渴、水肿等症状。\\n3、补肾精：可缓解由于肾精不足所导致的小便频繁、耳聋、精少精冷等症状。\\n4、促进智力发育：具有抗氧化和一定的解毒作用。在改善心脑功能、促进儿童智力发育方面，更是有较好的作用。',
        简介:
          '顾名思义，鸡肉就是鸡身上的肉，鸡的肉质细嫩，滋味鲜美，适合多种烹调方法，并富有营养，有滋补养身的作用。鸡肉不但适于热炒、炖汤，而且是比较适合冷食凉拌的肉类。但切忌吃过多的鸡翅等鸡肉类食品，以免引起肥胖。',
        营养价值:
          '1.鸡肉和猪肉、牛肉比较，其蛋白质含量较高，脂肪含量较低。此外，鸡肉蛋白质中富含人体必须的氨基酸，其含量与蛋乳中的氨基酸谱式极为相似，因此为优质蛋白质的来源。鸡肉的蛋白质含量根据部位、带皮和不带皮而有差别，从高到底的排序大致为去皮的鸡肉、胸脯肉、大腿肉。鸡肉皮存在大量的脂类物质，所以绝不能把带皮的鸡肉视为低热量的食品。\\n2.鸡肉也是磷、铁、铜和锌的良好来源，并且富含丰富的维生素B12、维生素B6、维生素A、维生素D和维生素K等。\\n3.鸡肉的脂类物质和牛肉、猪肉比较，含有较多的不饱和脂肪酸——亚油酸和亚麻酸，能够降低人体对健康不利的低密度脂蛋白胆固醇的含量。\\n'
      }
    },
    {
      id: 18,
      name: '花生米',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进生长发育：花生含丰富的维生素及矿物质，可以促进人体的生长发育。\\n2、健脑益智：花生蛋白中含十多种人体所需的氨基酸，其中赖氨酸可使儿童提高智力，谷氨酸和天门冬氨酸可促使细胞发育和增强大脑的记忆能力。\\n3、延缓衰老：花生中所含有的儿茶素对人体具有很强的抗老化的作用，赖氨酸也是防止过早衰老的重要成分。常食花生，有益于人体延缓衰老，故花生又有“长生果”之称。\\n4、润肺止咳：润肺止咳花生中含有丰富的脂肪油、可以起到润肺止咳的作用，常用于久咳气喘，咯痰带血等病症。\\n5、止血：凝血止血花生衣中含有油脂和多种维生素，并含有使凝血时间缩短的物质，能对抗纤维蛋白的溶解，有促进骨髓制造血小板的功能，对多种出血性疾病，不但有止血的作用，而且对原发病有一定的治疗作用，对人体造血功能有益。”\\n6、降低胆固醇：防止冠心病花生油中含大量的亚油酸，这种物质可使人体内胆固醇分解为胆汁酸排出体外。避免胆固醇在体内沉积，减少高胆固醇发病机会，能够防止冠心病和动脉硬化。另外，花生中含有一种生物活性很强的天然多酚类物质—白藜芦醇，可预防癌症的发生及发展，具有抗动脉粥样硬化和冠心病，缺血性心脏病，高血脂的防治作用。\\n7、养血通乳：滋血通乳花生中含丰富的脂肪油和蛋白质，对产后乳汁不足者，有滋补气血，养血通乳作用。\\n8、防癌：花生纤维组织中的可溶性纤维被人体消化吸收时，会像海绵一样吸收液体和其他物质，然后膨胀成胶带体随粪便排出体外。当这些物体经过肠道时，与许多有害物质接触，吸取某些毒素，从而降低有害物质在体内的积存和所产生的毒性作用，减少肠癌发生的机会。',
        简介:
          '花生米是指去掉花生壳的花生仁，事实上是花生的种子，整个的花生叫做果实，荚果。但一般还是叫做花生米。花生本身是高能、高蛋白和高脂类的植物性食物。',
        营养价值:
          '花生米不含胆固醇和反式脂肪酸，富含微量营养素，植物固醇、白藜芦醇、异黄酮、抗氧化剂等物质，是乳、肉食物的优秀替代品，对平衡膳食、改善中国居民的营养与健康状况具有重要作用。'
      }
    },
    {
      id: 20,
      name: '番茄酱',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抑制癌症：番茄红素对于一些类型的癌有预防效果，对乳癌、肺癌、子宫内膜癌具有抑制作用，亦可对抗肺癌和结肠癌。\\n2、抗衰老：番茄的番茄红素有利尿及抑制细菌生长的功效，是优良的抗氧化剂，能清除人体内的自由基，抗癌效果是β-胡萝卜素的2倍。\\n3、促进食欲：番茄酱味道酸甜可口，可增进食欲，番茄红素在含有脂肪的状态下更易被人体吸收。',
        简介:
          '蕃茄酱是由新鲜的成熟番茄去皮籽磨制而成。可分两种，一种颜色鲜红，为常见；另一种由番茄酱进一步加工而成的番茄沙司，为甜酸味，颜色暗红。前者可作炒菜的调味品，后者可以蘸食。\\n番茄酱大都呈深红色或红色，酱体均匀细腻、黏稠适度，味酸甜、无杂质、无异味。',
        营养价值:
          '1、番茄酱中除了番茄红素外还有维生素B群、膳食纤维、矿物质、蛋白质及天然果胶等，和新鲜番茄相比较，番茄酱里的营养成分更容易被人体吸收。\\n2、番茄的番茄红素有利尿及抑制细菌生长的功效，是优良的抗氧化剂，能清除人体内的自由基，抗癌效果是β-胡萝卜素的2倍。\\n3、医学研究发现，番茄红素对于一些类型的癌有预防效果，对乳癌、肺癌、子宫内膜癌具有抑制作用，亦可对抗肺癌和结肠癌。\\n4、番茄酱味道酸甜可口，可增进食欲，番茄红素在含有脂肪的状态下更易被人体吸收。'
      }
    },
    {
      id: 21,
      name: '鸡蛋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、健脑益智：鸡蛋对神经系统和身体发育有很大的作用，其中含的胆碱可改善各个年龄组的记忆力。\\n2、保护肝脏：鸡蛋中的蛋白质对肝脏组织损伤有修复作用，蛋黄中的卵磷脂可促进肝细胞的再生。还可提高人体血浆蛋白量，增强肌体的代谢功能和免疫功能。\\n3、延缓衰老：不少长寿老人的延年益寿经验之一，就是每天必食一个鸡蛋。\\n4、预防癌症：根据对全世界人类癌症死亡率进行的分析，人们发现癌症的死亡率与硒的摄入量成反比。而鸡蛋中含有丰富的硒元素。',
        简介:
          '鸡蛋是一种营养非常丰富、价格相对低廉的常用食品。它的食用对象A相当广泛，从4～5个月的婴儿一直到老人，都适宜食用鸡蛋。',
        营养价值:
          '1. 鸡蛋含有丰富的蛋白质、脂肪、维生素和铁、钙、钾等人体所需要的矿物质，蛋白质为优质蛋白，对肝脏组织损伤有修复作用；\\n2. 富含DHA和卵磷脂、卵黄素，对神经系统和身体发育有利，能健脑益智，改善记忆力，并促进肝细胞再生；\\n3. 鸡蛋中含有较多的维生素B和其他微量元素，可以分解和氧化人体内的致癌物质，具有防癌作用。\\n'
      }
    },
    {
      id: 22,
      name: '芝麻',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、防治皮肤炎症：可使皮肤白皙润泽，并能防治各种皮肤炎症。\\n2、养血护肤：可以治疗皮肤干枯、粗糙、令皮肤细腻光滑、红润光泽。\\n3、滋补养生：补班、养发、生津、通乳、润肠。\\n4、通便：润肠通便，对肠液减少引起的便秘，单独应用即有效验。\\n5、促进骨骼发育：经常食用对骨骼、牙齿的发育都大有益处。\\n6、延年益寿：可强壮身体、益寿延年、滋补肝肾、润养脾肺。\\n7、预防高血压：芝麻中人体必需脂肪酸含量很高，预防高血压的效果很好。\\n8、护发：助消化、维护皮肤、头发健康',
        简介:
          '芝麻又叫胡麻、脂麻、乌麻等，属脂麻科一年生草本植物。味甘性平，具有补血明目，益肝养发，生津通乳，润肠通便，美容养颜，延年益寿等功能，被人们誉为“抗衰果”。 现代研究表明，芝麻中含有丰富的营养，芝麻的脂肪油含量达61.7％左右，是我国四大食用油料作物的佼佼者，芝麻油中以油酸、亚油酸、棕榈酸、甘油脂为主要成分；含蛋白质21.9％，氨基酸种类与瘦肉相似；还含有芝麻素、脂麻油酚、卵磷脂、蔗糖、多缩戊糖及钙、磷、铁等物质和维生素A、D、E等。',
        营养价值:
          '据测定，芝麻含有多种营养物质，每百克芝麻含蛋白质21.90克，脂肪61.70克，钙564.00毫克，磷368.00毫克；特别是铁的含量极高，每百克可高达50.00毫克。因此，古人说芝麻能“填精”、“益髓”、“补血”的功效。'
      }
    },
    {
      id: 23,
      name: '姜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲、促消化：口嚼生姜，可引起血压升高。姜辣素对口腔和胃粘膜有刺激作用，能促进消化液分泌，增进食欲。可使肠张力、节律和蠕动增加。\\n2、镇吐：有末梢性镇吐作用，有效成分为姜酮和姜烯酮的混合物。治疗胃寒呕吐。也可治胃热呕吐。\\n3、活血驱寒：用生姜、红糖熬制的姜汤可活血驱寒，防治感冒，自古就是风寒感冒的食疗良药。\\n4、杀菌：体外实验表明，姜对伤寒杆菌、霍乱弧菌有明显的抑制作用。\\n5、助阳：按中医理论，生姜是助阳之品。\\n6、解毒：生姜又能解生半夏、生南星之毒，煎汤饮服，可用于中半夏、南星毒引起的喉哑舌肿麻木等症',
        简介:
          '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。',
        营养价值:
          '1、姜含有蛋白质、多种维生素、胡萝卜素、钙、铁、磷。\\n2、姜中含有姜醇、姜烯、水芹烯、柠檬醛和芳香等油性的挥发油;还有姜辣素、树脂、淀粉和纤维等。'
      }
    },
    {
      id: 24,
      name: '小白菜梗',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 26,
      name: '土豆',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充营养、可作主食：土豆含有丰富的维生素及钙、钾等微量元素，且易于消化吸收，营养丰富。\\n2、和中养胃、健脾利湿：土豆含有大量淀粉以及蛋白质、B族维生素、维生素C等，能促进脾胃的消化功能。\\n3、宽肠通便：土豆含有大量膳食纤维，能宽肠通便，帮助机体及时排泄代谢毒素，防止便秘。\\n4、降糖降脂、美容养颜：预防心血管和系统的脂肪沉积，保持血管的弹性，有利于预防动脉粥样硬化的发生。土豆同时又是一种碱性蔬菜，有利于体内酸碱平衡，中一定的美容、抗衰老作用。\\n5、利水消肿：土豆所含的钾能取代体内的钠，同时能将钠排出体外，有利于高血压和肾炎水肿患者的康复。\\n6、减肥：每148克土豆产生的热量仅为100卡路里，能有效控制人们日常饮食中脂肪总量的摄入。\\n7、美容护肤：土豆有很好的呵护肌肤、保养容颜的功效。',
        简介:
          '马铃薯（学名：Solanum tuberosum L.），属茄科一年生草本植物，块茎可供食用，是全球第四大重要的粮食作物，仅次于小麦、稻谷和玉米。马铃薯又称地蛋、土豆 、洋山芋等，茄科植物的块茎。与小麦、稻谷、玉米、高粱并成为世界五大作物。马铃薯原产于南美洲安第斯山区，人工栽培历史最早可追溯到大约公元前8000年到5000年的秘鲁南部地区。马铃薯主要生产国有中国、俄罗斯、印度、乌克兰、美国等。中国是世界马铃薯总产最多的国家。2015年，中国将启动马铃薯主粮化战略，推进把马铃薯加工成馒头、面条、米粉等主食，马铃薯将成稻米、小麦 、玉米外的又一主粮。',
        营养价值:
          '土豆具有很高的营养价值和药用价值，其营养素丰富，含有蛋白质、矿物质(磷、钙等)、维生素等多种成分，营养结构也较合理，有“地下苹果”之称。\\n它所含的蛋白质和维生素C、维生素B1、维生素B2比苹果高得多：\\n1、维生素C是苹果的10倍。\\n2、B族维生素是苹果的4倍。\\n3、钙、磷、镁、钾含量是苹果的几倍至几十倍不等，尤其是钾的含量，可以说在蔬菜类里排第一位。\\n4、富含大量碳水化合物，能供给人体大量的热能。\\n5、土豆的皮富含绿原酸和硫辛酸。绿原酸有抗氧化和抗癌的功效，硫辛酸可淡斑、防止皮肤老化。\\n6、含有能够帮助预防老年疾病的膳食抗氧化剂以及有大量的优质纤维素，有预防便秘和防治癌症等作用。'
      }
    },
    {
      id: 27,
      name: '干红辣椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解热、镇痛：辣椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、预防癌症：辣椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、增加食欲、帮且消化：辣椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、降脂减肥：辣椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '干辣椒是红辣椒经过干制而成的辣椒产品。它的特点是含水量低、适合长期保藏,但未密封包装或含水量高的干辣椒容易霉变。干辣椒的吃法主要是作为调味料食用',
        营养价值:
          '果实含有辣椒碱（Capsaicin）、高辣椒碱（Homocapsicin）、壬醯香荚兰胺（Noroyl vanillylamide）等。色素有辣红素（Capsanthin）、胡萝卜素（Carotene）。此外尚有维生素C、柠檬酸等。有温中、散寒、开胃、消食的作用。\\n1. 吃饭不香、饭量减少时，在菜里放上一些干辣椒就能改善食欲、增加饭量；\\n2. 辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。'
      }
    },
    {
      id: 28,
      name: '葱',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进食欲：葱有助于食欲的增进。同时与维生素B1含量较多的食物一起摄取时，维生素B1所含的淀粉及糖质会变为热量，而提高恢复疲劳的作用。\\n2、预防老年痴呆：有舒张小血管，促进血液循环的作用，有助于防止血压升高所致的头晕，使大脑保持灵活和预防老年痴呆的作用。\\n3、强身健体：经常吃葱的人，即便脂多体胖，但胆固醇并不增高，而且体质强壮。\\n4、防癌抗癌：可降低胃液内的亚硝酸盐含量，对预防胃癌及多种癌症有一定作用。\\n5、治疗感冒：其中的发性辣素还通过汗腺、呼吸道、泌尿系统排出时能轻微刺激刺激相关腺体的分泌，而起到发汗、祛痰、利尿作用。是治疗感冒的中药之一。\\n6、降三高：葱还有降血脂、降血压、降血糖的作用。\\n7、吃葱可以长寿：中国自古就有吃葱可以长寿的说法。',
        简介:
          '葱（学名：Allium fistulosum L.），为百合科葱属多年生草本植物。鳞茎单生，圆柱状，稀为基部膨大的卵状圆柱形；鳞茎外皮白色，稀淡红褐色，膜质至薄革质，不破裂。叶圆筒状，中空；花葶圆柱状，中空，中部以下膨大，向顶端渐狭；总苞膜质，伞形花序球状，多花，较疏散；花被片长6-8.5毫米，近卵形；花丝为花被片长度的1.5-2倍，锥形；子房倒卵状，腹缝线基部具不明显的蜜穴；花柱细长，伸出花被外。花果期4-7月。',
        营养价值:
          '1. 生葱像洋葱、大葱一样，含烯丙基硫醚。\\n2.葱叶部分要比葱白部分含有更多的维生素A、维C及钙。\\n3.葱含有具有刺激性气味的挥发油和辣素，能祛除腥腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用。'
      }
    },
    {
      id: 29,
      name: '蒜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 30,
      name: '花椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增减食欲：花椒气味芳香，可除各种肉类的腥膻臭气，能促进唾液分泌，增加食欲。\\n2、降血压：有研究发现，花椒能使血管扩张，从而能起到降低血压的作用。\\n3、驱虫：服食花椒水能驱除寄生虫。',
        简介:
          '花椒为芸香科灌木或小乔木植物青椒的干燥成熟果皮，一般在立秋前后成熟。产于四川、陕西、河南、河北、山西、云南等省，以四川产的质量好，以河北、山西产量为高。',
        营养价值:
          '果皮含有挥发油，油的主要成分为柠檬烯、枯醇、牛儿醇。此外并含有植物甾醇及不饱和有机酸等多种化合物。'
      }
    },
    {
      id: 32,
      name: '草鱼',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、含有丰富的不饱和脂肪酸，对血液循环有利，是心血管病人的良好食物。\\n2、含有丰富的硒元素，经常食用有抗衰老、养颜的功效，而且对肿瘤也有一定的防治作用。\\n3、对于身体瘦弱、食欲不振的人来说，草鱼肉嫩而不腻，可以开胃、滋补。',
        简介:
          '又名鲩鱼、混子、草鲩、草包鱼、草根鱼、草青、白鲩。草鱼，鱼纲，鲤科，它与青鱼是比较相近的鱼种，体色则近于鲫鱼的体色，有灰白，草黄和金黄等色。草鱼与青鱼，鳙鱼，鲢鱼并称中国四大淡水鱼。草鱼以草为食，故北方饲养草鱼也较多。草鱼背部的颜色为黑褐色、鳞片边缘为深褐色，胸、腹鳍为灰黄色，侧线平直，肉白嫩，骨刺少，适合切花刀作菊花鱼等造型菜。',
        营养价值:
          '草鱼生长快，个体大，最大个体可达35公斤。肉质肥嫩，味鲜美。每百克可食部分含蛋白质15、5-26、6克，脂肪1、4-8、9克，热量83-187千卡，钙18-160毫克，磷30-312毫克，铁0、7-9、3毫克，硫胺素0、03毫克，核黄素0、17毫克，尼克酸2、2毫克。\\n1、草鱼含有丰富的不饱和脂肪酸，对血液循环有利，是心血管病人的良好食物；\\n2、草鱼含有丰富的硒元素，经常食用有抗衰老、养颜的功效，而且对肿瘤也有一定的防治作用；\\n3、对于身体瘦弱、食欲不振的人来说，草鱼肉嫩而不腻，可以开胃、滋补。\\n'
      }
    },
    {
      id: 33,
      name: '黄豆芽',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、清热利湿：有清热利湿、消肿除痹、祛黑痣、治疣赘、润肌肤之功;对脾胃湿热、大便秘结、寻常疣、高血脂有食疗作用。\\n2、养气补血：黄豆芽具有清热明目、补气养血、防止牙龈出血、心血管硬化及低胆固醇等功效。\\n3、预防高血压：豆芽中所含的维生素E能保护皮肤和毛细血管，防止动脉硬化，防治老年高血压。\\n4、美容护发：黄豆芽含丰富的维生素E，常吃黄豆芽能营养毛发，使头发保持乌黑光亮，对面部雀斑有较好的淡化效果。',
        简介:
          '豆芽是大豆经加工处理发出的嫩芽，是一种营养丰富的蔬菜。当今世界“天然”、“健康”食物引领风骚者之一，乃是源自我国的豆芽菜，特别是金灿灿的“如意菜”----黄豆芽。明人陈嶷曾有过赞美黄豆芽的诗句：“有彼物兮，冰肌玉质，子不入污泥，根不资于扶植。”黄豆在发芽过程中更多的营养元素被释放出来，更利于人体吸收，营养更胜黄豆一筹。',
        营养价值:
          '1.黄豆芽热量较低，水分和膳食纤维较高。\\n2.黄豆芽中除了含有在发芽过程中生成的维生素C以外，还含有原来豆中所含有的优质植物性蛋白和维生素B1、维生素B2、钙、钾、磷和铁等丰富的矿物质。\\n3.豆类发芽时在种子内部贮存的部分淀粉和蛋白质在酶的作用下分解，转化成自身生长所需的糖类和氨基酸，使豆类中的淀粉和蛋白质利用率大大提高。'
      }
    },
    {
      id: 34,
      name: '鸡蛋清',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、鸡蛋清性微寒而气清，能易经补气，润肺利咽。\\n2、鸡蛋清不但可以使皮肤变白,而且能使皮肤细嫩。这是因为它含有丰富的蛋白质和少量醋酸,蛋白质可以增强皮肤的润滑作用,醋酸可以保护皮肤的微酸性,以防细菌感染。\\n3、鸡蛋清还具有清热解毒作用。',
        简介:
          '鸡蛋清不但可以使皮肤变白，而且能使皮肤细嫩。这是因为它含有丰富的蛋白质和少量醋酸，蛋白质可以增强皮肤的润滑作用，醋酸可以保护皮肤的微酸性，以防细菌感染。此外，鸡蛋清还具有清热解毒作用。',
        营养价值:
          '每100克鸡蛋清含蛋白质10克,脂肪0.1克,碳水化物1克,灰分0.6克;钙19毫克,磷16毫克,铁0.3毫克,核黄素0.26毫克,尼克酸0.1毫克;维生素A及C缺如:硫胺素0.216微克/克,泛酸<1微克/克,对氨基苯甲酸0.055(干卵白)微克/克。'
      }
    },
    {
      id: 36,
      name: '鸡胸肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强身健体：鸡肉的消化率高，很容易被人体吸收利用，有增强体力、强壮身体的作用。\\n2、提高免疫力：现代社会中天天忙忙碌碌，常处于亚健康状态的白领最好多吃一些，以增强免疫力，减少患病几率。鸡肉具有温中益气、补精填髓、益五脏、补虚损的功效，用于治疗虚劳瘦弱、中虚食少、泄泻头晕心悸、月经不调、产后乳少、消渴、水肿等症状。\\n3、补肾精：可缓解由于肾精不足所导致的小便频繁、耳聋、精少精冷等症状。\\n4、促进智力发育：具有抗氧化和一定的解毒作用。在改善心脑功能、促进儿童智力发育方面，更是有较好的作用。',
        简介:
          '鸡胸肉，是鸡身上最大的两块肉。常见鸡肉，鸡胸肉是在胸部里侧的肉，形状像斗笠，胸脯肉。肉质细嫩，滋味鲜美，营养丰富，能滋补养身。',
        营养价值:
          '1、鸡胸肉含蛋白质、脂肪、钙、磷、铁、镁、钾、钠、维生素A、B1、B2、C、E和烟酸等成分。脂肪含量较少，其中含有高度不饱和脂肪酸。另含胆固醇，组氨酸。\\n2、每100克鸡胸肉含有1.2克左右的咪唑二肽，比猪肉、金枪鱼和鲣鱼等肉类中的含量还要丰富。\\n3、鸡胸肉蛋白质含量较高，一般一块鸡胸肉大约200克，含有40克的蛋白质，差不多可以满足一个人一天大部分的蛋白质需求，且易被人体吸收入利用，含有对人体生长发育有重要作用的磷脂类，是中国人膳食结构磷脂的重要来源之一。\\n4、鸡胸肉肉质细嫩，滋味鲜美，营养丰富，能滋补养身。却只含有与虾、螃蟹等相当的脂肪，是不必担心因动物性脂肪而使人体受到伤害的唯一的肉类。'
      }
    },
    {
      id: 37,
      name: '大葱',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进食欲：葱有助于食欲的增进。同时与维生素B1含量较多的食物一起摄取时，维生素B1所含的淀粉及糖质会变为热量，而提高恢复疲劳的作用。\\n2、预防老年痴呆：有舒张小血管，促进血液循环的作用，有助于防止血压升高所致的头晕，使大脑保持灵活和预防老年痴呆的作用。\\n3、强身健体：经常吃葱的人，即便脂多体胖，但胆固醇并不增高，而且体质强壮。\\n4、防癌抗癌：可降低胃液内的亚硝酸盐含量，对预防胃癌及多种癌症有一定作用。\\n5、治疗感冒：其中的发性辣素还通过汗腺、呼吸道、泌尿系统排出时能轻微刺激刺激相关腺体的分泌，而起到发汗、祛痰、利尿作用。是治疗感冒的中药之一。\\n6、降三高：葱还有降血脂、降血压、降血糖的作用。\\n7、吃葱可以长寿：中国自古就有吃葱可以长寿的说法。',
        简介:
          '大葱是葱的一种，可分为普通大葱、分葱、胡葱和楼葱四个类型。大葱味辛，性微温，具有发表通阳，有解毒调味，发汗抑菌和舒张血管的作用。主要用于风寒感冒、恶寒发热、头痛鼻塞，阴寒腹痛，痢疾泄泻，虫积内阻，乳汁不通，二便不利等症状。大葱含有挥发油，油中主要成分为蒜素，又含有二烯内基硫醚、草酸钙。另外，还含有脂肪、糖类、胡萝卜素等、维生素B、C、烟酸、钙、镁、铁等成分。为多年生草本植物，叶子圆筒形，中间空，脆弱易折，呈青色。在东亚国家以及各处华人地区中，葱常作为一种很普遍的香料调味品或蔬菜食用，在东方烹调中占有重要的角色。',
        营养价值:
          '1. 生葱像洋葱、大葱一样，含烯丙基硫醚。\\n2.葱叶部分要比葱白部分含有更多的维生素A、维C及钙。\\n3.葱含有具有刺激性气味的挥发油和辣素，能祛除腥腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用。'
      }
    },
    {
      id: 38,
      name: '油炸花生米',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进生长发育：花生含丰富的维生素及矿物质，可以促进人体的生长发育。\\n2、健脑益智：花生蛋白中含十多种人体所需的氨基酸，其中赖氨酸可使儿童提高智力，谷氨酸和天门冬氨酸可促使细胞发育和增强大脑的记忆能力。\\n3、延缓衰老：花生中所含有的儿茶素对人体具有很强的抗老化的作用，赖氨酸也是防止过早衰老的重要成分。常食花生，有益于人体延缓衰老，故花生又有“长生果”之称。\\n4、润肺止咳：润肺止咳花生中含有丰富的脂肪油、可以起到润肺止咳的作用，常用于久咳气喘，咯痰带血等病症。\\n5、止血：凝血止血花生衣中含有油脂和多种维生素，并含有使凝血时间缩短的物质，能对抗纤维蛋白的溶解，有促进骨髓制造血小板的功能，对多种出血性疾病，不但有止血的作用，而且对原发病有一定的治疗作用，对人体造血功能有益。”\\n6、降低胆固醇：防止冠心病花生油中含大量的亚油酸，这种物质可使人体内胆固醇分解为胆汁酸排出体外。避免胆固醇在体内沉积，减少高胆固醇发病机会，能够防止冠心病和动脉硬化。另外，花生中含有一种生物活性很强的天然多酚类物质—白藜芦醇，可预防癌症的发生及发展，具有抗动脉粥样硬化和冠心病，缺血性心脏病，高血脂的防治作用。\\n7、养血通乳：滋血通乳花生中含丰富的脂肪油和蛋白质，对产后乳汁不足者，有滋补气血，养血通乳作用。\\n8、防癌：花生纤维组织中的可溶性纤维被人体消化吸收时，会像海绵一样吸收液体和其他物质，然后膨胀成胶带体随粪便排出体外。当这些物体经过肠道时，与许多有害物质接触，吸取某些毒素，从而降低有害物质在体内的积存和所产生的毒性作用，减少肠癌发生的机会。',
        简介:
          '花生米是指去掉花生壳的花生仁，事实上是花生的种子，整个的花生叫做果实，荚果。但一般还是叫做花生米。花生本身是高能、高蛋白和高脂类的植物性食物。',
        营养价值:
          '花生米不含胆固醇和反式脂肪酸，富含微量营养素，植物固醇、白藜芦醇、异黄酮、抗氧化剂等物质，是乳、肉食物的优秀替代品，对平衡膳食、改善中国居民的营养与健康状况具有重要作用。'
      }
    },
    {
      id: 39,
      name: '辣椒段',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解热、镇痛：辣椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、预防癌症：辣椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、增加食欲、帮且消化：辣椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、降脂减肥：辣椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '干辣椒是红辣椒经过干制而成的辣椒产品。它的特点是含水量低、适合长期保藏,但未密封包装或含水量高的干辣椒容易霉变。干辣椒的吃法主要是作为调味料食用',
        营养价值:
          '果实含有辣椒碱（Capsaicin）、高辣椒碱（Homocapsicin）、壬醯香荚兰胺（Noroyl vanillylamide）等。色素有辣红素（Capsanthin）、胡萝卜素（Carotene）。此外尚有维生素C、柠檬酸等。有温中、散寒、开胃、消食的作用。\\n1. 吃饭不香、饭量减少时，在菜里放上一些干辣椒就能改善食欲、增加饭量；\\n2. 辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。'
      }
    },
    {
      id: 41,
      name: '紫皮茄子',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 42,
      name: '青红椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 44,
      name: '油菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、降低血脂：油菜为低脂肪蔬菜，且含有膳食纤维，能与胆酸盐和食物中的胆固醇及甘油三酯结合，并从粪便排出，从而减少脂类的吸收，故可用来降血脂。中医认为油菜能活血化瘀，用于治疗疖肿、丹毒。\\n2、解毒消肿：油菜中所含的植物激素，能够增加酶的形成，对进入人体内的致癌物质有吸附排斥作用，故有防癌功能。此外，油菜还能增强肝脏的排毒机制，对皮肤疮疖、乳痈有治疗作用。\\n3、宽肠通便：油菜中含有大量的植物纤维素，能促进肠道蠕动，增加粪便的体积，缩短粪便在肠腔停留的时间，从而治疗多种便秘，预防肠道肿瘤。\\n4、强身健体：油菜含有大量胡萝卜素和维生素C，有助于增强机体免疫能力。油菜所含钙量在绿叶蔬菜中为最高。',
        简介:
          '油菜，又叫油白菜，苦菜，是十字花科植物油菜的嫩茎叶，原产我国，颜色深绿，帮如白菜，属十字花科白菜变种。南北广为栽培，四季均有供产。油菜中含多种营养素，所含的维生素C丰富。在网络上也作为“有才”的同义词。',
        营养价值:
          '油菜为低脂肪蔬菜，且含有膳食纤维，能与胆酸盐和食物中的胆固醇及甘油三酯结合从粪便排出，从而减少脂类的吸。\\n油菜中含有大量的植物纤维素，能促进肠道蠕动，增加粪便的体积，缩短粪便在肠腔停留的时间。所以平时是油菜来通肠润便是不错的选择。\\n油菜所含有的胡萝卜素和维生素C是及其丰富的，有助于增强机体免疫能力。油菜所含钙量在绿叶蔬菜中为最高，一个成年人一天吃一斤油菜，其所含钙、铁、维生素A和维生素C即可满足人体需求。'
      }
    },
    {
      id: 45,
      name: '瘦猪肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效，主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴、润肌肤、利小便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉是目前人们餐桌上重要的动物性食品之一。因为猪肉纤维较为细软，结缔组织较少，肌肉组织中含有较多的肌间脂肪。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 46,
      name: '泡椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲：泡椒味道酸辣，清脆爽口，常食能起到增进食欲的功效。\\n2、帮助消化：食用泡椒能促进肠胃消化液分泌，能起到促进消化的作用。\\n3、调理肠胃：泡椒是一种泡菜，含有乳酸菌等多用益生菌，常食能起到调理肠胃菌群平衡的功效。',
        简介:
          '泡椒，俗称“鱼辣子”，是川菜中特有的调味料。泡椒具有色泽红亮、辣而不燥、辣中微酸的特点，早在前几年，用其制作的泡椒系列菜就在川内比较流行了。',
        营养价值:
          '泡椒是一种泡菜，含有乳酸菌等多用益生菌，常食能起到调理肠胃菌群平衡的功效。'
      }
    },
    {
      id: 48,
      name: '五花肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾养血：猪肉味甘咸、性平，入脾、胃、肾经;补肾养血，滋阴润燥;主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴，润肌肤，利二便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '五花肉（又称肋条肉、三层肉）位于猪的腹部，猪腹部脂肪组织很多，其中又夹带着肌肉组织，肥瘦间隔，故称“五花肉”。这部分的瘦肉也最嫩且最多汁。五花肉一直是一些代表性中菜的最佳主角，如梅菜扣肉、南乳扣肉、东坡肉、回锅肉、鲁肉饭、瓜仔肉、粉蒸肉等等。它的肥肉遇热容易化，瘦肉久煮也不柴。',
        营养价值:
          '猪肉含有丰富的优质蛋白质和必需的脂肪酸，并提供血红素（有机铁）和促进铁吸收的半胱氨酸，能改善缺铁性贫血。'
      }
    },
    {
      id: 49,
      name: '青蒜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、杀菌抑菌：青蒜的辣味主要来自于其含有的辣素，这种辣素除具有醒脾气、消积食的作用外，还有良好的杀菌、抑菌作用，对流感、肠炎等因环境污染而引起的疾病，有很好的预防作用。\\n2、预防血栓：青蒜具有明显的降血脂及预防冠心病和动脉硬化的作用，并可防止血栓的形成。\\n3、预防癌症：蒜苗能保护肝脏，诱导肝细胞脱毒酶的活性，可以阻断亚硝胺致癌物质的合成，从而对预防癌症有一定的作用。',
        简介:
          '又名蒜苗。青蒜是大蒜青绿色的幼苗，以其柔嫩的蒜叶和叶鞘供食用。品质好的青蒜应该鲜嫩，株高在35厘米以上，叶色鲜绿，不黄不烂，毛根白色不枯萎，而且辣味较浓。',
        营养价值:
          '青蒜中含有蛋白质、胡萝卜素、硫胺素、核黄素等营养成分。它的辣味主要来自于其含有的辣素，这种辣素具有醒脾气、消积食的作用。还有良好的杀菌、抑菌作用，能有效预防流感，肠炎等因环境污染引起的疾病。青蒜对于心脑血管有一定的保护作用，可预防血栓的形成，同时还能保护肝脏，诱导肝细胞脱毒酶的活性，可以阻断亚硝胺致癌物质的合成，对预防癌症有一定的作用。\\n'
      }
    },
    {
      id: 50,
      name: '姜片',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲、促消化：口嚼生姜，可引起血压升高。姜辣素对口腔和胃粘膜有刺激作用，能促进消化液分泌，增进食欲。可使肠张力、节律和蠕动增加。\\n2、镇吐：有末梢性镇吐作用，有效成分为姜酮和姜烯酮的混合物。治疗胃寒呕吐。也可治胃热呕吐。\\n3、活血驱寒：用生姜、红糖熬制的姜汤可活血驱寒，防治感冒，自古就是风寒感冒的食疗良药。\\n4、杀菌：体外实验表明，姜对伤寒杆菌、霍乱弧菌有明显的抑制作用。\\n5、助阳：按中医理论，生姜是助阳之品。\\n6、解毒：生姜又能解生半夏、生南星之毒，煎汤饮服，可用于中半夏、南星毒引起的喉哑舌肿麻木等症',
        简介:
          '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。',
        营养价值:
          '1、姜含有蛋白质、多种维生素、胡萝卜素、钙、铁、磷。\\n2、姜中含有姜醇、姜烯、水芹烯、柠檬醛和芳香等油性的挥发油;还有姜辣素、树脂、淀粉和纤维等。'
      }
    },
    {
      id: 51,
      name: '葱段',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进食欲：葱有助于食欲的增进。同时与维生素B1含量较多的食物一起摄取时，维生素B1所含的淀粉及糖质会变为热量，而提高恢复疲劳的作用。\\n2、预防老年痴呆：有舒张小血管，促进血液循环的作用，有助于防止血压升高所致的头晕，使大脑保持灵活和预防老年痴呆的作用。\\n3、强身健体：经常吃葱的人，即便脂多体胖，但胆固醇并不增高，而且体质强壮。\\n4、防癌抗癌：可降低胃液内的亚硝酸盐含量，对预防胃癌及多种癌症有一定作用。\\n5、治疗感冒：其中的发性辣素还通过汗腺、呼吸道、泌尿系统排出时能轻微刺激刺激相关腺体的分泌，而起到发汗、祛痰、利尿作用。是治疗感冒的中药之一。\\n6、降三高：葱还有降血脂、降血压、降血糖的作用。\\n7、吃葱可以长寿：中国自古就有吃葱可以长寿的说法。',
        简介:
          '葱（学名：Allium fistulosum L.），为百合科葱属多年生草本植物。鳞茎单生，圆柱状，稀为基部膨大的卵状圆柱形；鳞茎外皮白色，稀淡红褐色，膜质至薄革质，不破裂。叶圆筒状，中空；花葶圆柱状，中空，中部以下膨大，向顶端渐狭；总苞膜质，伞形花序球状，多花，较疏散；花被片长6-8.5毫米，近卵形；花丝为花被片长度的1.5-2倍，锥形；子房倒卵状，腹缝线基部具不明显的蜜穴；花柱细长，伸出花被外。花果期4-7月。',
        营养价值:
          '1. 生葱像洋葱、大葱一样，含烯丙基硫醚。\\n2.葱叶部分要比葱白部分含有更多的维生素A、维C及钙。\\n3.葱含有具有刺激性气味的挥发油和辣素，能祛除腥腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用。'
      }
    },
    {
      id: 52,
      name: '豆豉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '豆豉作为家常调味品，适合烹饪鱼肉时解腥调味。豆豉又是一味中药，风寒感冒，怕冷发热，寒热头痛，鼻塞喷嚏，腹痛吐泻者宜食；胸膈满闷，心中烦躁者宜食。',
        简介:
          '豆豉（Glycine max）是以大豆或黄豆为主要原料，利用毛霉、曲霉或者细菌蛋白酶的作用，分解大豆蛋白质，达到一定程度时，加盐、加酒、干燥等方法，抑制酶的活力，延缓发酵过程而制成。\\n豆豉的种类较多，按加工原料分为黑豆豉和黄豆豉，按口味可分为咸豆豉和淡豆豉。我国长江以南地区常用豆豉作为调料，也可直接蘸食。豆豉为传统发酵豆制品，以颗粒完整、乌黑发亮、松软即化且无霉腐味为佳。',
        营养价值:
          '1、豆豉中含有很高的尿激酶，尿激酶具有溶解血栓的作用。\\n2、豆豉中含有多种营养素，可以改善胃肠道菌群,常吃豆豉还可帮助消化、预防疾病、延缓衰老、增强脑力、降低血压、消除疲劳、减轻病痛、预防癌症和提高肝脏解毒(包括酒精毒)功能。\\n3、豆豉还可以解诸药毒、食毒。'
      }
    },
    {
      id: 54,
      name: '猪里脊',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增长肌肉：它对增长肌肉、增强力量特别有效。在进行训练的头几秒钟里，肌氨酸是肌肉燃料之源，它可以有效补充三磷酸腺苷，从而使训练能坚持得更久。其中肉毒碱主要用于支持脂肪的新陈代谢，产生支链氨基酸，是对健美运动员增长肌肉起重要作用的一种氨基酸。\\n2、增加免疫力：可帮你增强免疫力，促进蛋白质的新陈代谢和合成，从而有助于紧张训练后身体的恢复。\\n3、促进康复：能提高机体抗病能力，对生长发育及手术后、病后调养的人在补充失血、修复组织等方面物别适宜。\\n4、补铁补血：铁是造血所必需的元素，而牛肉中富含大量的铁，多食用牛肉有助于缺铁性贫血的治疗。',
        简介:
          '猪肉又名豚肉，是主要家畜之一。属猪科动物。其性味甘咸平，含有丰富的蛋白质及脂肪、碳水化合物、钙、磷、铁等成分。 猪肉是日常生活的主要副食品，具有补虚强身，滋阴润燥、丰肌泽肤的作用。凡病后体弱、产后血虚、面黄赢瘦者，皆可用之作营养滋补之品。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 55,
      name: '金针菇',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进智力发育：金针菇氨基酸含量高，对促进智力发育、增强智力发育、增强记忆力有裨益，是儿童保健增智、老年人延年益寿、成年人增强记忆力的必须品，在多国家誉为“益智菇”。\\n2、促进新陈代谢：增强体内的生物活性，促进新陈代谢。有利益营养素的吸收。\\n3、降血脂：抑制血脂升高，降低胆固醇，防止高血脂症，从而减少心血管疾病的发生。\\n4、抗疲劳：抗菌消炎，消除重金属毒素，抗肿瘤。\\n5、预防过敏：预防哮喘，鼻炎，湿疹等过敏症。',
        简介:
          '金针菇为真菌植物门真菌冬菇的子实体，营养丰富，清香扑鼻。其菌盖小巧细腻，黄褐色或淡黄色，干部形似金针，故名金针菇。还有一种色泽白嫩的，叫银针菇。金针菇不仅味道鲜美，而且营养丰富，是拌凉菜和火锅食品的原粮之一。',
        营养价值:
          '1. 金针菇含有人体必需氨基酸成分较全，其中赖氨酸和精氨酸含量尤其丰富，对增强智力尤其是对儿童的身高和智力发育有良好的作用，人称“增智菇”；\\n2. 金针菇中还含有一种叫朴菇素的物质，有增强机体对癌细胞的抗御能力，常食金针菇还能降胆固醇，预防肝脏疾病和肠胃道溃疡，增强机体正气，防病健身；\\n3. 金针菇中含锌量比较高，也可有促进儿童智力发育和健脑的作用；\\n4. 金针菇能有效地增强机体的生物活性，促进体内新陈代谢，有利于食物中各种营养素的吸收和利用，对生长发育也大有益处；\\n5. 金针菇可抑制血脂升高，降低胆固醇，防治心脑血管疾病；\\n6. 食用金针菇具有抵抗疲劳，抗菌消炎、清除重金属盐类物质、抗肿瘤的作用。\\n'
      }
    },
    {
      id: 56,
      name: '绿豆芽',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、清热解暑：中医认为经常食用绿豆芽可清热解毒，利尿除湿，解酒毒热毒。\\n2、消除紧张：具有保护肌肉、皮肤、血管的作用，消除紧张综合征。\\n3、治疗口腔溃疡：绿豆芽中含有核黄素，口腔溃疡的人很适合食用。\\n4、防治便秘：绿豆芽富含膳食纤维，是便秘患者的健康蔬菜，有预防消化道癌症（食道癌、胃癌、直肠癌）的功效。\\n5、减少胆固醇的堆积：它有清除血管壁中胆固醇和脂肪的堆积、防止心血管病变的作用。',
        简介:
          '绿豆芽，即绿豆的芽。绿豆在发芽过程中，维生素C会增加很多，而且部分蛋白质也会分解为各种人所需的氨基酸，可达到绿豆原含量的七倍，所以绿豆芽的营养价值比绿豆更大。',
        营养价值:
          '每100g鲜豆芽含维生素C30-40mg。每100g干物质含天冬氨酸6.4g、酪氨酸1.9g、缬草氨酸1.7g、亮氨酸1.6g、苯丙氨酸1.5g、异亮氨酸1.2g、赖氨酸1.1g、苏氨酸1.0g、甲硫氨酸0.5g、脯氨酸2.6g、谷氨酸2.0g、精氨酸1.7g、丙氨酸1.2g、丝氨酸1.1g、甘氨酸0.8g、组氨酸0.6g、胱氨酸0.5g。\\n食用芽菜是近年来的新时尚，芽菜中以绿豆芽最为便宜，而且营养丰富，绿豆芽也是自然食用主义都所推崇的食品之一。绿豆在发芽过程中，维生素C会增加很多，而且部分蛋白质也会分解为各种人所需的氨基酸，可达到绿豆原含量的七倍，所以绿豆芽的营养价值比绿豆更大。'
      }
    },
    {
      id: 59,
      name: '青虾',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增强人体免疫力：虾的营养价值极高，能增强人体的免疫力和性功能，补肾壮阳，抗早衰，可医治肾虚阳痿、畏寒、体倦、腰膝酸痛等病症。\\n2、通乳汁：如果妇女产后乳汁少或无乳汁，鲜虾肉500克，研碎，黄酒热服，每日3次，连服几日，可起催乳作用。\\n3、缓解神经衰弱：虾皮有镇静作用，常用来治疗神经衰弱，植物神经功能紊乱诸症。海虾是可以为大脑提供营养的美味食品。海虾中含有三种重要的脂肪酸，能使人长时间保持精力集中。\\n4、有利于病后恢复：虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物。\\n5、预防动脉硬化：虾中含有丰富的镁，镁对心脏活动具有重要的调节作用，能很好的保护心血管系统，它可减少血液中胆固醇含量，防止动脉硬化，同时还能扩张冠状动脉，有利于预防高血压及心肌梗死。\\n6、消除“时差症”：日本大阪大学的科学家最近发现，虾体内的虾青素有助于消除因时差反应而产生的“时差症”。',
        简介:
          '青虾是经济价值很高的淡水虾类之一。它生长快，个体大，繁殖快，生命力强，广泛分布于我国淡水湖泊中。青虾肉质细嫩鲜美，营养丰富，每百克食用部分含蛋白质16.40克，营养学家认为它有一定的补脑功能。',
        营养价值:
          '1、虾中含有20%的蛋白质，是蛋白质含量很高的食品之一，是鱼、蛋、奶的几倍甚至十几倍，虾和鱼肉相比，所含的人体必需氨基酸缬氨酸并不高，但却是营养均衡的蛋白质来源，另外，虾类含有甘氨酸，这种氨基酸的含量越高，虾的甜味就越高。\\n2、虾和鱼肉禽肉相比，脂肪含量少，并且几乎不含作为能量来源的动物糖质，虾中的胆固醇含量较高，同时含有丰富的能降低人体血清胆固醇的牛磺酸，虾含有丰富的钾、碘、镁、磷等微量元素和维生素A等成分。\\n'
      }
    },
    {
      id: 61,
      name: '鲫鱼',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、鲫鱼有健脾利湿，和中开胃，活血通络、温中下气之功效。\\n2、增强抗病能力，有滋补作用。',
        简介:
          '又名河鲫、鲋鱼、喜头、鲫瓜子、喜头鱼、海附鱼、童子鲫、鲭。\\n鲫鱼又名鲋鱼，别称喜头，为鲤科动物，产于全国各地。鲫鱼俗称鲫瓜子，肉味鲜美，肉质细嫩，它营养全面，含蛋白质多，脂肪少，食之鲜而不腻，略感甜味；它是一种适应性很强的鱼类，栖于江河，湖泊、池沼、河渠中，尤以水草丛生的浅水湖和池塘较多，鲫鱼四季均产，但以2～4月和8～12月产的最肥。鲫鱼体侧扁而高，体较小，背部发暗，腹部色浅，体色因产地而异，多为黑色带金属光泽，嘴上无须，鳞较小，鳍的形状同鲤鱼。鲫鱼肉嫩味美，营养价值较高，但刺细小且多。',
        营养价值:
          '1、鲫鱼所含的蛋白质质优、齐全、易于消化吸收，是肝肾疾病，心脑血管疾病患者的良好蛋白质来源，常食可增强抗病能力，肝炎、肾炎、高血压、心脏病，慢性支气管炎等疾病患者可经常食用；\\n2、鲫鱼有健脾利湿，和中开胃，活血通络、温中下气之功效，对脾胃虚弱、水肿、溃疡、气管炎、哮喘、糖尿病有很好的滋补食疗作用；产后妇女炖食鲫鱼汤，可补虚通乳；\\n3、鲫鱼肉嫩味鲜，可做粥、做汤、做菜、做小吃等。尤其适于做汤，鲫鱼汤不但味香汤鲜，而且具有较强的滋补作用，非常适合中老年人和病后虚弱者食用，也特别适合产妇食用。\\n'
      }
    },
    {
      id: 62,
      name: '生姜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲、促消化：口嚼生姜，可引起血压升高。姜辣素对口腔和胃粘膜有刺激作用，能促进消化液分泌，增进食欲。可使肠张力、节律和蠕动增加。\\n2、镇吐：有末梢性镇吐作用，有效成分为姜酮和姜烯酮的混合物。治疗胃寒呕吐。也可治胃热呕吐。\\n3、活血驱寒：用生姜、红糖熬制的姜汤可活血驱寒，防治感冒，自古就是风寒感冒的食疗良药。\\n4、杀菌：体外实验表明，姜对伤寒杆菌、霍乱弧菌有明显的抑制作用。\\n5、助阳：按中医理论，生姜是助阳之品。\\n6、解毒：生姜又能解生半夏、生南星之毒，煎汤饮服，可用于中半夏、南星毒引起的喉哑舌肿麻木等症',
        简介:
          '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。',
        营养价值:
          '1、姜含有蛋白质、多种维生素、胡萝卜素、钙、铁、磷。\\n2、姜中含有姜醇、姜烯、水芹烯、柠檬醛和芳香等油性的挥发油;还有姜辣素、树脂、淀粉和纤维等。'
      }
    },
    {
      id: 64,
      name: '白菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、美肤养颜：大白菜含有丰富的水分和维生素，常吃大白菜不但可以补充身体流失的水分，其所含的维生素C、E还能预防皮肤色素沉着，起到护肤养颜的效果。\\n2、生津养胃：中医认为大白菜有养胃生津、清热除烦的作用，将大白菜捣烂取汁与百合、麦冬加水煎温服，对胃阴亏虚引起的胃隐痛有较好的疗效。\\n3、消脂减肥：大白菜是低脂低热食品，含水量高，膳食纤维含量丰富，食用大白菜可以加快新陈代谢，预防便秘和皮下脂肪堆积，是经济实惠的减肥食物。\\n4、清热解毒：大白菜性寒味甘，很适合口渴烦热、痰热咳嗽、风热感冒等患者食用。\\n5、预防坏血病：大白菜营养丰富，其维生素C含量是苹果、梨的4~5倍，经常食用白菜可以预防因缺乏维生素C引起的各类疾病如坏血病、牙龈出血等病。\\n6、预防乳腺癌：美国纽约激素研究所的一项调查表明，中日妇女比西方妇女得乳腺癌的几率低很多，是由于常吃白菜的原因。这是因为白菜中含有一种能帮助分解与乳腺癌相关的雌激素的化合物—吲哚-3-甲醇。\\n7、润肠通便：大白菜水分含量大约为95%，另外还含有丰富的膳食纤维，食用大白菜可以刺激肠胃蠕动，帮助消化，促进肠道中废弃物的排泄，有助于预防便秘和大肠癌。',
        简介:
          '白菜原产于我国北方，是十字花科芸薹属叶用蔬菜，通常指大白菜；也包括小白菜以及由甘蓝的栽培变种结球甘蓝，即“圆白菜”或“洋白菜”。引种南方，南北各地均有栽培。十九世纪传入日本、欧美各国。白菜种类很多，北方的大白菜有山东胶州大白菜、北京青白、天津青麻叶大白菜、东北大矮白菜、山西阳城的大毛边等。同时白菜作为相关网络用语使用。',
        营养价值:
          '1、白菜含有丰富的粗纤维，不但能起到润肠、促进排毒的作用又刺激肠胃蠕动，促进大便排泄，帮助消化的功能。对预防肠癌有良好作用。\\n2、秋冬季节空气特别干燥，寒风对人的皮肤伤害极大。白菜中含有丰富的维生素C、维生素E，多吃白菜，可以起到很好的护肤和养颜效果。\\n3、美国纽约激素研究所的科学家发现，中国和日本妇女乳腺癌发病率之所以比西方妇女低得多，是由于她们常吃白菜的缘故。白菜中有一些微量元素，它们能帮助分解同乳腺癌相联系的雌激素。\\n'
      }
    },
    {
      id: 66,
      name: '鲤鱼',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、消水肿通乳汁：有补脾健胃、利水消肿、通乳、清热解毒、止嗽下气，对各种水肿、浮肿、腹胀、少尿、黄疸、乳汁不通皆有益。\\n2、明目：鲤鱼的视网膜上含有大量的维生素A，因此，鲤鱼眼睛明目的效果特别好。\\n3、鲤鱼的脂肪多为不饱和脂肪酸，能很好的降低胆固醇，可以防治动脉硬化、冠心病，因此，多吃鱼可以健康长寿。\\n4、中医学认为，鲤鱼各部位均可入药。鲤鱼皮可治疗鱼梗；鲤鱼血可治疗口眼歪斜；鲤鱼汤可治疗小儿身疮；用鲤鱼治疗怀孕妇女的浮肿，胎动不安有特别疗效。',
        简介:
          '又名龙门鱼、鲤拐子、赤鲤、黄鲤、白鲤、赖鲤。\\n鲤鱼因鱼鳞上有十字纹理而得名。体态肥肚，肉质细嫩。\\n产于我国各地淡水河湖、池塘。一年四季均产，但以2-3月产的最肥。',
        营养价值:
          '1、鲤鱼的蛋白质不但含量高，而且质量也佳，人体消化吸收率可达96%，并能供给人体必需的氨基酸、矿物质、维生素A和维生素D。\\n2、鲤鱼的脂肪多为不饱和脂肪酸，能很好的降低胆固醇，可以防治动脉硬化、冠心病，因此，多吃鱼可以健康长寿。\\n3、鲤鱼的钾含量较高，可防治低钾血症，增加肌肉强度，与中医的“脾主肌肉四肢”的健脾作用一致。'
      }
    },
    {
      id: 67,
      name: '面粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '具有养心、益肾、除热、止渴 主治脏躁、烦热、消渴、泄痢、痈肿、外伤出血及烫伤等功效。',
        简介:
          '中筋面粉即普通面粉。蛋白质含量平均在11%左右，中筋粉多用在中式点心制作上，如包子、馒头、饺子等。大部分中式点心都是以中筋粉来制作的。',
        营养价值:
          '面粉富含蛋白质、碳水化合物、维生素和钙、铁、磷、钾、镁等矿物质，有养心益肾、健脾厚肠、除热止渴的功效。'
      }
    },
    {
      id: 69,
      name: '鱼',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 70,
      name: '盐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、杀菌：盐水有杀菌、保鲜防腐作用。用来清洗创伤可以防止感染，撒在食物上可以短期保鲜，用来腌制食物还能防变质。\\n2、调味道：食盐调味，能多项式发腻提鲜，祛除腥膻之味，使食物保持原料的本味。\\n3、促进皮肤的新陈代谢：用盐调水能清除皮肤表面的角质和污垢，使皮肤呈现出一种鲜嫩、透明的靓丽之感可以促进全身皮肤的新陈代谢，防治某些皮肤病，起到较好的自我保健作用。',
        简介:
          '盐是指一类金属离子或铵根离子（NH4+）与酸根离子或非金属离子结合的化合物。如氯化钠，硝酸钙，硫酸亚铁和乙酸铵等，如硫酸钙，氯化铜，醋酸钠，一般来说盐是复分解反应的生成物，盐与盐反应生成新盐与新盐，盐与碱反应生成新盐与新碱，盐与酸反应生成新盐与新酸，如硫酸与氢氧化钠生成硫酸钠和水，氯化钠与硝酸银反应生成氯化银与硝酸钠等。也有其他的反应可生成盐，例如置换反应。可溶性盐的溶液有导电性，是因为溶液中有可自由游动的离子，故此可作为电解质。盐酸既是盐化工的重要产品，又是生产硅材料的重要原料。它是晶体的一种。',
        营养价值:
          '食盐主要成分为氯化钠氯化钠的性质：白色晶体，易溶于水。溶解度随温度变化不大。味咸可食用（实验中有掺加碘酸钾）。颜色反应为黄色（钠离子的物理性质）。他的水溶液能与硝酸银溶液反应生成白色不容于稀硝酸的沉淀，（氯离子的化学性质）常温下大多为固体，在水中溶解性不同'
      }
    },
    {
      id: 71,
      name: '料酒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、活血通络：可帮助血液循环，促进新陈代谢，具有补血养颜，活血祛寒，通经活络，能有效抵御寒冷刺激，预防感冒。\\n2、增加口感：在烹饪肉、禽、蛋等菜肴时，调入料酒能渗透到食物组织内部，溶解微量的有机物质，从而使菜肴质地松嫩。',
        简介:
          '料酒就是专门用于烹饪调味的酒。在我国的应用已有上千年的历史，日本、美国、欧洲的某些国家也有使用料酒的习惯。从理论上来说，啤酒、白酒、黄酒、葡萄酒、威士忌都可用作料酒。但人们经过长期的实践、品尝后发现，不同的料酒所烹饪出来的菜肴风味相距甚远。经过反复试验，人们发现以黄酒烹饪为最佳。 酒为人们所喜欢的饮料，品种极多，作调味品的主要是黄酒。福建、山东、浙江等地都有生产，以浙江沼兴所产质量较好。黄酒是用糯米或小米酿造而成的，其成分主要有酒精、糖分、糊精、有机酸类、氨基酸、酯类、醛类、杂醇油及浸出物等。其酒精浓度低，含量在15%以下，而酯类含量高，富含氨基酸，所以香味浓郁，味道醇厚，在烹制菜肴中使用广泛。黄酒的调味作用主要为去腥、增香。',
        营养价值:
          '料酒富含人体需要地8种氨基酸，如亮氨酸、异亮氨酸、蛋氨酸、苯丙氨酸、苏氨酸，它们在被加热时，可以产生多种果香花香和烤面包的味道。其中，赖氨酸、色氨酸可以产生大脑神经传递物质，改善睡眠，有助于人体脂肪酸的合成，对儿童的身体发育也有好处。其实，料酒的营养成分是来源于黄酒，再加入花椒、大料、桂皮、丁香、砂仁、姜等多种香料酿制而成。'
      }
    },
    {
      id: 73,
      name: '山药',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、健脾益胃、助消化：山药含有淀粉酶、多酚氧化酶等物质，有利于脾胃消化吸收功能。\\n2、滋肾益精：山药含有多种营养素，有强健机体，滋肾益精的作用。\\n3、益肺止咳：山药含有皂甙、黏液质，有润滑，滋润的作用，故可益肺气，养肺阴，治疗肺虚痰嗽久咳之症；\\n4、降低血糖：山药含有粘液蛋白，有降低血糖的作用。\\n5、延年益寿：预防心血疾病，取得益志安神、延年益寿的功效。\\n6、抗肝昏迷：近年研究发现山药具有镇静作用，可来抗肝昏迷。',
        简介:
          '薯蓣，通称山药。多年生草本植物，茎蔓生，常带紫色，块根圆柱形，叶子对生，卵形或椭圆形，花乳白色，雌雄异株。块根含淀粉和蛋白质，可以吃。',
        营养价值:
          '1、淀粉酶\\n山药中不但含有大量植物蛋白，含有丰富的山药淀粉酶以及多酚氧化酶等天然营养成分，这些营养物质可以直接作用于人类的疲惫，能促进脾胃消化，缓解脾胃虚弱，对人类的脾胃虚寒，脾胃不和以及食少体倦和腹部胀痛都有很好的预防作用。\\n2、黏液蛋白\\n山药中除了含有淀粉酶和植物蛋白以外它含有多种对人体有益的矿物质和维生素，除此以外，粘液蛋白也是山药中最重要的存在，这种物质不单能调节血糖，预防血糖升高，还能清除血管壁上的胆固醇与脂肪，能预防血管老化，更能提高身体免疫力，减少癌症发生。'
      }
    },
    {
      id: 74,
      name: '绵白糖',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、适当食用白糖有助于提高机体对钙的吸收，但过多就会妨碍钙的吸收。\\n2、吃糖后应及时漱口或刷牙，以防龋齿的产生。\\n3、糖尿病病人不易直接食用食糖，最好是以甜味剂替代。\\n4、白砂糖味甘、性平，归脾、肺经；有润肺生津、止咳、和中益肺、舒缓肝气、滋阴、调味、除口臭、解盐卤毒之功效。',
        简介:
          '绵白糖简称绵糖，也叫白糖，是我国人民比较喜欢的一种食用糖。它质地绵软、细腻，结晶颗粒细小，并在生产过程中喷入了2.5%左右的转化糖浆。而白砂糖的主要成分是蔗糖，故绵白糖的纯度不如白砂糖高。',
        营养价值:
          '白砂糖，味甘、性平；归脾、肺经；有润肺生津、止咳、和中益肺、舒缓肝气、滋阴、调味、除口臭、解盐卤毒之功效。'
      }
    },
    {
      id: 75,
      name: '生粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '生粉在中式烹调上除了勾茨使食物产生滑润的口感之外，亦常用来做为软化肉质的腌肉料之一。',
        简介:
          '生粉是港式食谱中常出现的名词，多是用来勾芡用的，在香港使用的生粉为玉米粉，而在台湾惯用的茨粉则为太白粉。生粉在中式烹调上除了勾芡使食物产生滑润的口感之外，亦常用来做为软化肉质的腌肉料之一。生粉(即太白粉)又称豆粉豆菱粉，是用蚕豆或菱角制成。生粉的用途很广，可以作炒菜时的调料，也可以做凉粉。',
        营养价值:
          '由于用芡粉所做的浆、粉、糊、汁、芡的处理，还可起到保护层的作用，既防止营养成分的流失或被破坏，也可避免动物蛋白接触高温焦糊而产生的不利健康的物质。'
      }
    },
    {
      id: 77,
      name: '鸡中翅',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、美容养颜：大量的成胶原及弹性蛋白的，对于血管、皮肤及内脏颇具效果\\n2、促进身体发育：翅膀内所含大量的维生素A，远超过青椒。对视力、生长、上皮组织及骨骼的发育、精子的生成和胎儿的生长发育都是必需的。',
        简介: '就是鸡翅膀中间的那一截',
        营养价值:
          '鸡翅含有多量可强健血管及皮肤的成胶原及弹性蛋白等，对于血管、皮肤及内脏颇具效果。翅膀内所含大量的维生素A，远超过青椒。对视力、生长、上皮组织及骨骼的发育、精子的生成和胎儿的生长发育都是必需的。'
      }
    },
    {
      id: 78,
      name: '可乐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、缓解疲劳：可乐含有咖啡因。咖啡因，能够暂时的驱走睡意并恢复精力。\\n2、开胃助食：可乐含有咖啡因。咖啡因会刺激交感神经，刺激胃肠分泌胃酸，促进消化、防止胃胀、胃下垂。\\n3、减肥：使用可乐洗澡是一种温热疗法，有减肥的作用。可乐含有咖啡因。咖啡因可以加快身体代谢，减少脂肪形成。 \\n4、改善肝脏功能：研究结果称患有肝炎或肝硬化等丙型(C型)慢性肝脏疾病的患者，每天饮用一杯以上可乐的话，其肝脏的机能将会得到改善。 \\n5、美容皮肤：餐后喝杯可乐，能有效地使皮肤变白。可乐还可以促进心血管的循环。 \\n6、解酒：酒后喝可乐，能使由酒精转变而来的乙醛快速氧化，分解成水和二氧化碳而排出体外。\\n7、防止心血管疾病：低血压患者每天喝杯可乐，可以使自己更佳。\\n8、熄风止痉：可乐可增加高密度胆固醇，加速代谢坏的胆固醇，减少冠状动脉粥样化、降低中风机率。 \\n9、缓解便秘：可乐可以促进代谢机能，活络消化器官，对便秘有很大功效。 \\n10、利尿除湿：可乐含有咖啡因。咖啡因可促进肾脏机能，排出体内多余的钠离子，提高排尿量，改善腹胀水肿，有助减重瘦身。 可乐更加有利尿作用。 \\n11、预防胆结石：对于含咖啡因的可乐，能刺激胆囊收缩，并减少胆汁内容易形成胆结石的胆固醇。\\n12、影响情绪：一般人一天吸收300毫克的咖啡因，对一个人的机警和情绪会带来良好的影响。 \\n13、可乐防止放射线伤害：在老鼠实验中得到这一结论，并表示可以应用到人类。 \\n14、改善发质：使用可乐洗头可以改善发质。\\n15、降低体温：无论什么原因引起体温上升，喝几口汽水，可使体温下降，起到暂时退烧的作用。',
        简介:
          '可乐(Cola)，是指甜味、含咖啡因的碳酸饮料，有咖啡因但不含酒精，非常流行。可乐主要口味包括有香草、肉桂、柠檬香味等。名称来自可乐早期的材料之一：可乐果提取物，最知名的可乐品牌有可口可乐和百事可乐。',
        营养价值:
          '所含成份：原味：碳酸水（糖浆）〈水+二氧化碳〉、白砂糖、焦糖色、磷酸、香料<包含咖啡因>等等\\n可口可乐中含有磷酸、咖啡因和精制糖等成分，均有增加钙流失的效应。已有人体研究证实，少女的骨折率与可乐饮用量有很强的相关性，大量饮用者比不饮者的骨折风险高出5倍。可乐与牙齿损害的关系也有充足的研究证据。　　可口可乐显然不是一种有益营养和健康的饮料。需要特别提醒的是孩子、老人和中年女性，因为孩子更容易对咖啡因上瘾和出现营养不良的问题。中年女性对肥胖和钙流失应更加关注，而老年人营养吸收能力下降，也需要控制可乐类营养素密度过低的饮料。另外，可乐中含有咖啡因，常喝的人突然停饮，可能引起头痛、易怒、胃部不适等症状。不妨慢慢降低饮用量，从而降低可能存在的健康风险。'
      }
    },
    {
      id: 79,
      name: '柠檬',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、生津解暑开胃：柠檬果皮富含芳香挥发成分，可以生津解暑，开胃醒脾。\\n2、预防心血管疾病：柠檬富含维生素C和维生素P，能增强血管弹性和韧性，可预防和治疗高血压和心肌梗塞症状。\\n3、清热化痰：柠檬也能袪痰。\\n4、抗菌消炎：柠檬富含维生素C，具有抗菌消炎、增强人体免疫力等多种功效。\\n5、美容果：柠檬具有很强的抗氧化作用，对促进肌肤的新陈代谢、延缓衰老及抑制色素沉着等十分有效。\\n',
        简介:
          '柠檬（Citrus limon）是芸香科柑桔属的常绿小乔木，原产东南亚，现主要产地为美国、意大利、西班牙和希腊。主要为榨汁用，有时也用做烹饪调料，但基本不用作鲜食。柠檬由阿拉伯人带往欧洲，古希腊、古罗马的文献中均无记载，15世纪时才在意大利热那亚开始种植，1494年在亚速尔群岛出现，富含维生素C。',
        营养价值:
          '柠檬含有烟酸和丰富的有机酸，其味极酸。柠檬酸汁有很强的杀菌作用，对食品卫生很有好处。实验显示，酸度极强的柠檬汁在15分钟内可把海生贝壳内所有的细菌杀死。\\n柠檬富有香气，能解除肉类、水产的腥膻之气，并能使肉质更加细嫩。柠檬还能促进胃中蛋白分解酶的分泌，增加胃肠蠕动。因此，柠檬在西方人日常生活中，经常被用来制作冷盘凉菜及腌食等。\\n柠檬汁中含有大量柠檬酸盐，能够抑制钙盐结晶，从而阻止肾结石形成，甚至已成之结石也可被溶解掉。所以食用柠檬能防治肾结石，使部分慢性肾结石患者的结石减少、变少。\\n吃柠檬还可以防治心血管疾病，使缓解钙离子促使血液凝固的作用，可预防和治疗高血压和心肌梗死。柠檬酸有收缩、增固毛细血管，降低通透性，提高凝血功能及血小板数量的作用，可缩短凝血时间和出血时间31%-71%，具有止血作用。\\n鲜柠檬维生素含量极为丰富，是美容的天然佳品，能防止和消除皮肤色素沉着，具有美白作用。此外，柠檬生食还具有良好的安胎止呕作用。因此柠檬是适合女性的水果。'
      }
    },
    {
      id: 81,
      name: '牛肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增长肌肉：它对增长肌肉、增强力量特别有效。在进行训练的头几秒钟里，肌氨酸是肌肉燃料之源，它可以有效补充三磷酸腺苷，从而使训练能坚持得更久。其中肉毒碱主要用于支持脂肪的新陈代谢，产生支链氨基酸，是对健美运动员增长肌肉起重要作用的一种氨基酸。\\n2、增加免疫力：可帮你增强免疫力，促进蛋白质的新陈代谢和合成，从而有助于紧张训练后身体的恢复。\\n3、促进康复：能提高机体抗病能力，对生长发育及手术后、病后调养的人在补充失血、修复组织等方面物别适宜。\\n4、补铁补血：铁是造血所必需的元素，而牛肉中富含大量的铁，多食用牛肉有助于缺铁性贫血的治疗。',
        简介:
          '牛肉是全世界人都爱吃的食品，中国人消费的肉类食品之一，仅次于猪肉，牛肉蛋白质含量高，而脂肪含量低，所以味道鲜美，受人喜爱，享有“肉中骄子”的美称。',
        营养价值:
          '1.牛肉提供高质量的蛋白质，含有全部种类的氨基酸，各种氨基酸的比例与人体蛋白质中各种氨基酸的比例基本一致，其中所含的肌氨酸比任何食物都高。\\n2.牛肉的脂肪含量很低，但它却是低脂的亚油酸的来源，还是潜在的抗氧化剂。\\n3.牛肉含有矿物质和维他命B群，包括烟酸，维生素B1和核黄素。牛肉还是每天所需要的铁质的最佳来源。\\n4.牛肉还含肉毒碱。\\n'
      }
    },
    {
      id: 82,
      name: '香叶',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '味辛，气香，性温散。治风湿，疝气，阴囊湿疹，疥癣。',
        简介:
          '香叶为多年生草本，高60～90厘米，全株芳香，密被短毛或淡黄色小腺毛。茎基部木质化，节处膨大。叶互生，宽心形或近圆形，近掌状5～7深裂，裂片再分裂为狭裂片，边缘被细毛，有不相等的缺刻。花期春、夏间。我国各地均有栽培。',
        营养价值:
          '传统中医认为，香叶具有祛风除湿的功效，帮助身体排除湿气，还能行气止痛，据说香叶有轻微的麻痹作用，因此可以用来止痛。\\n香叶还能治疗疝气、阴囊湿疹、疥癣等疾病，兼具杀虫功效。\\n香叶还具有温中行气、止痛散寒、除冷健胃的功效，在寒冷天气中，可以在食物中加入一些香叶，能够达到驱寒除湿的效果，还可以帮助健胃。'
      }
    },
    {
      id: 83,
      name: '八角',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '八角有温阳散寒，理气止痛的功效。',
        简介:
          '八角是八角树的果实，学名叫八角茴香，为常用调料。八角能除肉中臭气，使之重新添香，故又名茴香。八角是我国的特产，盛产于广东、广西等地。颜色紫褐，呈八角，形状似星，有甜味和强烈的芳香气味，香气来自其中的挥发性的茴香醛。\\n八角是制作冷菜及炖、焖菜肴中不可少的调味品，其作用为其他香料所不及，也是加工五香粉的主要原料。',
        营养价值:
          '1、八角的主要成分是茴香油，它能刺激胃肠神经血管，促进消化液分泌，增加胃肠蠕动，有健胃、行气的功效，有助于缓解痉挛、减轻疼痛；\\n2、茴香烯能促进骨髓细胞成熟并释放入外周血液，有明显的升高白细胞的作用，主要是升高中性粒细胞，可用于白细胞减少症。'
      }
    },
    {
      id: 84,
      name: '干辣椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解热、镇痛：辣椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、预防癌症：辣椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、增加食欲、帮且消化：辣椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、降脂减肥：辣椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '干辣椒是红辣椒经过干制而成的辣椒产品。它的特点是含水量低、适合长期保藏,但未密封包装或含水量高的干辣椒容易霉变。干辣椒的吃法主要是作为调味料食用',
        营养价值:
          '果实含有辣椒碱（Capsaicin）、高辣椒碱（Homocapsicin）、壬醯香荚兰胺（Noroyl vanillylamide）等。色素有辣红素（Capsanthin）、胡萝卜素（Carotene）。此外尚有维生素C、柠檬酸等。有温中、散寒、开胃、消食的作用。\\n1. 吃饭不香、饭量减少时，在菜里放上一些干辣椒就能改善食欲、增加饭量；\\n2. 辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。'
      }
    },
    {
      id: 85,
      name: '白芷',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、功能主治祛风，燥湿，消肿，止痛。\\n2、治头痛，眉棱骨痛，齿痛，鼻渊，寒湿腹痛，肠风痔漏，赤白带下，痈疽疮疡，皮肤燥痒，疥癣。',
        简介:
          '白芷，多年生高大草本，高1-2.5米，根圆柱形，茎基部径2-5厘米，基生叶一回羽状分裂，复伞形花序顶生或侧生，果实长圆形至卵圆形。以根入药，有祛病除湿、排脓生肌、活血止痛等功能。主治风寒感冒、头痛、鼻炎、牙痛。赤白带下、痛疖肿毒等症，亦可作香料。北方的一些省区有栽培，多自产自销，少数调省外。一般生于林下、林缘、溪旁、灌丛和山谷草地。',
        营养价值:
          '白芷的根含有当归素(Byak-angelicin)、白当归素(Byak-angelicol)、氧化前胡素(Oxypencedanin)、珊瑚菜素(Phellopterin)及一种类当归酸(Angelicacid)的有机酸。此外亦含有白芷毒素(Angelicotoxin)。\\n每100克白芷含热量324千卡,硫胺素0.35毫克,钙3毫克,蛋白质8.9克,核黄素0.54毫克,镁19毫克,脂肪1.5克,烟酸1毫克,铁4.4毫克,碳水化合物68.8克,维生素C1毫克,锰0.73毫克,膳食纤维,5.3克,维生素E1.93毫克,锌0.8毫克,铜0.63毫克,胡罗卜素3.6微克,钾100毫克,磷118毫克,视黄醇11.9微克,钠27.4毫克,硒3.4微克。'
      }
    },
    {
      id: 86,
      name: '丁香',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、具有温中降逆，散寒止痛，暖肾助阳的功效。\\n2、主治胃寒呃逆，呕吐反胃，脘腹冷痛，泄泻痢疾，肾虚阳痿，阴冷疝气，腰膝冷痛，阴疽，口臭齿疳。',
        简介:
          '丁香为桃金娘科植物丁香的花蕾。丁香常绿乔木，原产马来西亚群岛及非洲。我国广东、海南、广西、云南等地植物园有少量栽培。当花蕾由绿色转红色时采摘，晒干。',
        营养价值:
          '丁香花蕾含有丁香油，其主要成分是丁香油酚和丁香烯。野生丁香尚含有丁香酮和番樱桃素。有温中、健胃、止呕及抗菌的作用。'
      }
    },
    {
      id: 87,
      name: '冰糖',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、生津止渴：润喉去燥，使人清爽舒适。\\n2、润肺：富含维生素A，保护呼吸道上皮，提高免疫球蛋白的功能，预防呼吸道感染。滋阴润肺，去除肺燥肺热。使人呼吸畅通舒适。\\n3、化痰止咳：冰糖适宜多痰，痰粘稠，咳嗽等症状。对咽喉部有良好的湿润和物理治疗作用，有利于局部炎症治愈，并能解除局部痒感，从而阻断咳嗽反射。能稀释呼吸道炎症和分泌物的黏稠度，使之易咳出，有利于止咳和祛痰。\\n4、清热除火：冰糖能清心泻火，清热除烦，能够消除血液中的热毒。\\n5、解毒：冰糖清理身体内长期淤积的毒素，增进身体健康。增加免疫细胞的活性，消除体内的有害物质。\\n6、祛脂降压：冰糖能够使血压更易控制，并使毛细管扩张，血黏度降低，微循环改善。',
        简介:
          '冰糖是砂糖的结晶再制品。自然生成的冰糖有白色、微黄、淡灰等色。冰糖是砂糖的结晶再制品。有白色、微黄、微红、深红等色，结晶如冰状，故名冰糖。我国在汉时已有生产。冰糖以透明者质量最好，纯净，杂质少，口味清甜，半透明者次之。可作药用，也可作糖果食用。',
        营养价值:
          '1.富含铜，铜是人体健康不可缺少的微量营养素，对于血液、中枢神经和免疫系统，皮肤、脑子和肝、心等内脏的发育和功能有重要影响。\\n2.富含碳水化合物，构成机体的重要物质；调节脂肪代谢；提供膳食纤维；节约蛋白质；解毒；增强肠道功能。'
      }
    },
    {
      id: 88,
      name: '老抽',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '作为调味品，可以调味和调色，适当补充铁。',
        简介:
          '老抽也是酱油的一种主要是经过一些特殊的酿造发酵而制成的一种酱油，也是香港的对于浓酱油的一种称呼，主要是以优质的黄豆，以及小麦为原料，经过发酵后成熟制成的，烹饪时能够提到上色提味的作用。',
        营养价值:
          '每100克老抽含碳水化合物23.80克，脂肪0.30克，蛋白质7.90克。老抽具有补血养血、提高免疫力、防癌抗癌、止痛镇痛、降低胆固醇等功效。'
      }
    },
    {
      id: 89,
      name: '鸡粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充营养：鸡精大量的谷氨酸钠，也含有多种氨基酸和一些蛋白质与多种维生素，这些物质都是人体正常工作时的必须营养成分，人们食用鸡精以后可以快速这些营养成分吸收和利用，对增强身体素质有一定的好处。\\n3、增加食欲：鸡精有很强的提味增鲜作用，它可以让食物的味道更诱人，能让人们的胃口大开，可以起到增加食欲的作用',
        简介:
          '鸡精是以新鲜鸡肉、鸡骨、鸡蛋为原料制成的复合增鲜、增香的调味料。可以用于使用味精的所有场合，适量加入菜肴、汤羹、面食中均能达到效果。鸡精中除含有谷氨酸钠外，更含有多种氨基酸。它是既能增加人们的食欲，又能提供一定营养的家常调味品。鸡精产品更加注重鲜味，所以味精含量较高；鸡粉则着重产品来自鸡肉的自然鲜香，因而鸡肉粉的使用量较高。',
        营养价值:
          '鸡精中除含有谷氨酸钠外，更含有多种氨基酸。它是既能增加人们的食欲，又能提供一定营养的家常调味品。'
      }
    },
    {
      id: 91,
      name: '地瓜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗癌：有效地抑制结肠癌和乳腺癌的发生。\\n2、通便减肥：吃红薯能有效地阻止糖类变为脂肪，有利于减肥、健美。\\n3、提高免疫力：红薯叶有提高免疫力、止血、降糖、解毒、防治夜盲症等保健功能。\\n4、抗衰老：抑制黑色素的产生，防止雀斑和老人斑的出现。红著还能抑制肌肤老化，保持肌肤弹性，减缓机体的衰老进程。',
        简介:
          '又名番薯、甘薯、山芋、地瓜、红苕、线苕、白薯、金薯、甜薯、朱薯、枕薯等。常见的多年生双子叶植物，草本，其蔓细长，茎匍匐地面。块根，无氧呼吸产生乳酸，皮色发白或发红，肉大多为黄白色，但也有紫色，除供食用外，还可以制糖和酿酒、制酒精。',
        营养价值:
          '红薯，又称甘薯、番薯、山芋等。红薯中含有多种人体需要的营养物质。每500克红薯约可产热能635千卡，含蛋白质11.5克、糖14.5克、脂肪1克、磷100毫克、钙90毫克、铁2克，胡萝卜素0.5毫克，另含有维生B1、B2、C与尼克酸、亚油酸等。\\n其中维生素B1、B2的含量分别比大米高6倍和3倍。特别是红薯含有丰富的赖氨酸，而大米、面粉恰恰缺乏赖氨酸。但是很多发人却还没有意识到。\\n 吃红薯会不会使人发胖。根据科学研究，吃红薯是不会使人发胖的，相反红薯还是一种理想的减肥食品。\\n它的含热量非常低，比一般米饭低得多，所以吃了之后不必担心会发胖，反而可起到减肥作用。红薯中还含有一种类似雌性激素的物质，对保护人体皮肤，延缓衰老有一定的作用。\\n因此，国外许多女性把红薯当作驻颜美容食品。 红薯生食脆甜，可代替水果；熟食甘软，吃在嘴里，甜在心头。它既可作主食，又可当蔬菜。蒸、煮、煎、炸，吃法众多，一经巧手烹饪，也能成为席上佳肴。\\n'
      }
    },
    {
      id: 93,
      name: '长茄子',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、保护心血管、抗坏血酸：茄子含丰富的维生素P，这种物质能增强人体细胞间的粘着力，增强毛细血管的弹性，减低毛细血管的脆性及渗透性，防止微血管破裂出血，使心血管保持正常的功能。此外，茄子还有防治坏血病及促进伤口愈合的功效。\\n2、防治胃癌：茄子含有龙葵碱，能抑制消化系统肿瘤的增殖，对于防治胃癌有一定效果。此外，茄子还有清退癌热的作用。\\n3、抗衰老：茄子含有维生素E，有防止出血和抗衰老功能，常吃茄子，可使血液中胆固醇水平不致增高，对延缓人体衰老具有积极的意义。',
        简介:
          '茄子是为数不多的紫色蔬菜之一，也是餐桌上十分常见的家常蔬菜。在它的紫皮中含有丰富的维生素E和维生素P，这是其他蔬菜所不能比的。',
        营养价值:
          '1. 保护心血管、抗坏血酸：茄子含丰富的维生素P，这种物质能增强人体细胞间的粘着力，增强毛细血管的弹性，减低毛细血管的脆性及渗透性，防止微血管破裂出血，使心血管保持正常的功能。此外，茄子还有防治坏血病及促进伤口愈合的功效。2. 防治胃癌：茄子含有龙葵碱，能抑制消化系统肿瘤的增殖，对于防治胃癌有一定效果。此外，茄子还有清退癌热的作用。3. 抗衰老：茄子含有维生素E，有防止出血和抗衰老功能，常吃茄子，可使血液中胆固醇水平不致增高，对延缓人体衰老具有积极的意义。\\n'
      }
    },
    {
      id: 94,
      name: '蒜瓣',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 95,
      name: '葱姜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 96,
      name: '香菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、健脾开胃：香菜香气独特，食用后可促进肠胃蠕动，提高消化功能，令食欲增加，对胃口不好、食欲不振的人非常好。\\n2、清热透疹：香菜根中的挥发性物质能刺激汗腺分泌活跃，促使人体快速排汗，具有清热透疹的功效。\\n3、驱寒发汗：香菜属于辛香菜，能促进血液循环，解表发汗，脾胃虚寒的人食用香菜有助于暖胃散寒、缓解胃腹冷痛，对风寒感冒、畏寒、鼻塞无汗等症有治疗作用。\\n4、缓解鼻塞：香菜中的挥发性油有通鼻之效，因感冒或受凉鼻塞可以用香菜煮水或者食用香菜粥来缓解症状。\\n5、去腥提味：香菜之所以获得香菜的美名，是因为它含有多种挥发油和挥发性香味成分，而这些成分既可以祛除肉食中的膻腥味，又能提升食物本身的鲜香味，还可以解腻刺激食欲。\\n6、排毒护肾：经常食用香菜可以清除血液中有害物质，抑制体内和肾脏中铅积累，帮助身体排出铅。同时，香菜有利尿的作用，可以预防膀胱炎症，保护肾脏健康。',
        简介:
          '香菜又名芫荽、盐荽、胡荽、香荽、延荽、漫天星等。为伞形科芫荽属一年生草本植物。最初称为胡荽，英文名Coriander Herb，原产于中亚和南欧，或近东和地中海一带。据唐代《博物志》记载，公元前119年西汉张骞从西域引进香菜，故初名胡荽。，8～12世纪传入日本。后来在南北朝后赵时，赵皇帝石勒认为自己是胡人，胡荽听起来不顺耳，下令改名为原荽，后来演变为芫荽。在《齐民要术》中已有栽培技术和腌制方法的记载。它的嫩茎和鲜叶有种特殊的香味，常被用作菜肴的点缀、提味之品。',
        营养价值:
          '香菜营养丰富，主要含有蛋白质、维生素c、脂肪、胡萝卜素、维生素A、维生素b1，b2、维生素E、膳食纤维、烟酸等，同时还含有丰富的微量元素，如钙、磷、钠、镁、铁、碘、锌、硒、锰等。此外，香菜还含有挥发油和挥发性香味物质，如黄酮甙、芳樟醇、正癸醛、甘露糖醇等，香菜的特殊香味就是源于这些成分，它们具有开胃醒脾、促进消化的功效。烹饪时加入一下香菜，既能祛湿肉类膻腥味，还能让菜品更鲜香。'
      }
    },
    {
      id: 98,
      name: '猪里脊肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增长肌肉：它对增长肌肉、增强力量特别有效。在进行训练的头几秒钟里，肌氨酸是肌肉燃料之源，它可以有效补充三磷酸腺苷，从而使训练能坚持得更久。其中肉毒碱主要用于支持脂肪的新陈代谢，产生支链氨基酸，是对健美运动员增长肌肉起重要作用的一种氨基酸。\\n2、增加免疫力：可帮你增强免疫力，促进蛋白质的新陈代谢和合成，从而有助于紧张训练后身体的恢复。\\n3、促进康复：能提高机体抗病能力，对生长发育及手术后、病后调养的人在补充失血、修复组织等方面物别适宜。\\n4、补铁补血：铁是造血所必需的元素，而牛肉中富含大量的铁，多食用牛肉有助于缺铁性贫血的治疗。',
        简介:
          '猪肉又名豚肉，是主要家畜之一。属猪科动物。其性味甘咸平，含有丰富的蛋白质及脂肪、碳水化合物、钙、磷、铁等成分。 猪肉是日常生活的主要副食品，具有补虚强身，滋阴润燥、丰肌泽肤的作用。凡病后体弱、产后血虚、面黄赢瘦者，皆可用之作营养滋补之品。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 99,
      name: '黄瓜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗肿瘤：黄瓜中含有的葫芦素C具有提高人体免疫功能的作用，达到抗肿瘤目的。此外，该物质还可治疗慢性肝炎和迁延性肝炎，对原发性肝癌患者有延长生存期作用。\\n2、抗衰老：黄瓜中含有丰富的维生素E，可起到延年益寿，抗衰老的作用；黄瓜中的黄瓜酶，有很强的生物活性，能有效地促进机体的新陈代谢。用黄瓜捣汁涂擦皮肤，有润肤，舒展皱纹功效。\\n3、防酒精中毒：黄瓜中所含的丙氨酸、精氨酸和谷胺酰胺对肝脏病人，特别是对酒精性肝硬化患者有一定辅助治疗作用，可防治酒精中毒。\\n4、降血糖：黄瓜中所含的葡萄糖甙、果糖等不参与通常的糖代谢，故糖尿病人以黄瓜代淀粉类食物充饥，血糖非但不会升高，甚至会降低。\\n5、减肥强体：黄瓜中所含的丙醇二酸，可抑制糖类物质转变为脂肪。此外，黄瓜中的纤维素对促进人体肠道内腐败物质的排除和降低胆固醇有一定作用，能强身健体。\\n6、健脑安神：黄瓜含有维生素B1，对改善大脑和神经系统功能有利，能安神定志，辅助治疗失眠症。',
        简介:
          '黄瓜，也称胡瓜、青瓜，属葫芦科植物。广泛分布于中国各地，并且为主要的温室产品之一。黄瓜是由西汉时期张骞出使西域带回中原的，称为胡瓜，五胡十六国时后赵皇帝石勒忌讳“胡”字，汉臣襄国郡守樊坦将其改为“黄瓜”。黄瓜的茎上覆有毛，富含汁液，叶片的外观有3-5枚裂片，覆有绒毛。',
        营养价值:
          '黄瓜这种蔬菜的营养价值是非常高的，并且含有丰富的我们人体所需要的各种营养物质的，黄瓜中富含蛋白质、钙、磷、铁、钾、胡萝卜素、维生素B2、维生素c、维生素E及烟酸等营养素。黄瓜所含的钾盐十分丰富，具有加速血液新陈代谢、排泄体内多余盐分的作用，故肾炎、膀胱炎患者生食黄瓜，对机体康复有良好的效果。黄瓜中所含的丙醇二酸，可抑制糖类物质转变为脂肪，所以适当的食用黄瓜，也是可以帮助我们大家预防发胖的情况的。'
      }
    },
    {
      id: 100,
      name: '豆腐皮',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、预防心脑血管疾病：豆皮可预防心血管疾病，保护心脏；含有多种矿物质，补充钙质，防止因缺钙引起的骨质疏松，促进骨骼发育，对小儿、老人的骨骼生长极为有利。\\n2、更年期的“保护神”：有效的预防骨质疏松、乳腺癌和前列腺的发生。\\n3、降低乳腺癌的几率：制作豆皮的大豆中含有大豆异黄酮，可调整乳腺对雌激素的反应，日本妇女尿中的异黄酮浓度为美国、荷兰妇女的100~1000倍，这与日本人常食大豆有关，也是日本相与欧美国家相比乳腺癌发生率较低的一个原因。此外，还可以有效的预防白血病，结肠癌，肺癌，胃癌等的发生。',
        简介:
          '豆腐皮是汉族传统豆制品，在中国南方和北方地区有多种名菜。是在豆浆煮沸之后表面形成天然油膜“挑”起来晾干成的豆腐皮，也叫“油皮”、“腐竹”、“豆腐衣”。',
        营养价值:
          '1、豆腐皮中含有丰富的优质蛋白，营养价值较高；\\n2、豆腐皮含有的大量卵磷脂，防止血管硬化，预防心血管疾病，保护心脏；\\n3、并含有多种矿物质，补充钙质，防止因缺钙引起的骨质疏松，促进骨骼发育，对小儿、老人的骨骼生长极为有利。'
      }
    },
    {
      id: 103,
      name: '水豆腐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗血栓：制作大豆中含有的皂苷，清除体内自由基，具有显著的抗癌活性，具有抑制肿瘤细胞的生长，抑制血小板聚集，抗血栓的功效。\\n2、牛奶的替代品：豆腐的营养价值与牛奶相近，对因乳糖不耐症而不能喝牛乳，或为了控制慢性病不吃肉禽类的人而言，豆腐是最好的代替品。\\n3、更年期的“保护神”：有效的预防骨质疏松、乳腺癌和前列腺的发生。\\n4、预防心血管疾病：豆腐健脑的同时，还能抑制胆固醇的摄入。大豆蛋白显著降低血浆胆固醇、甘油三酯和低密度脂蛋白，不仅可以预防结肠癌，还有助于预防心脑血管疾病。\\n5、降低乳腺癌的几率：制作豆腐的大豆中含有大豆异黄酮，可调整乳腺对雌激素的反应，日本妇女尿中的异黄酮浓度为美国、荷兰妇女的100~1000倍，这与日本人常食大豆有关，也是日本相与欧美国家相比乳腺癌发生率较低的一个原因。此外，还可以有效的预防白血病，结肠癌，肺癌，胃癌等的发生。\\n6、有益于大脑的生长发育',
        简介:
          '豆腐是我国炼丹家——淮南王刘安发明的绿色健康食品。时至今日，已有二千一百多年的历史，深受我国人民、周边各国、及世界人民的喜爱。发展至今，已品种齐全，花样繁多，俱有风味独特，制作工艺简单食用方便的特点。有高蛋白，低脂肪，降血压，降血脂，降胆固醇的功效。是生熟皆可，老幼皆宜，养生摄生、益寿延年的美食佳品。',
        营养价值:
          '1.大豆的蛋白质生物学价值可与鱼肉相媲美，是植物蛋白中的佼佼者。大豆蛋白属于完全蛋白质，其氨基酸组成比较好，人体所必需的氨基酸它几乎都有。\\n2.制作豆腐的大豆中含有18%左右的油脂，大部分能转移到豆腐中去。大豆油中的亚油酸比例较大，且不含胆固醇，有益于人体神经、血管、大脑的生长发育。\\n3.大豆可以直接烹调食用，人体对其蛋白质的消化吸收率只有65%，而制成豆腐消化率可以提升到92%~95%。\\n'
      }
    },
    {
      id: 104,
      name: '香菇',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、提高机体免疫功能：香菇可促进T淋巴细胞的产生，并提高T淋巴细胞的杀伤活性。\\n2、延缓衰老：香菇的水提取物对过氧化氢有清除作用，对体内的过氧化氢有一定的消除作用。\\n3、防癌抗癌：香菇菌盖部分含有双链结构的核糖核酸，进入人体后，会产生具有抗癌作用的干扰素。\\n4、香菇中含有嘌呤、胆碱、酪氨酸、氧化酶以及某些核酸物质，能起到降血压、降胆固醇、降血脂的作用。',
        简介:
          '香菇为真菌植物门真菌香蕈的子实体，属担子菌纲伞菌科，是世界上著名的食用菌之一。它含有一种特有的香味物质~香菇精，形成独特的菇香，所以称为“香菇”。',
        营养价值:
          '每百克鲜香菇中含蛋白质12～14克，碳水化合物59.3克，钙124毫克，磷415毫克，铁25.3毫克，还含有多糖类、维生素Ｂ1、维生素Ｂ2、维生素Ｃ等。干香菇的水浸液中含有多种氨基酸、乙酰胺、胆碱、腺嘌呤等成分。香菇中还含有丰富的食物纤维，经常食用能降低血液中的胆固醇，防止动脉粥样硬化，对防治脑溢血、心脏病、肥胖症和糖尿病都有效。近年来，美国科学家发现香菇中含有一种“β－葡萄糖苷酶”，试验证明，这种物质有明显的加强机体抗癌的作用，因此，人们把香菇称为“抗癌新兵”。香菇还能抗感冒病毒，因香菇中含有一种干扰素的诱导剂，能诱导体内干扰素的产生，干扰病毒蛋白质的合成，使其不能繁殖，从而使人体产生免疫作用。 \\n香菇是具有高蛋白、低脂肪、多糖、多种氨基酸和多种维生素的菌类食物。 1.提高机体免疫功能：香菇多糖可提高小鼠腹腔巨噬细胞的吞噬功能，还可促进T淋巴细胞的产生，并提高T淋巴细胞的杀伤活性。2.延缓衰老：香菇的水提取物对过氧化氢有清除作用，对体内的过氧化氢有一定的消除作用。3.防癌抗癌：香菇菌盖部分含有双链结构的核糖核酸，进入人体后，会产生具有抗癌作用的干扰素。4.降血压、降血脂、降胆固醇：香菇中含有嘌呤、胆碱、酪氨酸、氧化酶以及某些核酸物质，能起到降血压、降胆固醇、降血脂的作用，又可预防动脉硬化、肝硬化等疾病。5. 香菇还对糖尿病、肺结核、传染性肝炎、神经炎等起治疗作用，又可用于消化不良、便秘等。'
      }
    },
    {
      id: 105,
      name: '香葱',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解热、祛痰：刺激身体汗腺，达到发汗散热的作用，葱油刺激上呼吸道，使黏痰易于咯出。\\n2、抗菌、抗病毒：葱中所含大蒜素，具有明显的抵御细菌、病毒的作用\\n3、防癌抗癌：香葱所含果胶，可明显地减少结肠癌的发生，\\n4、防止感冒、头疼、鼻塞：香葱中含有葡萄糖、果糖、麦芽糖等多种糖类物质及少量淀粉和纤维素。治分行头痛\\n5、对血管硬化，动脉硬化有一定作用。',
        简介:
          '香葱，又称：葱，细香葱,北葱、火葱。拉丁文名：Allium ascalonicum.百合科、葱属植物，鳞茎聚生，矩圆状卵形、狭卵形或卵状圆柱形；鳞茎外皮红褐色、紫红色至黄白色，膜质或薄革质，不破裂。叶为中空的圆筒状，向顶端渐尖，深绿色，常略带白粉。植株小，叶极细，质地柔嫩，味清香，微辣，主要用于调味和去腥。原产于亚洲西部。在我国南方较为广泛地栽培。欧洲和亚洲的一些地区也有栽培。',
        营养价值:
          '解热、祛痰\\n葱的挥发油等有效成分，具有刺激身体汗腺，达到发汗散热的作用；\\n葱油刺激上呼吸道，使黏痰易于咯出。\\n抗菌、抗病毒\\n葱中所含大蒜素，具有明显的抵御细菌、病毒的作用，尤其对痢疾杆菌和皮肤真菌抑制作用更强。\\n防癌抗癌\\n香葱所含果胶，可明显地减少结肠癌的发生，\\n有抗癌作用，葱内的蒜辣素也可以抑制癌细胞的生长。\\n防止感冒、头疼、鼻塞\\n香葱中含有葡萄糖、果糖、麦芽糖等多种糖类物质及少量淀粉和纤维素。\\n治分行头痛\\n对血管硬化，动脉硬化有一定作用。\\n'
      }
    },
    {
      id: 107,
      name: '鳐鱼翅',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 108,
      name: '小鲍鱼',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 109,
      name: '瑶柱',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、降血压降胆固醇：干贝具有滋阴补肾的功能，能治疗头晕目眩，咽干口渴，虚劳咳血，脾胃虚弱等症，常食有助有降血压，降胆固醇，补益健身。\\n2、软化血管：干贝还具有抗癌，软化血血管，预防动脉硬化等功效。',
        简介:
          '干贝是以江珧扉贝、日月贝等几种贝类的闭壳肌干制而成，呈短圆柱状，浅黄色，体侧有柱筋，是我国著名的海产“八珍”之一，是名贵的水产食品。古人曰：“食后三日，犹觉鸡虾乏味。”可见干贝之鲜美非同一般。',
        营养价值:
          '1、干贝富含蛋白质、碳水化合物、维生素B2和钙、磷、铁等多种营养成分，蛋白质含量高达61.8%，为鸡肉，牛肉，鲜虾的三倍。\\n2、富含丰富的矿物质，其含量远高于鱼翅，燕窝。\\n3、干贝含丰富的谷氨酸，味道极鲜，与鲜扇贝相比、干贝腥味大减。'
      }
    },
    {
      id: 110,
      name: '广肚',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 111,
      name: '大虾肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 112,
      name: '鹌鹑蛋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、治疗疾病：鹌鹑蛋可辅助治疗浮肿、肥胖型高血压、糖尿病、贫血、肝大、肝硬化、腹水等多种疾病。\\n对贫血、营养不良、神经衰弱、月经不调、高血压、支气管炎、血管硬化等病人具有调补作用。\\n2、健脑：鹌鹑蛋中所含丰富的卵磷脂和脑磷脂，是高级神经活动不可缺少的营养物质，具有健脑的作用。\\n3、预防过敏：吃鹌鹑蛋能预防因吃鱼虾发生的皮肤过敏、风湿疹、呕吐以及药物性过敏症。\\n4、缓解失眠：常食有缓解失眠、神经衰弱、多梦等症状。',
        简介:
          '又名鹑鸟蛋、鹌鹑卵。\\n鹌鹑蛋被认为是 “动物中的人参”。宜常食为滋补食疗品。俗话说：“要吃飞禽，鸽子鹌鹑。”鹌鹑肉、蛋，味道鲜美，营养丰富。鹌鹑蛋是一种很好的滋补品，在营养上有独特之处，故有"卵中佳品"之称。近圆形，个体很小，一般只有５g左右，表面有棕褐色斑点。鹌鹑蛋的营养价值不亚于鸡蛋，有较好护肤、美肤作用。',
        营养价值:
          '鹌鹑蛋的营养价值不亚于鸡蛋，丰富的蛋白质、脑磷脂、卵磷脂、赖氨酸、胱氨酸、维A、维B2、维B1、铁、磷、钙等营养物质，可补气益血，强筋壮骨。功效:补气益血，枝风湿，强筋壮骨。\\n鹌鹑蛋中氨基酸种类齐全，含晕丰富，还有高质量的多种磷脂，激素等人体必需成分，铁、核黄素、维生素A的含量均比同量鸡蛋高出两倍左右，而胆固醇则较鸡蛋低约三分之一，所以是各种虚弱病者及老人、儿童及孕妇的理想滋补食品。鹌鹑蛋含有较高的蛋白质，脑磷脂、卵磷脂、铁和维生素等。\\n鹌鹑蛋外观小巧，但营养价值很高。日本《养鹑》一书曾把鹌鹑蛋与人参、蝮蛇并论为佳品，且对肺病、肋膜炎、哮喘、心脏病，神经衰弱有一定疗效。\\n'
      }
    },
    {
      id: 113,
      name: '冬笋片',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 114,
      name: '熟鸡肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 115,
      name: '老姜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲、促消化：口嚼生姜，可引起血压升高。姜辣素对口腔和胃粘膜有刺激作用，能促进消化液分泌，增进食欲。可使肠张力、节律和蠕动增加。\\n2、镇吐：有末梢性镇吐作用，有效成分为姜酮和姜烯酮的混合物。治疗胃寒呕吐。也可治胃热呕吐。\\n3、活血驱寒：用生姜、红糖熬制的姜汤可活血驱寒，防治感冒，自古就是风寒感冒的食疗良药。\\n4、杀菌：体外实验表明，姜对伤寒杆菌、霍乱弧菌有明显的抑制作用。\\n5、助阳：按中医理论，生姜是助阳之品。\\n6、解毒：生姜又能解生半夏、生南星之毒，煎汤饮服，可用于中半夏、南星毒引起的喉哑舌肿麻木等症',
        简介:
          '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。',
        营养价值:
          '1、姜含有蛋白质、多种维生素、胡萝卜素、钙、铁、磷。\\n2、姜中含有姜醇、姜烯、水芹烯、柠檬醛和芳香等油性的挥发油;还有姜辣素、树脂、淀粉和纤维等。'
      }
    },
    {
      id: 117,
      name: '虾仁',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、能很好的保护心血管系统，它可减少血液中胆固醇含量，防止动脉硬化，同时还能扩张冠状动脉，有利于预防高血压及心肌梗死。\\n2、虾仁的通乳作用较强，并且富含磷、钙、对小儿、孕妇尤有补益功效。',
        简介:
          '虾仁，一种食品。选用活虾为原料，用清水洗净虾体，去掉虾头、虾尾和虾壳。剥壳后的纯虾肉即为虾仁。虾仁菜肴因为清淡爽口，易于消化，老幼皆宜，而深受食客欢迎。',
        营养价值:
          '1、虾中含有20%的蛋白质，是蛋白质含量很高的食品之一，是鱼、蛋、奶的几倍甚至十几倍，虾和鱼肉相比，所含的人体必需氨基酸缬氨酸并不高，但却是营养均衡的蛋白质来源，另外，虾类含有甘氨酸，这种氨基酸的含量越高，虾的甜味就越高。\\n2、虾和鱼肉禽肉相比，脂肪含量少，并且几乎不含作为能量来源的动物糖质，虾中的胆固醇含量较高，同时含有丰富的能降低人体血清胆固醇的牛磺酸，虾含有丰富的钾、碘、镁、磷等微量元素和维生素A等成分。\\n'
      }
    },
    {
      id: 118,
      name: '猪肉馅',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效，主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴、润肌肤、利小便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉又名豚肉，是主要家畜之一。属猪科动物。其性味甘咸平，含有丰富的蛋白质及脂肪、碳水化合物、钙、磷、铁等成分。 猪肉是日常生活的主要副食品，具有补虚强身，滋阴润燥、丰肌泽肤的作用。凡病后体弱、产后血虚、面黄赢瘦者，皆可用之作营养滋补之品。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 119,
      name: '玉米淀粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '降低血压、胆固醇、治疗动脉硬化、冠心病、高血压、脂肪肝、肥胖病。',
        简介:
          '又称玉蜀黍淀粉。俗名六谷粉。白色微带淡黄色的粉末。将玉米用0.3%亚硫酸浸渍后，通过破碎、过筛、沉淀、干燥、磨细等工序而制成。普通产品中含有少量脂肪和蛋白质等。吸湿性强，最高能达30%以上。',
        营养价值:
          '玉米是世界公认的“黄金作物”，其脂肪、磷元素、维生素B2的含量居谷类食物之首。\\n玉米面中含有亚油酸和维生素E，能使人体内胆固醇水平降低，从而减少动脉硬化的发生。\\n玉米面中含钙、铁质较多，可防止高血压、冠心病。\\n现代医学研究表明，玉米面中有丰富的谷胱甘肽，这是一种抗癌因子，在人体内能与多种外来的化学致癌物质相结合，使其失去毒性，然后通过消化道排出体外。粗磨的玉米面中含有大量的赖氨酸，可抑制肿瘤生长。\\n玉米面还含有微量元素硒，硒能加速人体内氧化物分解，抑制恶性肿瘤。\\n玉米面中丰富的膳食纤维，能促进肠蠕动，缩短食物通过消化道的时间，减少有毒物质的吸收和致癌物质对结肠的刺激，因而可减少结肠癌的发生。\\n玉米片是新型的方便食品，所用原料是玉米粗粉或细粉，几乎含有玉米面的全部营养成分。'
      }
    },
    {
      id: 121,
      name: '肉馅',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉馅是指把猪肉去除皮肉和骨头，取净猪肉，再剁成肉蓉而成。根据选取猪肉部位的不同，猪肉末可分为纯瘦肉末、肥瘦肉末和肥肉末3种。纯瘦肉末系选用猪腿肉或臀尖肉加工制作而成；肥瘦肉末是选用五花肉加工而成；肥肉末是用肥膘肉配以少许瘦肉加工制作而成。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 122,
      name: '糖',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、适当食用白糖有助于提高机体对钙的吸收，但过多就会妨碍钙的吸收。\\n2、吃糖后应及时漱口或刷牙，以防龋齿的产生。\\n3、糖尿病病人不易直接食用食糖，最好是以甜味剂替代。\\n4、白砂糖味甘、性平，归脾、肺经；有润肺生津、止咳、和中益肺、舒缓肝气、滋阴、调味、除口臭、解盐卤毒之功效。',
        简介:
          '绵白糖简称绵糖，也叫白糖，是我国人民比较喜欢的一种食用糖。它质地绵软、细腻，结晶颗粒细小，并在生产过程中喷入了2.5%左右的转化糖浆。而白砂糖的主要成分是蔗糖，故绵白糖的纯度不如白砂糖高。',
        营养价值:
          '白砂糖，味甘、性平；归脾、肺经；有润肺生津、止咳、和中益肺、舒缓肝气、滋阴、调味、除口臭、解盐卤毒之功效。'
      }
    },
    {
      id: 123,
      name: '生抽',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补铁：生抽是由大豆制作而成,富含铁元素,适当进食生抽能补充铁元素。\\n2、增进食欲：烹调加入适量的生抽,使食物的色香味增加,使人的食欲增加。\\n3、降低胆固醇：生抽含有多种能够降低人体胆固醇的矿物质和维生素。',
        简介:
          '生抽酱油是酱油中的一个品种，以大豆、面粉为主要原料，人工接入种曲，经天然露晒，发酵而成。其产品色泽红润，滋味鲜美协调，豉味浓郁，体态清澈透明，风味独特。生抽颜色比较淡，呈红褐色，用来一般的烹调用的，吃起来味道较咸。',
        营养价值:
          '1、补血：生抽的主要原材料是大豆或者面粉，，这些材料中都含有丰富的微量元素铁，他再加工成生抽以后，这种营养成分的含量丝毫没有减弱，平时人们食用生抽以后，能快速把它富含的铁元素吸收和利用，可以促进血红细胞再生，补血功效十分明显。\\n2、降低胆固醇：生抽这种调味品中含有多种天然微量元素和一些矿物质，它们被人体吸收以后，能软化血管，净化血液，能有效清除人类血清中的甘油三酯和胆固醇，平时经常食用，既能预防高血脂，又能减少动脉硬化和冠心病发生。'
      }
    },
    {
      id: 124,
      name: '蚝油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲：蚝油含有丰富的微量元素和多种氨基酸，可以用于补充各种氨基酸及微量元素，其中主要含有丰富的锌元素，是缺锌人士的首选膳食调料。\\n2、提高免疫力：蚝油富含牛磺酸，牛磺酸具有增强人体免疫力保健功能。其中蛋白质：是维持免疫机能最重要的营养素，为构成白血球和抗体的主要成份。矿物质：锌、硒、铜、锰等矿物质形式与免疫机能有关的酵素。\\n3、抑癌抗瘤：蚝油富含牛磺酸，牛磺酸具有防癌抗癌保健功能。预防癌症，降低癌变的发生率。延缓和抑制癌细胞生长、扩散。使癌细胞退化、萎缩。\\n4、健脑：蚝油含磷，是合成卵磷脂和脑磷脂的重要成分，可增强记忆力，延缓脑功能衰退，抑制血小板凝集，防止脑血栓形成。提供优质蛋白，富含胆碱，可提高记忆力。',
        简介:
          '广东称牡蛎为蚝，蚝油是用蚝（牡蛎）熬制而成的调味料。蚝油是广东常用的传统的鲜味调料，也是调味汁类最大宗产品之一，它以素"海底牛奶"之称的蚝牗牡蛎牍为原料，经煮熟取汁浓缩，加辅料精制而成。蚝油味道鲜美、蚝香浓郁，黏稠适度，营养价值高，亦是配制蚝油鲜菇牛肉、蚝油青菜、蚝油粉面等传统粤菜的主要配料。',
        营养价值:
          '1.蚝油含有丰富的微量元素和多种氨基酸，可以用于补充各种氨基酸及微量元素，其中主要含有丰富的锌元素，是缺锌人士的首选膳食调料。\\n2.蚝油中氨基酸种类达22种之多，各种氨基酸的含量协调平衡，其中，谷氨酸含量是总量的一半，它与核酸共同构成蚝油呈味主体，两者含量越高，蚝油味道越鲜美。\\n3.蚝油富含牛磺酸，牛磺酸具有防癌抗癌、增强人体免疫力等多种保健功能。'
      }
    },
    {
      id: 125,
      name: '姜末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲、促消化：口嚼生姜，可引起血压升高。姜辣素对口腔和胃粘膜有刺激作用，能促进消化液分泌，增进食欲。可使肠张力、节律和蠕动增加。\\n2、镇吐：有末梢性镇吐作用，有效成分为姜酮和姜烯酮的混合物。治疗胃寒呕吐。也可治胃热呕吐。\\n3、活血驱寒：用生姜、红糖熬制的姜汤可活血驱寒，防治感冒，自古就是风寒感冒的食疗良药。\\n4、杀菌：体外实验表明，姜对伤寒杆菌、霍乱弧菌有明显的抑制作用。\\n5、助阳：按中医理论，生姜是助阳之品。\\n6、解毒：生姜又能解生半夏、生南星之毒，煎汤饮服，可用于中半夏、南星毒引起的喉哑舌肿麻木等症',
        简介:
          '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。',
        营养价值:
          '1、姜含有蛋白质、多种维生素、胡萝卜素、钙、铁、磷。\\n2、姜中含有姜醇、姜烯、水芹烯、柠檬醛和芳香等油性的挥发油;还有姜辣素、树脂、淀粉和纤维等。'
      }
    },
    {
      id: 127,
      name: '青菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、降低血脂：青菜为低脂肪蔬菜，且含有膳食纤维，能与胆酸盐和食物中的胆固醇及甘油三酯结合，性味寒凉,伤脾胃,务必加少许寒必温缓和寒凉之性。并从粪便中排出，从而减少脂类的吸收，故可用来降血脂。中医认为青菜能活血化瘀、散血消肿的作用，可用于孕妇产后淤血腹痛以及治疗疖肿、丹毒。\\n2、解毒消肿：青菜中所含的植物激素，能够增加酶的形成，对进人人体内的致癌物质有吸附排斥作用，故有防癌功能。此外，还具有促进血液循环、、丹毒菜还能增强肝脏的排毒机制，对皮肤疮疖。乳痈有治疗作用。\\n3、宽肠通便：青菜中含有大量的植物纤维素，能促进肠道蠕动，增加粪便的体积，缩短粪便在肠腔停留的时间，从而治疗多种便秘，预防肠道肿瘤。主治游风丹毒，手足疖肿，乳痈，习惯性便秘，老年人缺钙等病症。\\n4、美容保健：青菜中含有的维生素C、胡萝卜素是人体黏膜及上皮组织维持生长的重要营养物质，常食具有美容作用。青菜所含钙量在绿叶蔬菜中为最高，一个成年人一天吃500克青菜，其所含钙、铁、维生素A和C即可满足生理需求。另外青菜还有助于增强机体免疫能力。 ',
        简介: '泛指绿色蔬菜，统称青菜。云南人也将苦菜称为青菜。',
        营养价值:
          '含有蛋白质、脂肪、糖类、膳食纤维、钙、磷、铁、胡萝卜素、维生素B1、维生素B2、烟酸、维生素C等。'
      }
    },
    {
      id: 128,
      name: '花生油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、可补脾润肺、润肠下虫。\\n2、花生油熟食，有润肠逐虫之功效，可治疗蛔虫性肠梗阻。',
        简介:
          '花生油为豆科植物花生的种子榨出之脂肪油，具有花生的香味，可提供给人体大量营养，含多种脂肪酸的甘油酯，可增加食品的美味，是构成人体内多种组织成分的重要原料。\\n是目前我国主要的食用植物油之一，有浓郁的花生香味。花生油可提供给人体大量营养，而且能增加食品的美味，可用于炒、煎、炸各种菜肴和食品。',
        营养价值:
          '中国预防医学科学院经研究证实，花生油含锌量是色拉油、粟米油、菜籽油、豆油的许多倍。虽然补锌的途径很多，但油脂是人们日常必需的补充物，所以食用花生油特别适宜于大众补锌。\\n花生油中还含有多种抗衰老成分，有延缓脑功能衰老的作用。花生油还具有健脾润肺，解积食、驱脏虫的功效。\\n营养专家还在花生油中发理了3种有益寿延年于心脑血管的保健成分；白藜芦醇、单不饱和脂肪酸和β-谷固醇\\n。实验证明，这几种物质是肿瘤类疾病的化学预防剂，也是降低血小板聚集、防治动脉硬化及心脑血管疾病的化学预防剂。是中老年人理想的食用油脂之一。\\n优质花生油中含多种抗衰老成分，有延缓脑功能衰老的功效。'
      }
    },
    {
      id: 129,
      name: '姜丝',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲、促消化：口嚼生姜，可引起血压升高。姜辣素对口腔和胃粘膜有刺激作用，能促进消化液分泌，增进食欲。可使肠张力、节律和蠕动增加。\\n2、镇吐：有末梢性镇吐作用，有效成分为姜酮和姜烯酮的混合物。治疗胃寒呕吐。也可治胃热呕吐。\\n3、活血驱寒：用生姜、红糖熬制的姜汤可活血驱寒，防治感冒，自古就是风寒感冒的食疗良药。\\n4、杀菌：体外实验表明，姜对伤寒杆菌、霍乱弧菌有明显的抑制作用。\\n5、助阳：按中医理论，生姜是助阳之品。\\n6、解毒：生姜又能解生半夏、生南星之毒，煎汤饮服，可用于中半夏、南星毒引起的喉哑舌肿麻木等症',
        简介:
          '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。',
        营养价值:
          '1、姜含有蛋白质、多种维生素、胡萝卜素、钙、铁、磷。\\n2、姜中含有姜醇、姜烯、水芹烯、柠檬醛和芳香等油性的挥发油;还有姜辣素、树脂、淀粉和纤维等。'
      }
    },
    {
      id: 130,
      name: '味精',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、缓解神经衰弱：味精中的主要成分谷氨酸钠还具有治疗慢性肝炎、肝昏迷、神经衰弱、癫痫病、胃酸缺乏等病的作用。\\n2、增加食物的鲜味：味精对人体没有直接的营养价值，但它能增加食品的鲜味，引起人们食欲，有助于提高人体对食物的消化率。',
        简介:
          '味精是调味料的一种，主要成分为谷氨酸钠。味精的主要作用是增加食品的鲜味，在中国菜里用的最多，也可用于汤和调味汁。',
        营养价值:
          '味精的主要成分是谷氨酸钠C5H8NO4Na,L-2-氨基戊二酸的单钠盐。谷氨酸是脑组织氧化代谢的氨基酸之一，对改进和维持丘脑的机能是十分重要的。正常人每日摄钠1-2克便可满足生理的需要（联合国推荐每人每天摄入食盐为8克以下，食盐主要成分为氯化钠），如过食则可造成体内水钠潴留，导致血管管腔变细，血管阻力加大，血容量增多，加重心、肾负担，致使血压升高。 另外，味精中还含有少量氯化钠NaCl'
      }
    },
    {
      id: 132,
      name: '芋头泥',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 133,
      name: '红豆沙馅',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 134,
      name: '清水',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 135,
      name: '红樱桃',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 136,
      name: '绿樱桃',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 138,
      name: '乌鸡',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、延缓衰老：食用乌鸡可以提高生理机能、延缓衰老、强筋健骨。对防治骨质疏松、佝偻病、妇女缺铁性贫血症等有明显功效。\\n2、养血益肾：乌骨鸡有补虚劳羸弱，制消渴，益产妇，治妇人崩中带下及一些虚损诸病的功用。著名的乌鸡白凤丸，是滋养肝肾、养血益精、健脾固冲的良药。',
        简介:
          '又名乌骨鸡、药鸡、武山鸡、羊毛鸡、绒毛鸡、松毛鸡、黑脚鸡、丛冠鸡、穿裤鸡、竹丝鸡。乌骨鸡为雉科动物，因皮、肉、骨嘴均为黑色，故而得名，但人工饲养的乌骨鸡有毛白骨乌，也有斑毛乌骨及向白骨乌几中。乌骨鸡含有丰富的蛋白质，其蛋白质含量比鸭肉、鹅肉多；乌骨鸡还含有丰富的黑色素，入药后能起到使人体内的红血球和血色素增生的作用。因此，乌鸡自古以来，一直被认为是滋补上品。',
        营养价值:
          '现代医学研究，乌鸡内含丰富的黑色素，蛋白质，B族维生素等18种氨基酸和18种微量元素，其中烟酸、维生素E、磷、铁、钾、钠的含量均高于普通鸡肉，胆固醇和脂肪含量却很低，乌鸡的血清总蛋白和球蛋白质含量均明显高于普通鸡，乌鸡肉中含氨基酸高于普通鸡，而且含铁元素也比普通鸡高很多，是营养价值极高的滋补品。\\n'
      }
    },
    {
      id: 139,
      name: '瘦肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效，主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴、润肌肤、利小便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉是目前人们餐桌上重要的动物性食品之一。因为猪肉纤维较为细软，结缔组织较少，肌肉组织中含有较多的肌间脂肪。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 140,
      name: '花旗参',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 141,
      name: '红枣',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗癌抗癌：枣能提高人体免疫力，并可抑制癌细胞，降低血清胆固醇，提高血清白蛋白，保护肝脏。\\n2、降血压、降胆固醇：大枣有降低血糖和胆固醇含量等作用。\\n3、保肝护肝：大枣有保护肝脏、增强体力的作用。\\n4、预防骨质疏松：大枣对防治骨质疏松产贫血有重要作用。',
        简介:
          '红枣又名枣、干枣、枣子，起源于中国，在中国已有八千多年的种植历史，自古以来就被列为“五果”（栗、桃、李、杏、枣）之一。',
        营养价值:
          '大枣被誉为“百果之王”，含有丰富的维生素A, B族维生素、维生素C等人体必需的多种维生素和18种氨基酸、矿物质。其中维生素C的含量竞高达葡萄、苹果的70-80倍，维生素P的含量也很高，这两种维生素对防癌和预防高血压、高血脂都有一定作用。大枣对女性朋友具有特殊的养血安神、美容的作用，每天用3-5颗大枣泡水喝，具有养血美容的功效。'
      }
    },
    {
      id: 143,
      name: '鸡脯肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强身健体：鸡肉的消化率高，很容易被人体吸收利用，有增强体力、强壮身体的作用。\\n2、提高免疫力：现代社会中天天忙忙碌碌，常处于亚健康状态的白领最好多吃一些，以增强免疫力，减少患病几率。鸡肉具有温中益气、补精填髓、益五脏、补虚损的功效，用于治疗虚劳瘦弱、中虚食少、泄泻头晕心悸、月经不调、产后乳少、消渴、水肿等症状。\\n3、补肾精：可缓解由于肾精不足所导致的小便频繁、耳聋、精少精冷等症状。\\n4、促进智力发育：具有抗氧化和一定的解毒作用。在改善心脑功能、促进儿童智力发育方面，更是有较好的作用。',
        简介:
          '鸡胸肉，是鸡身上最大的两块肉。常见鸡肉，鸡胸肉是在胸部里侧的肉，形状像斗笠，胸脯肉。肉质细嫩，滋味鲜美，营养丰富，能滋补养身。',
        营养价值:
          '1、鸡胸肉含蛋白质、脂肪、钙、磷、铁、镁、钾、钠、维生素A、B1、B2、C、E和烟酸等成分。脂肪含量较少，其中含有高度不饱和脂肪酸。另含胆固醇，组氨酸。\\n2、每100克鸡胸肉含有1.2克左右的咪唑二肽，比猪肉、金枪鱼和鲣鱼等肉类中的含量还要丰富。\\n3、鸡胸肉蛋白质含量较高，一般一块鸡胸肉大约200克，含有40克的蛋白质，差不多可以满足一个人一天大部分的蛋白质需求，且易被人体吸收入利用，含有对人体生长发育有重要作用的磷脂类，是中国人膳食结构磷脂的重要来源之一。\\n4、鸡胸肉肉质细嫩，滋味鲜美，营养丰富，能滋补养身。却只含有与虾、螃蟹等相当的脂肪，是不必担心因动物性脂肪而使人体受到伤害的唯一的肉类。'
      }
    },
    {
      id: 144,
      name: '荔枝',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补脑：荔枝所含丰富的糖分具有补充能量，增加营养的作用，能明显改善失眠、健忘、神疲等症。\\n2、消肿：荔枝有消肿解毒、止血止痛的作用。\\n3、美容：荔枝拥有丰富的维生素，防止雀斑的发生，令皮肤更加光滑。',
        简介:
          '荔枝与香蕉、菠萝、龙眼一同号称“南国四大果品”。荔枝原产于中国南部，是亚热带果树，常绿乔木，高约10米。果皮肯多数鳞斑状突起，鲜红，紫红。果肉产鲜时半透明凝脂状，味香美。但不耐储藏。杨贵妃因喜食荔枝而闻名，使得杜牧写下“一骑红尘妃子笑，无人知是荔枝来”的千古名句。此外，各代文人墨客也写下了大量关于荔枝的诗词。荔枝性热，多食易上火，并可引起“荔枝病”。荔枝果实除食用外，核入药为收敛止痛剂，治心气痛和小肠气痛。木材坚实，深红褐色，纹理雅致、耐腐，历来为上等名材。花多，富含蜜腺，是重要的蜜源植物。',
        营养价值:
          '1、荔枝所含丰富的糖分具有补充能量，增加营养的作用，研究证明，荔枝对大脑组织有补养作用，能明显改善失眠、健忘、神疲等症；\\n2、荔枝肉含丰富的维生素C和蛋白质，有助于增强机体免疫功能，提高抗病能力；\\n3、荔枝中含有一种有降血糖作用的物质，对糖尿病患者十分适宜；\\n4、荔枝有消肿解毒、止血止痛的作用；\\n5、荔枝拥有丰富的维生素，可促进微细血管的血液循环，防止雀斑的发生，令皮肤更加光滑。\\n'
      }
    },
    {
      id: 145,
      name: '红黄彩椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 147,
      name: '骨头',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 148,
      name: '甜玉米',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、减肥：食后可消除肥胖人的饥饿感，但食后含热量很低，也是减肥的代用品之一。\\n2、防癌抗癌：植物纤维素能加速致癌物质和其他毒物的排出，多吃玉米还能抑制抗癌药物对人体的副作用。\\n3、降血压降血脂：丰富的钙可起到降血压的功效，有促进细胞分裂、降低血清胆固醇、并防止其沉积于血管壁，因此，玉米对冠心病、动脉粥样硬化、高脂血症及高血压等都有一定的预防和治疗作用。\\n4、增加记忆力、抗衰老：刺激大脑细胞，增强人的脑力、记忆力和人体新陈代谢力、调整神经系统功能。能起到使皮肤细嫩光滑，抑制、延缓皱纹产生作用，可以对抗眼睛老化。\\n5、明目：经常用眼的人，应多吃一些黄色的玉米，缓解黄斑变性、视力下降，叶黄素和玉米黄质凭借其强大的抗氧化作用，可以吸收进入眼球内的有害光线。\\n6、促进胃肠蠕动：可防治便秘、肠炎、肠癌等。',
        简介:
          '玉米，又名苞谷、棒子、玉蜀黍，有些地区以它作主食。玉米是粗粮中的保健佳品，对人体的健康颇为有利。',
        营养价值:
          '1.维生素含量非常高：玉米中的维生素含量非常高，为稻米、小麦的5~10倍，而特种玉米的营养价值要高于普通玉米。\\n2.植物纤维素含量丰富：玉米中所含的丰富的植物纤维素具有刺激胃肠蠕动、加速粪便排泄的特性，可防治便秘、肠炎、肠癌等。能束缚及阻碍过量的葡萄糖的吸收，起到抑制饭后血糖升高的作用；纤维素还可以抑制脂肪吸收，降低血脂水平，预防和改善冠心病、肥胖、胆结石症的发生。\\n3.富含硒和镁：玉米中含的硒和镁有防癌抗癌作用，硒能加速体内过氧化物的分解，使恶性肿瘤得不到分子氧的供应而受到抑制。镁一方面也能抑制癌细胞的发展，另一方面能促使体内废物排出体外，这对防癌也有重要意义。\\n4.含谷胱甘肽：玉米中还含有一种长寿因子-谷胱甘肽，它在硒的参与下，生成谷光甘肽氧化酶，具有恢复青春，延缓衰老的功能。\\n5.含玉米黄质：玉米中所含的玉米黄质，可以预防老年黄斑性病变的产生。根据1994年美国哈佛大学医学院和许多研究中心一起做的研究显示，摄取较高量的玉米黄质，能降低老年黄斑性病变的机率。\\n6.含有丰富的胡萝卜素与烟酸：玉米中所含的胡萝卜素，被人体吸收后能转化为维生素A；玉米中还含有烟酸，含量比大米高很多。烟酸在蛋白质、脂肪、糖的代谢过程中起着重要作用，能帮助我们维持神经系统、消化系统和皮肤的正常功能。人体内如果缺乏尼克酸，可能引起精神上的幻视、幻听、精神错乱等症状，消化上的口角炎、舌炎、腹泻等症状，以及皮肤上的癞皮病。\\n7.含有丰富的亚油酸：玉米中含有丰富的不饱和脂肪酸，尤其是亚油酸的含量高达60%以上，亚油酸可以降低胆固醇，防止其沉积在血管内壁上，从而减少动脉硬化的发生,对预防高血压，心脑血管病有积极的作用。'
      }
    },
    {
      id: 150,
      name: '净鲜鱼肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 151,
      name: '五花肉末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 152,
      name: '地瓜淀粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '1、红薯有抗癌作用。\\n2、红薯有益于心脏。\\n3、红薯预防肺气肿。',
        简介:
          '甘薯淀粉是由甘薯加工而成，质量较差。色灰暗，质粗糙，粘性差，但涨发性较强。红薯，又叫甘薯、白薯、地瓜、红苕、山芋。既是营养丰富的食品，又是可治疗多种疾病的药膳。',
        营养价值:
          '番薯营养十分丰富，含有大量的糖、蛋白质、脂肪和各种维生素与矿物质，还有胡萝卜素和维生素C。日本科研者最近还发现，番薯中含有抑制癌细胞生长的抗癌物质。他们在实验中发现，番薯中含有抑制癌细胞生长的抗癌物质。他们在实验中发现，浓缩四倍的白薯汁，对癌细胞增殖的抑制作用比普通白薯汁要强五分之一左右。他们还发现番薯制作淀粉后的残渣中含有抑制癌细胞增殖的物质。我们日常食用的番薯中也含有这种抑制癌的物质。\\n另外，番薯还具有多种药用价值。番薯含有一种特殊性能的维生素C和E，即只有番薯中所含的维生素C和E，才会有在高温条件下也不被破坏的特殊性能。其中维生素C能明显增强人体对感冒等数种病毒的抵抗力，而维生素E则能促进性欲，延缓衰老。\\n番薯中含有丰富的钾，能有效防止高血压的发生和预防中风等心血管疾病，番薯含有的乳白色浆液能起到通便、活血与抑制肌肉痉挛的作用，将鲜番薯捣烂，挤汁涂搽，便可治疗湿疹、蜈蚣咬伤、带状疱疹等疾患'
      }
    },
    {
      id: 154,
      name: '白萝卜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增强免疫力：抑制癌细胞的生长，对预防癌，抗癌有重要意义。\\n2、促消化：萝卜被称为“自然消化剂”根茎部分含有淀粉酶及各种消化酵素，能分解食物中的淀粉和脂肪，促进食物消化，解除胸闷，抑制胃酸过多。帮助胃蠕动，促进新陈代谢，还可以解毒。\\n3、保护肠胃：促进胃肠液分泌的作用，能让肠胃达到良好的状况。\\n4、降血脂：吃萝卜可降血脂、软化血管、稳定血压，预防冠心病、动脉硬化、胆结石等疾',
        简介:
          '白萝卜，根茎类蔬菜，十字花科萝卜属植物。根据营养学家分析，白萝卜生命力指数为5.5555，防病指数为2.7903。至今种植有千年历史，在饮食和中医食疗领域有广泛应用。',
        营养价值:
          '1、 增强机体免疫功能：萝卜含丰富的维生素C和微量元素锌，有助于增强机体的免疫功能，提高抗病能力；\\n2、 帮助消化：萝卜中的芥子油能促进胃肠蠕动，增加食欲，帮助消化；\\n3、帮助营养物质的吸收：萝卜中的淀粉酶能分解食物中的淀粉、脂肪、使之得到充分的吸收；\\n4、防癌抗癌：萝卜含有木质素，能提高巨噬细胞的活力，吞噬癌细胞。此外，萝卜所含的多种酶，能分解致癌的亚硝酸胺，具有防癌作用。'
      }
    },
    {
      id: 155,
      name: '猪蹄',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、美容抗衰老：猪蹄中的胶原蛋白质在烹调过程中可转化成明胶、它能结合许多水，从而有效改善机体生理功能和皮肤组织细胞的储水功能，防止皮肤过早褶皱，延缓皮肤衰老。\\n2、促进生长：猪蹄对于经常四肢疲乏，腿部抽筋、麻木，消化道出血，失血性休克及缺血性脑病患者一定辅助疗效，它还有助于青少年生长发育和减缓中老年妇女骨质疏松的速度。\\n3、改善冠心病：猪蹄含丰富的胶原蛋白，可促进毛皮生长，预治进行性肌营养不良症，使冠心病和脑血管病得到改善，对消化道出血、失水性休克有一定的疗效。',
        简介:
          '猪蹄又叫猪脚、猪手，含有丰富的胶原蛋白质，脂肪含量也比肥肉低，并且不含胆固醇，近年在对老年人衰老原因的研究中发现，人体中胶原蛋白质缺乏，是人衰老的一个重要因素。它能防治皮肤干瘪起皱、增强皮肤弹性和韧性，对延缓衰老和促进儿童生长发育都具有特殊意义。为此，人们把猪蹄称为“美容食品”和“类似于熊掌的美味佳肴”。',
        营养价值:
          '每100克猪蹄中含蛋白质15.8克、脂肪26.3克、碳水化合物1.7克。猪蹄中还含有维生素A、B、C及钙、磷、铁等营养物质，尤其是猪蹄中的蛋白质水解后，所产生的胱氨酸、精氨酸等11种氨基酸之含量均与熊掌不相上下。\\n另外猪蹄和猪皮中含有大量的胶原蛋白质，它在烹调过程中可转化成明胶。明胶具有网状空间结构，它能结合许多水，增强细胞生理代谢，有效地改善机体生理功能和皮肤组织细胞的储水功能，使细胞得到滋润，保持湿润状态，防止皮肤过早褶皱，延缓皮肤的衰老过程。猪蹄对于经常性的四肢疲乏、腿部抽筋、麻木、消化道出血、失血性休克胶缺血性脑患者有一定辅助疗效。也适用于大手术后及重病恢复期间的老人食用。有助于青少年生长发育和减缓中老年妇女骨质疏松的速度。传统医学认为，猪蹄有壮腰补膝和通乳之功，可用于肾虚所致的腰膝酸软和产妇产后缺少乳汁之症。'
      }
    },
    {
      id: 158,
      name: '鲈鱼',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、益肾安胎：能够益肾安胎、健脾补气，可治胎动不安、生产少乳等症。孕妈咪吃鲈鱼既容易消化，又能防治水肿、贫血头晕等症状。\\n2、维持神经系统的正常：铜能保护心脏，维持神经系统的正常功能，并参与数种物质代谢的关键酶的功能发挥。\\n3、补肝益脾：补肝肾、益脾胃、化痰止咳之效，对肝肾不足的人有很好的补益作用。',
        简介:
          '鲈鱼又称花鲈、寨花、鲈板、四肋鱼等，俗称鲈鲛，与长江鲥鱼、太湖银鱼并称为“四大名鱼”之一。\\n鲈鱼主产于辽宁大东沟、旅大、营口，河北秦皇岛，天津北塘，山东羊角沟、烟台、石岛、青岛，但以北塘产的品质最好，产期在3～8月间，立秋前后产的品质最好。',
        营养价值:
          '1、鲈鱼富含蛋白质、维生素A、B族维生素、钙、镁、锌、硒等营养元素。\\n2、值得一提的还有鲈鱼血，它含较多的铜元素。\\n'
      }
    },
    {
      id: 160,
      name: '纯牛奶',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、镇静安神：睡前喝一杯牛奶可促进睡眠。\\n2、抑制肿瘤：牛奶和奶制品干酪中含有一种CLA的物质，能有效破坏人体内有致癌危险的自由基，并能迅速和细胞膜结合，使细胞处于防御制癌物质侵入的状态，从而起到防癌作用。而且牛奶中所含的钙能在人体肠道内有效破坏致癌物质，使其分解改变成非致癌物质，并排出体外。牛奶中所含的维生素A、维生素B2、维生素D等对胃癌和结肠癌都有一定的预防作用。\\n3、促进幼儿大脑发育：乳是哺乳动物出生后赖以生存发育的唯一食物，它含有适合其幼子发育所必须的全部营养素。\\n4、美容养颜：牛奶中的乳清对面部皱纹有消除作用，可使皮肤保持光滑滋润。\\n5、全面补充营养：可使动脉血管在高压时保持稳定，减少中风风险；能大大提高大脑的工作效率；能增强骨骼和牙齿，减少骨骼萎缩病的发生；使伤口更快愈合。',
        简介:
          '牛奶是人们日常生活中喜爱的饮食之一，每年5月的第三个星期二，是“国际牛奶日”；喝牛奶的好处如今已越来越被大众所认识，牛奶中含有丰富的钙、维生素D等，包括人体生长发育所需的全部氨基酸，消化率可高达98%,是其他食物无法比拟的。',
        营养价值:
          '1、牛奶中富含维生素A，可以防止皮肤干燥及暗沉，使皮肤白皙，有光泽；\\n2、牛奶中含有大量的B2，可以促进皮肤的新陈代谢；\\n3、牛奶中的乳清对黑色素有消除作用，可防治多种色素沉着引起的斑痕；\\n4、牛奶能为皮肤提供封闭性油脂，形成薄膜以防皮肤水分蒸发，还能暂时提供水分，可保证皮肤的光滑润泽；\\n5、牛奶中的一些物质对中老年男子有保护作用，喝牛奶的男子身材往往比较苗条，体力充沛，高血压的患病率也较低，脑血管病的发生率也较少；\\n6、牛奶中的钙最容易被吸收，而且磷、钾、镁等多种矿物搭配也十分合理，孕妇应多喝牛奶，绝经期前后的中年妇女常喝牛奶可减缓骨质流失。'
      }
    },
    {
      id: 161,
      name: '蜜豆',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、有良好的利尿作用，能解酒、解毒，对心脏病和肾病、水肿均有益。\\n2、含有较多的膳食纤维，具有良好的润肠通便、降血压、降血脂、调节血糖、解毒抗癌、预防结石、健美减肥的作用。\\n3、红小豆是富含叶酸的食物。产妇，乳母多吃红小豆有催乳的功效。',
        简介:
          '蜜豆是由红豆制作而成，原料：红豆、红糖（或白糖或蜂蜜，随个人喜好）制作而成。',
        营养价值:
          '1、赤小豆含有较多的皂角甙，可刺激肠道，因此它有良好的利尿作用，能解酒、解毒，对心脏病和肾病、水肿有益；\\n2、赤小豆有较多的膳食纤维，具有良好的润肠通便、降血压、降血脂、调节血糖、解毒抗癌、预防结石、健美减肥的作用；\\n3、赤小豆是富含叶酸的食物，产妇、乳母多吃红小豆有催乳的功效。'
      }
    },
    {
      id: 162,
      name: '草莓',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、养肝明目：草莓中含有胡萝卜素，它可是合成维生素A的重要物质，因此具有养肝明目的功效。\\n2、补血：草莓可以缓解贫血，还能调理胃肠道的健康。\\n3、防癌：草莓中的鞣酸含量是很丰富的，在体内可吸附和阻止致癌化学物质的吸收，具有防癌作用。\\n4、润肺生津：草莓可以去除肺燥肺热，滋阴润肺，能够让呼吸更加畅通。\\n5、通便：草莓中含有果胶和纤维素，可以有效促进肠道蠕动，减少便秘、痔疮，甚至肠癌的发生。',
        简介:
          '草莓又叫红莓、洋莓、地莓等，是一种红色的水果。草莓是对蔷薇科草莓属植物的通称，属多年生草本植物。草莓的外观呈心形，鲜美红嫩，果肉多汁，含有特殊的浓郁水果芳香。草莓营养价值高，含丰富维生素C ，有帮助消化的功效，与此同时，草莓还可以巩固齿龈，清新口气，润泽喉部。',
        营养价值:
          '1、草莓中所含的胡萝卜素是合成维生素A的重要物质，具有明目养肝作用；\\n2、草莓对胃肠道和贫血均有一定的滋补调理作用；\\n3、草莓除可以预防坏血病外，对防治动脉硬化，冠心病也有较好的疗效；\\n4、草莓是鞣酸含量丰富的植物，在体内可吸附和阻止致癌化学物质的吸收，具有防癌作用；\\n5、草莓中含有天冬氨酸，可以自然平和的清除体内的重金属离子。\\n'
      }
    },
    {
      id: 164,
      name: '葱白',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进食欲：葱有助于食欲的增进。同时与维生素B1含量较多的食物一起摄取时，维生素B1所含的淀粉及糖质会变为热量，而提高恢复疲劳的作用。\\n2、预防老年痴呆：有舒张小血管，促进血液循环的作用，有助于防止血压升高所致的头晕，使大脑保持灵活和预防老年痴呆的作用。\\n3、强身健体：经常吃葱的人，即便脂多体胖，但胆固醇并不增高，而且体质强壮。\\n4、防癌抗癌：可降低胃液内的亚硝酸盐含量，对预防胃癌及多种癌症有一定作用。\\n5、治疗感冒：其中的发性辣素还通过汗腺、呼吸道、泌尿系统排出时能轻微刺激刺激相关腺体的分泌，而起到发汗、祛痰、利尿作用。是治疗感冒的中药之一。\\n6、降三高：葱还有降血脂、降血压、降血糖的作用。\\n7、吃葱可以长寿：中国自古就有吃葱可以长寿的说法。',
        简介:
          '葱（学名：Allium fistulosum L.），为百合科葱属多年生草本植物。鳞茎单生，圆柱状，稀为基部膨大的卵状圆柱形；鳞茎外皮白色，稀淡红褐色，膜质至薄革质，不破裂。叶圆筒状，中空；花葶圆柱状，中空，中部以下膨大，向顶端渐狭；总苞膜质，伞形花序球状，多花，较疏散；花被片长6-8.5毫米，近卵形；花丝为花被片长度的1.5-2倍，锥形；子房倒卵状，腹缝线基部具不明显的蜜穴；花柱细长，伸出花被外。花果期4-7月。',
        营养价值:
          '1. 生葱像洋葱、大葱一样，含烯丙基硫醚。\\n2.葱叶部分要比葱白部分含有更多的维生素A、维C及钙。\\n3.葱含有具有刺激性气味的挥发油和辣素，能祛除腥腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用。'
      }
    },
    {
      id: 166,
      name: '梅干菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解毒消肿：梅干菜能消除人体内的多种细菌和病毒，可以搞高人体组织细胞的抗感染性。\\n2、止痛明目：梅干菜含有多种维生素，其中维生素A和维生素D，相互作用可以促进人体细胞的再生，也能促进溃疡面的愈合，同时也能起到一定的止痛作用，另外这些维生素被眼睛吸收以后还能起到明目的提高视力的重要功效。\\n3、开胃消食：梅干菜含有大量的植物纤维，能加快肠胃的运动，也能促进大便的生成与排出，另外梅干菜带有特殊的香味，人们食用以后能开胃消食，增加食欲，也能加快肠胃对食物的消化和吸收。',
        简介:
          '梅干菜是一种中国传统烹饪原料。使用雪里蕻或其他芥菜种类的茎叶，用盐腌制风干而成。是一种客家乡土菜。秋末冬初，菜园里的芥菜抽了苔，姆指粗细，顶带花蕾，形如秋萄，脆嫩味甘。这时，摘下菜心，晾挂几天。待叶子变软时，放进盆里，撒上盐，用手揉搓，等渗出一些菜汁时，便装入陶瓮，码放一层撒一层盐，装满后用芥菜叶或竹笋壳把瓮口封严。过了十天半个月，取出晒干，便成职色泽金黄，咸酸味甘的梅干菜。',
        营养价值:
          '在腌菜中，梅干菜营养价值较高，其胡萝卜素和镁的含量尤显突出。其味甘，可开胃下气、益血生津、补虚劳。年久者泡汤饮，治声音不出。\\n'
      }
    },
    {
      id: 167,
      name: '腐乳汁',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 168,
      name: '白酒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、预防心血管病：少量饮用白酒，可预防心血管病的作用。 \\n2、消除疲劳和紧张：少量饮用白酒，能够通过酒精对大脑和中枢神经的作用，起到消除疲劳，松弛神经的功效。 \\n3、开胃消食：在进餐的同时，饮用少量的白酒，能够增进食欲，促进食物的消化。\\n4、驱除寒冷：白酒含有大量的热量，饮入人体后，这些热量会迅速被人体吸收。\\n5、促进新陈代谢：白酒能够促进人体的血液循环，对全身皮肤起到一定良性的刺激作用。\\n6、舒筋活血：白酒具有舒筋通络、活血化淤的功效。',
        简介:
          '白酒是世界蒸馏酒中独具一格的酒类，为麦黍、高粱、玉米、红薯、米糠等粮食或其他果品发酵、曲酿、蒸馏而成的一种饮料。其酒液无色透明，故称为白酒。白酒芳香浓郁，醇和软润，风味多样。因主要采用烧(蒸)工序，亦称烧酒。因含酒精量较高，所有有些地方直呼其为烈性酒或高度酒。我国的名白酒，历史悠久，在世界上独树一帜。',
        营养价值:
          '白酒含有极少量的钠、铜、锌，几乎不含维生素和钙、磷、铁等，所含有的仅是水和乙醇(酒精)。酒中的酒精被人体吸收后，虽然也可以氧化供热，但是饮白酒所感到的浑身发热，并非酒精供热的结果，而是在酒精的刺激下，由人体的微血管扩张，体表大量散热所致，实际上消耗的还是体内的葡萄糖。据测定，每饮烈酒500克，会使体内在一天内所摄取能量的1/3～1/2被它白白消耗掉。\\n由此可见，白酒的营养物质只是很少的一部分白酒中含有极少量的锌、铜、硒等矿物质，仅此而已。但这些成分的作用也不容小觑。\\n传统认为白酒的作用有活血通脉、助药力、增进食欲、消除疲劳，陶冶情操，使人轻快并有御寒提神的功能。饮用少量低度白酒可以扩张小血管，促进血液循环，延缓胆固醇等脂质在血管壁的沉积，对循环系统及心脑血管有利。\\n因此，适当饮酒对人体是非常有益的，但绝对不要过量，过量饮酒伤肝，可能导致脂肪肝、酒精肝炎、肝硬化，并逐步演变为肝癌。'
      }
    },
    {
      id: 169,
      name: '白糖',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、适当食用白糖有助于提高机体对钙的吸收，但过多就会妨碍钙的吸收。\\n2、吃糖后应及时漱口或刷牙，以防龋齿的产生。\\n3、糖尿病病人不易直接食用食糖，最好是以甜味剂替代。\\n4、白砂糖味甘、性平，归脾、肺经；有润肺生津、止咳、和中益肺、舒缓肝气、滋阴、调味、除口臭、解盐卤毒之功效。',
        简介:
          '绵白糖简称绵糖，也叫白糖，是我国人民比较喜欢的一种食用糖。它质地绵软、细腻，结晶颗粒细小，并在生产过程中喷入了2.5%左右的转化糖浆。而白砂糖的主要成分是蔗糖，故绵白糖的纯度不如白砂糖高。',
        营养价值:
          '白砂糖，味甘、性平；归脾、肺经；有润肺生津、止咳、和中益肺、舒缓肝气、滋阴、调味、除口臭、解盐卤毒之功效。'
      }
    },
    {
      id: 170,
      name: '油盐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 172,
      name: '杏鲍菇',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、祛脂降压：杏鲍菇能软化和保护血管，有降低人体中血脂和胆固醇的作用。\\n2、提高免疫力：杏鲍菇蛋白质是维持免疫机能最重要的营养素，为构成白血球和抗体的主要成份。\\n3、消食：杏鲍菇有助于胃酸的分泌和食物的消化，宜于治疗饮食积滞证。',
        简介:
          '杏鲍菇，又名刺芹侧耳，是近年来开发栽培成功的集食用、药用、食疗于一体的珍稀食用菌新品种。\\n杏鲍菇菌肉肥厚，质地脆嫩，特别是菌柄组织致密、结实、乳白，可全部食用，且菌柄比菌盖更脆滑、爽口，被称为“平菇王”、“干贝菇”，具有杏仁香味和如鲍鱼的口感，适合保鲜、加工，深得人们的喜爱。菌肉肥厚似鲍鱼，因而得名杏鲍菇。日本称为"雪茸"。杏鲍菇营养丰富，质地脆嫩，口感绝佳，风味独特，故有"草原上的美味牛肝菌"之美称。',
        营养价值:
          '杏鲍菇营养丰富，富含蛋白质、碳水化合物、维生素及钙、镁、铜、锌等矿物质，可以提高人体免疫功能，对人体具有抗癌、降血脂、润肠胃以及美容等作用。\\n'
      }
    },
    {
      id: 174,
      name: '菠萝',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、消除水肿：溶解阻塞于组织中的纤维蛋白和血凝块，改善局部的血液循环，消除炎症和水肿\\n2、减肥、助消化，促进食欲：具有健胃消食、补脾止泻、清胃解渴的功效\\n3、去油腻，清理肠胃：菠萝中所含的蛋白质分解酵素可以分解蛋白质及助消化\\n5、美容：防止皮肤干裂，滋润头发的光亮\\n6、保健：促进血液循环酶，素来可以降低血压，稀释血脂\\n7、消除感冒：新鲜的菠萝汁，它有降温的作用，并能有效地降低支气管\\n8.利尿：适当食用对肾炎，高血压病患者有益。',
        简介:
          '菠萝原名凤梨，原产巴西, 16世纪时传入中国, 有70多个品种, 岭南四大名果之一。菠萝含用大量的果糖，葡萄糖，维生素A、B、C，磷，柠檬酸和蛋白酶等物。味甘性温，具有解暑止渴、消食止泻之功，为夏令医食兼优的时令佳果。',
        营养价值:
          '菠萝味甘、微酸、性平，入胃、肾经；具有健胃消食、解热消暑、解酒、降血压、抗癌、补脾止泻、清胃解渴等功用。可用于消化不良、肠炎腹泻、伤暑、身热烦渴等症，也可用于高血压眩晕、手足软弱无力的辅助治疗。\\n菠萝中所含有的糖、盐类和酶有利尿作用，适当食用对于患高血压和肾炎的病人有好处。此外，菠萝酶还有溶解阻塞于组织中的纤维蛋白和血凝块的作用，能改善局部的血液循环，消除炎症和水肿。\\n菠萝含有一种叫“菠萝朊酶”的物质，它能分解蛋白质，溶解阻塞于组织中的纤维蛋白和血凝块，改善局部的血液循环，消除炎症和水肿；菠萝中所含糖、盐类和酶有利尿作用，适当食用对肾炎，高血压病患者有益。'
      }
    },
    {
      id: 175,
      name: '彩椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、预防心血管疾病：可改善黑斑及雀斑，还有消暑、补血、消除疲劳、预防感冒和促进血液循环等功效，能够使血液中的良好胆固醇增加，使血管强健，使血液循环转为良好，改善动脉硬化以及各种的心血管疾病。\\n2、促进新陈代谢：其中的椒类碱能够促进脂肪的新陈代谢，防止体内脂肪积存，从而减肥防病。\\n3、抗老化：红甜椒所具有的强大抗氧化作用，可抗白内障、心脏病和癌症，防止身体老化，并且使体内的细胞活化，有著非常明显的效果。',
        简介:
          '五彩椒又名朝天椒、五彩辣椒，是辣椒的变种，为茄科多年生半木质性植物，但常作一年生栽培。株高30-60厘米，茎直立，常呈半木质化，分枝多，单叶互生。花单生叶腋或簇生枝梢顶端，花白色，形小不显眼。花期5月初到7月底。果实簇生于枝端。同一株果实可有红、黄、紫、白等各种颜色，有光泽，盆栽观赏很逗人喜爱。也可以食用，风味同青椒一样。',
        营养价值:
          '甜椒中含有很丰富的维生素A、B、C，β胡萝卜素，糖类、纤维质、钙、磷、铁能增强免疫力，对抗自由基的破坏，保护视力，还可以使皮肤白皙亮丽。经常食用可以强化指甲和滋养发根，对于肌肤有活化细胞组织功能，促进新陈代谢，使皮肤光滑柔嫩，具有美容的功效。可以预防微血管的脆弱出血、牙龈出血、眼睛视网膜出血、脑血管出血，也是糖尿病患者较宜食用的食物。\\n'
      }
    },
    {
      id: 176,
      name: '洋葱',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、杀菌：洋葱的辣味能抗寒，抵御流感病毒，有较强的杀菌作用。\\n2、促进消化：可用于治疗消化不良、食欲不振、食积内停等症。\\n3、降血压降血脂：经常食用对高血压，高血脂和心脑血管病人都有保健作用。\\n4、防癌抗癌延缓衰老：洋葱所含的抗氧化剂增强细胞的活力抗癌抗衰老\\n5、补钙：有助于增加骨密度防止骨质疏松',
        简介:
          '洋葱又名球葱、圆葱、玉葱、葱头，荷兰葱，属百合科蒜属，为2年生草本植物。有关洋葱的原产地说法很多，但多数认为洋葱产于亚洲西南部中亚西亚、小亚西亚的伊朗、阿富汗的高原地区。洋葱的起源已有5000多年历史，公元前1000年传到埃及，后传到地中海地区，16世纪传入美国，17世纪传到日本，20世纪初传入我国。 洋葱在我国分布很广，南北各地均有栽培，而且种植面积还在不断扩大，是目前我国主栽蔬菜之一。我国已成为洋葱生产量较大的4个国家(中国、印度、美国、日本)之一。 我国的种植区域主要是山东、甘肃、内蒙古、新疆等地。',
        营养价值:
          '1、洋葱具有发散风寒的作用，是因为洋葱鳞茎和叶子含有一种称为硫化丙烯的油脂性挥发物，具有辛简辣味，这种物质能抗寒，抵御流感病毒，有较强的杀菌作用。\\n2、洋葱营养丰富，且气味辛辣。能刺激胃、肠及消化腺分泌，增进食欲，促进消化，且洋葱不含脂肪，其精油中含有可降低胆固醇的含硫化合物的混合物，可用于治疗消化不良、食欲不振、食积内停等症；\\n3、洋葱是目前所知唯一含前列腺素A的。前列腺素A能扩张血管、降低血液黏度，因而会产生降血压、能减少外周血管和增加冠状动脉的血流量，预防血栓形成作用。对抗人体内儿茶酚胺等升压物质的作用，又能促进钠盐的排泄，从而使血压下降，经常食用对高血压，高血脂和心脑血管病人都有保健作用；\\n4、洋葱有一定的提神作用，它能帮助细胞更好地利用葡萄糖，同时降低血糖，供给脑细胞热能，是糖尿病、神志萎顿患者的食疗佳蔬；\\n5、洋葱中含有一种名炎“栎皮黄素”9的物质，这是目前所知最有效的天然抗癌物质之一，它能阻止体内的生物化学机制出现变异，控制癌细胞的生长，从而具有防癌抗癌作用；\\n6、洋葱所含的微量元素硒是一种很强的抗氧化剂，能消除体内的自由基，增强细胞的活力和代谢能力，具有防癌抗衰老的功效；\\n7、洋葱中还含有一定的钙质，近年来，瑞士科学家发现常吃洋葱能提高骨密度，有助于防治骨质疏松症；\\n8、洋葱中含有植物杀菌素如大蒜素等，因而有很强的杀菌能力。嚼生洋葱可以预防感冒。'
      }
    },
    {
      id: 177,
      name: '蛋清',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、鸡蛋清性微寒而气清，能易经补气，润肺利咽。\\n2、鸡蛋清不但可以使皮肤变白,而且能使皮肤细嫩。这是因为它含有丰富的蛋白质和少量醋酸,蛋白质可以增强皮肤的润滑作用,醋酸可以保护皮肤的微酸性,以防细菌感染。\\n3、鸡蛋清还具有清热解毒作用。',
        简介:
          '鸡蛋清不但可以使皮肤变白，而且能使皮肤细嫩。这是因为它含有丰富的蛋白质和少量醋酸，蛋白质可以增强皮肤的润滑作用，醋酸可以保护皮肤的微酸性，以防细菌感染。此外，鸡蛋清还具有清热解毒作用。',
        营养价值:
          '每100克鸡蛋清含蛋白质10克,脂肪0.1克,碳水化物1克,灰分0.6克;钙19毫克,磷16毫克,铁0.3毫克,核黄素0.26毫克,尼克酸0.1毫克;维生素A及C缺如:硫胺素0.216微克/克,泛酸<1微克/克,对氨基苯甲酸0.055(干卵白)微克/克。'
      }
    },
    {
      id: 179,
      name: '蒜米',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 181,
      name: '茄子',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、治胃癌：能抑制消化道肿瘤细胞的增值针对胃癌、盲肠癌有较好的抑制作用。\\n2、抗衰老：茄子含有维生素E，有防止出血和抗衰老功能，常吃茄子，可使血液中胆固醇水平不致增高，对延缓人体衰老具有积极的意义。\\n3、降低胆固醇保护心血管：经常吃茄子有预防高血压、冠心病、动脉粥样硬化、紫斑症、坏血病及促进伤口愈合等作用。\\n4、清热解暑：对于容易长痱子、生疮疖的人,尤为适宜。',
        简介:
          '茄子，江浙人称为六蔬，广东人称为矮瓜，是茄科茄属一年生草本植物，热带为多年生。其结出的果实可食用，颜色多为紫色或紫黑色，也有淡绿色或白色品种，形状上也有圆形，椭圆，梨形等各种。茄子是一种典型的蔬菜，根据品种的不同，用法多样。根据营养专家黎黍匀分析，茄子的预防疾病指数为26.29，生命力指数为9.7142，证明对疾病的康复具有相当高的价值，而对生命力的提高属于有效范围。',
        营养价值:
          '茄子的营养，也较丰富，含有蛋白质、脂肪、碳水化合物、维生素以及钙、磷、铁等多种营养成分。每100克含有蛋白质2．3克，脂肪0．1克，碳水化合物3．1克，钙22毫克，磷31毫克，铁0．4毫克，胡萝卜素0．04毫克，硫胺素0．03毫克，核黄素0．04毫克，尼克酸0．5毫克，抗坏血酸3毫克。此外，还含有维3．抗衰老茄子含有维生素E，有防止出血和抗衰老功能，常吃茄子，可使血液中胆固醇水平不致增高，对延缓人体衰老具有积极的意义。\\n'
      }
    },
    {
      id: 182,
      name: '猪肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效，主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴、润肌肤、利小便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉又名豚肉，是主要家畜之一。属猪科动物。其性味甘咸平，含有丰富的蛋白质及脂肪、碳水化合物、钙、磷、铁等成分。 猪肉是日常生活的主要副食品，具有补虚强身，滋阴润燥、丰肌泽肤的作用。凡病后体弱、产后血虚、面黄赢瘦者，皆可用之作营养滋补之品。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 183,
      name: '蒜末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 184,
      name: '葱末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进食欲：葱有助于食欲的增进。同时与维生素B1含量较多的食物一起摄取时，维生素B1所含的淀粉及糖质会变为热量，而提高恢复疲劳的作用。\\n2、预防老年痴呆：有舒张小血管，促进血液循环的作用，有助于防止血压升高所致的头晕，使大脑保持灵活和预防老年痴呆的作用。\\n3、强身健体：经常吃葱的人，即便脂多体胖，但胆固醇并不增高，而且体质强壮。\\n4、防癌抗癌：可降低胃液内的亚硝酸盐含量，对预防胃癌及多种癌症有一定作用。\\n5、治疗感冒：其中的发性辣素还通过汗腺、呼吸道、泌尿系统排出时能轻微刺激刺激相关腺体的分泌，而起到发汗、祛痰、利尿作用。是治疗感冒的中药之一。\\n6、降三高：葱还有降血脂、降血压、降血糖的作用。\\n7、吃葱可以长寿：中国自古就有吃葱可以长寿的说法。',
        简介:
          '葱（学名：Allium fistulosum L.），为百合科葱属多年生草本植物。鳞茎单生，圆柱状，稀为基部膨大的卵状圆柱形；鳞茎外皮白色，稀淡红褐色，膜质至薄革质，不破裂。叶圆筒状，中空；花葶圆柱状，中空，中部以下膨大，向顶端渐狭；总苞膜质，伞形花序球状，多花，较疏散；花被片长6-8.5毫米，近卵形；花丝为花被片长度的1.5-2倍，锥形；子房倒卵状，腹缝线基部具不明显的蜜穴；花柱细长，伸出花被外。花果期4-7月。',
        营养价值:
          '1. 生葱像洋葱、大葱一样，含烯丙基硫醚。\\n2.葱叶部分要比葱白部分含有更多的维生素A、维C及钙。\\n3.葱含有具有刺激性气味的挥发油和辣素，能祛除腥腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用。'
      }
    },
    {
      id: 185,
      name: '葱花',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进食欲：葱有助于食欲的增进。同时与维生素B1含量较多的食物一起摄取时，维生素B1所含的淀粉及糖质会变为热量，而提高恢复疲劳的作用。\\n2、预防老年痴呆：有舒张小血管，促进血液循环的作用，有助于防止血压升高所致的头晕，使大脑保持灵活和预防老年痴呆的作用。\\n3、强身健体：经常吃葱的人，即便脂多体胖，但胆固醇并不增高，而且体质强壮。\\n4、防癌抗癌：可降低胃液内的亚硝酸盐含量，对预防胃癌及多种癌症有一定作用。\\n5、治疗感冒：其中的发性辣素还通过汗腺、呼吸道、泌尿系统排出时能轻微刺激刺激相关腺体的分泌，而起到发汗、祛痰、利尿作用。是治疗感冒的中药之一。\\n6、降三高：葱还有降血脂、降血压、降血糖的作用。\\n7、吃葱可以长寿：中国自古就有吃葱可以长寿的说法。',
        简介:
          '葱（学名：Allium fistulosum L.），为百合科葱属多年生草本植物。鳞茎单生，圆柱状，稀为基部膨大的卵状圆柱形；鳞茎外皮白色，稀淡红褐色，膜质至薄革质，不破裂。叶圆筒状，中空；花葶圆柱状，中空，中部以下膨大，向顶端渐狭；总苞膜质，伞形花序球状，多花，较疏散；花被片长6-8.5毫米，近卵形；花丝为花被片长度的1.5-2倍，锥形；子房倒卵状，腹缝线基部具不明显的蜜穴；花柱细长，伸出花被外。花果期4-7月。',
        营养价值:
          '1. 生葱像洋葱、大葱一样，含烯丙基硫醚。\\n2.葱叶部分要比葱白部分含有更多的维生素A、维C及钙。\\n3.葱含有具有刺激性气味的挥发油和辣素，能祛除腥腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用。'
      }
    },
    {
      id: 187,
      name: '生菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、生菜中含有膳食纤维和维生素C，有消除多余脂肪的作用，故又叫减肥生菜。\\n2、因其茎叶中含有莴苣素，故味微苦，具有镇痛催眠、降低胆固醇、辅助治疗神经衰弱等功效。\\n3、生菜中含有甘露醇等有效成分，有利尿和促进血液循环的作用。\\n4、生菜中含有一种“干扰素诱生剂”，可刺激人体正常细胞产生干扰素，从而产生一种“抗病毒蛋白”抑制病毒。',
        简介:
          '生菜是叶用莴苣的俗称，属菊科莴苣属。为一年生或二年生草本作物，也是欧、美国家的大众蔬菜，深受人们喜爱。生菜原产欧洲地中海沿岸，由野生种驯化而来。古希腊人、罗马人最早食用。生菜传入我国的历史较悠久，东南沿海，特别是大城市近郊、两广地区栽培较多，特别是台湾种植尤为普遍。近年来，栽培面积迅速扩大，生菜也由宾馆、饭店进入寻常百姓的餐桌。',
        营养价值:
          '1、生菜中含有膳食纤维和维生素C，有消除多余脂肪的作用，故又叫减肥生菜；\\n2、因其茎叶中含有莴苣素，故味微苦，具有镇痛催眠、降低胆固醇、辅助治疗神经衰弱等功效；\\n3、生菜中含有甘露醇等有效成分，有利尿和促进血液循环的作用；\\n4、生菜中含有一种“干扰素诱生剂”，可刺激人体正常细胞产生干扰素，从而产生一种“抗病毒蛋白”抑制病毒。\\n'
      }
    },
    {
      id: 189,
      name: '虾',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增强人体免疫力：虾的营养价值极高，能增强人体的免疫力和性功能，补肾壮阳，抗早衰，可医治肾虚阳痿、畏寒、体倦、腰膝酸痛等病症。\\n2、通乳汁：如果妇女产后乳汁少或无乳汁，鲜虾肉500克，研碎，黄酒热服，每日3次，连服几日，可起催乳作用。\\n3、缓解神经衰弱：虾皮有镇静作用，常用来治疗神经衰弱，植物神经功能紊乱诸症。海虾是可以为大脑提供营养的美味食品。海虾中含有三种重要的脂肪酸，能使人长时间保持精力集中。\\n4、有利于病后恢复：虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物。\\n5、预防动脉硬化：虾中含有丰富的镁，镁对心脏活动具有重要的调节作用，能很好的保护心血管系统，它可减少血液中胆固醇含量，防止动脉硬化，同时还能扩张冠状动脉，有利于预防高血压及心肌梗死。\\n6、消除“时差症”：日本大阪大学的科学家最近发现，虾体内的虾青素有助于消除因时差反应而产生的“时差症”。',
        简介:
          '虾介绍 虾，甲壳亚门(Crustacea)十足目(Decapoda)游泳亚目(Natantia)动物。近2,000种。与蟹、螯虾、蝲蛄、海螯虾、蝉虾和龙虾近缘。我国海域宽广、江河湖泊众多，盛产海虾和淡水虾。海虾是口味鲜美、营养丰富、可制多种佳肴的海味，有菜中之"甘草"的美称。海虾有对虾、明虾、基围虾、琵琶虾、龙虾等；淡水虾有青虾、河虾、草虾、小龙虾等；还有半咸水虾如白虾等。不管何种虾，都含有丰富的蛋白质，营养价值很高，其肉质和鱼一样松软，易消化，但又无腥味和骨刺，同时含有丰富的矿物质（如钙、磷、铁等），海虾还富含碘质，对人类的健康极有裨益。根据科学的分，虾可食部分蛋白质占16～20％左右。',
        营养价值:
          '1、虾中含有20%的蛋白质，是蛋白质含量很高的食品之一，是鱼、蛋、奶的几倍甚至十几倍，虾和鱼肉相比，所含的人体必需氨基酸缬氨酸并不高，但却是营养均衡的蛋白质来源，另外，虾类含有甘氨酸，这种氨基酸的含量越高，虾的甜味就越高。\\n2、虾和鱼肉禽肉相比，脂肪含量少，并且几乎不含作为能量来源的动物糖质，虾中的胆固醇含量较高，同时含有丰富的能降低人体血清胆固醇的牛磺酸，虾含有丰富的钾、碘、镁、磷等微量元素和维生素A等成分。\\n'
      }
    },
    {
      id: 190,
      name: '火锅粉丝',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 191,
      name: '红椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、红尖椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、红尖椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、红尖椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、红尖椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '红尖椒原产于中南美洲热带地区，明代的时候传入我国。如今全国各地均有栽培，并且一年四季都有。墨西哥人将它视为国食，而在我国很多地方红尖椒也是非常重要的调味品。红尖椒晒干以后就是我们超市里所见的干辣椒。挑选鲜的红尖椒时应选果皮坚实，肉厚质细而脆嫩，无虫咬、黑点和腐烂的。',
        营养价值:
          '辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇；含有较多抗氧化物质，可预防癌症及其他慢性疾病；可以使呼吸道畅通，用以治疗咳嗽、感冒。吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲，增加饭量。\\n辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。它含有一种特殊物质，能加速新陈代谢以达到燃烧体内脂肪的效果显著，从而起到减肥作用。这种物质还可以促进荷尔蒙分泌，对皮肤有很好的美容保健作用，是女性的“补品”。\\n'
      }
    },
    {
      id: 193,
      name: '火腿',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、火腿肉性温，味甘咸;具有健脾开胃，生津益血，滋肾填精之功效；可用以治疗虚劳怔忡、脾虚少食、久泻久痢、腰腿酸软等症。\\n2、富含蛋白质，具有维持钾钠平衡;消除水肿。提高免疫力。\\n3、富含铜，铜是人体健康不可缺少的微量营养素，对于血液、中枢神经和免疫系统，头发、皮肤和骨骼组织以及脑子和肝、心等内脏的发育和功能有重要影响。',
        简介:
          '又名兰熏、熏蹄、南腿。\\n火腿即猪的腿腌制而成，《东阳县志》中称熏蹄，《宦游笔记》中称兰熏，历史上总以浙江金华火腿驰名天下。清代医家王孟英称赞说：以金华之东阳，冬月造者为胜，浦江、义乌稍逊，他邑不能及也。逾二年，即为陈腿，味甚香美，甲于珍馐，养志补虚，洵为极品。\\n火腿是一种在世界范围内流行很广的肉制品，目前除少数伊斯兰教国家外，几乎各国都有生产和销售。世界著名的火腿品种有法国烟熏火腿、苏格兰整只火腿、德国陈制火腿、意大利火腿、苹果火腿等。',
        营养价值:
          '1、火腿色泽鲜艳，红白分明，瘦肉香咸带甜，肥肉香而不腻，美味可口；\\n2、火腿内含丰富的蛋白质和适度的脂肪，十多种氨基酸、多种维生素和矿物质；\\n3、火腿制作经冬历夏，经过发酵分解，各种营养成分更易被人体所吸收，具有养胃生津、益肾壮阳、固骨髓、健足力、愈创口等作用。'
      }
    },
    {
      id: 194,
      name: '胡椒粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、有温中下气，消痰解毒的功效。\\n2、主治寒痰食积、脘腹冷痛、反胃、呕吐清水、泄泻、冷痢；外敷治疮肿、毒蛇咬伤、犬咬伤；又可解食物毒。\\n3、温中散寒：用于胃寒所致的胃脘痛、呕吐、以及腹冷所致的泄泻、肠鸣。\\n4、醒脾开胃：本品小剂量能增进食欲，对胃口差、消化不良有治疗作用。',
        简介:
          '胡椒为热带植物胡椒树的果实，主要产在印度、越南、印尼、泰国、新加坡等国，我国广东省海南岛也有生产。胡椒味辛辣芳香，性热，除可去腥增香外，还有除寒气、消积食的效用，但多食则刺激胃粘膜而引起充血。',
        营养价值:
          '1. 胡椒的主要成分是胡椒碱，也含有一定量的芳香油、粗蛋白、粗脂肪及可溶性氮，能祛腥、解油腻，助消化；\\n2. 胡椒的气味能增进食欲；\\n3. 胡椒性温热，对胃寒所致的胃腹冷痛、肠鸣腹泻有很好的缓解作用，并治疗风寒感冒；\\n4. 胡椒有防腐抑菌的作用，可解鱼虾肉毒；\\n5. 黑胡椒的辣味比白胡椒强烈，香中带辣，祛腥提味，更多的用于烹制内脏、海鲜类菜肴；\\n6. 白胡椒的药用价值较大，可散寒、健胃等，可以增进食欲、助消化，促发汗；还可以改善女性白带异常及癫痫症。'
      }
    },
    {
      id: 195,
      name: '酱油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲：烹调食品时加入一定量的酱油，可增加食物的香味，并可使其色泽更加好看，从而增进食欲。\\n2、防癌：酱油的主要原料是大豆，大豆及其制品因富含硒等矿物质而有防癌的效果。\\n3、降低胆固醇：酱油含有多种维生素和矿物质，可降低人体胆固醇，降低心血管疾病的发病率，并能减少自由基对人体的损害。\\n4、止痒消肿：酱油可用于水、火烫伤和蜂、蚊等虫的蜇伤，并能止痒消肿。',
        简介:
          '酱油，用豆、麦、麸皮酿造的液体调味品。色泽红褐色，有独特酱香，滋味鲜美，有助于促进食欲。是中国的传统调味品。酱油俗称豉油，主要由大豆、淀粉、小麦、食盐经过制油、发酵等程序酿制而成的。酱油的成分比较复杂，除食盐的成分外，还有多种氨基酸、糖类、有机酸、色素及香料等成分。以咸味为主，亦有鲜味、香味等。它能增加和改善菜肴的味道，还能增添或改变菜肴的色泽。我国人民在数千年前就已经掌握酿制工艺了。酱油一般有老抽和生抽两种：生抽较咸，用于提鲜；老抽较淡，用于提色。',
        营养价值:
          '酱油中的氨基酸是人体所需的主要营养物质，尤其是酱油中含有一些人体不能合成的氨基酸，总量多达17种，还含有B族维生素和安全无毒的棕红色素。 酱油主要由大豆，淀粉、小麦、食盐经过制油、发酵等程序酿制而成的。酱油的成分比较复杂，除食盐的成分外，还有多种氨基酸、糖类、有机酸、色素及香料民分。以咸味为主，亦有鲜味、香味等。它能增加和改善菜肴的口味，还能增添或改变菜肴的色泽。'
      }
    },
    {
      id: 196,
      name: '食盐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、杀菌：盐水有杀菌、保鲜防腐作用。用来清洗创伤可以防止感染，撒在食物上可以短期保鲜，用来腌制食物还能防变质。\\n2、调味道：食盐调味，能多项式发腻提鲜，祛除腥膻之味，使食物保持原料的本味。\\n3、促进皮肤的新陈代谢：用盐调水能清除皮肤表面的角质和污垢，使皮肤呈现出一种鲜嫩、透明的靓丽之感可以促进全身皮肤的新陈代谢，防治某些皮肤病，起到较好的自我保健作用。',
        简介:
          '盐是指一类金属离子或铵根离子（NH4+）与酸根离子或非金属离子结合的化合物。如氯化钠，硝酸钙，硫酸亚铁和乙酸铵等，如硫酸钙，氯化铜，醋酸钠，一般来说盐是复分解反应的生成物，盐与盐反应生成新盐与新盐，盐与碱反应生成新盐与新碱，盐与酸反应生成新盐与新酸，如硫酸与氢氧化钠生成硫酸钠和水，氯化钠与硝酸银反应生成氯化银与硝酸钠等。也有其他的反应可生成盐，例如置换反应。可溶性盐的溶液有导电性，是因为溶液中有可自由游动的离子，故此可作为电解质。盐酸既是盐化工的重要产品，又是生产硅材料的重要原料。它是晶体的一种。',
        营养价值:
          '食盐主要成分为氯化钠氯化钠的性质：白色晶体，易溶于水。溶解度随温度变化不大。味咸可食用（实验中有掺加碘酸钾）。颜色反应为黄色（钠离子的物理性质）。他的水溶液能与硝酸银溶液反应生成白色不容于稀硝酸的沉淀，（氯离子的化学性质）常温下大多为固体，在水中溶解性不同'
      }
    },
    {
      id: 197,
      name: '植物油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '具有润肠、养颜护肤的功效。植物油中的脂肪酸能使皮肤滋润有光泽。',
        简介:
          '植物油是由脂肪酸和甘油化合而成的化合物，广泛分布于自然界中。 从植物的果实、种子、胚芽中得到的油脂称为植物油。如花生油、豆油、亚麻油、蓖麻油、菜子油等。植物油的主要成分是直链高级脂肪酸和甘油生成的酯,脂肪酸除软脂酸、硬脂酸和油酸外,还含有多种不饱和酸，如芥酸、桐油酸、蓖麻油酸等。',
        营养价值:
          '植物油的主要成分是直链高级脂肪酸和甘油生成的酯，脂肪酸除软脂酸、硬脂酸和油酸外，还含有多种不饱和酸，如芥酸、桐油酸、蓖麻油酸等。植物油主要含有维生素E、K、钙、铁、磷、钾等矿物质、脂肪酸等。植物油中的脂肪酸能使皮肤滋润有光泽。'
      }
    },
    {
      id: 200,
      name: '马蹄',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进生长发育：能促进人体生长发育和维持生理功能的需要，对牙齿骨骼的发育有很大好处。\\n2、降血压：对降低血压有一定效果，还对癌肿有防治作用。\\n3、整肠通便：有润肺化痰，生津作用。所含的淀粉及粗蛋白能促进大肠蠕动，所含的粗脂肪增加了润肠通便的作用。\\n4、消热解毒：荸荠是寒性食物，有清热泻火的良好功效。',
        简介:
          '莎草科荸荠属浅水性宿根草本，以球茎作蔬菜食用。古称凫茈（凫茈），俗称马蹄，又称地栗，因它形如马蹄，又像栗子而得名。称它马蹄，仅指其外表；说它像栗子，不仅是形状，连性味、成分、功用都与栗子相似，又因它是在泥中结果，所以有地栗之称。荸荠皮色紫黑，肉质洁白，味甜多汁，清脆可口，自古有地下雪梨之美誉，北方人视之为江南人参。荸荠既可作为水果，又可算作蔬菜，是大众喜爱的时令之品。',
        营养价值:
          '1、马蹄中的磷含量是所有茎类蔬菜中含量最高的，磷元素可以促进人体发育，同时可以促进体内的糖、脂肪、蛋白质三大物质的代谢，调节酸碱平衡。\\n2、马蹄虽含大量的淀粉，但热量比白米饭低，以100公克荸荠(十颗)为例，大约是四分之一碗白米饭的量。其富含水分，亦含多种维生素A、B2、C和矿物质钙、磷、镁等。\\n3、马蹄也是“含钾大户”，每100克马蹄含有450毫克的钾，相当于水蜜桃的4倍、冬瓜的3倍，有助于生津止渴、利尿排淋，对降低血压有一定效果。\\n4、马蹄的肉质鲜嫩多津，可治疗热病津伤口渴之症，对糖尿病尿多者，有一定的辅助治疗作用。'
      }
    },
    {
      id: 201,
      name: '面包糠',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、提供能量：面包糠能量丰富，可以为机体提供足够的能量。\\n2、开胃：面包糠口感香脆，令人食指大动，有开胃的作用。',
        简介:
          '面包糠是一种广泛使用的食品添加附料,用于油炸食品表面,如:炸鸡肉、鱼肉、海产品(虾)、鸡腿、鸡翅、洋葱圈等。其味香酥脆软、可口鲜美、营养丰富。',
        营养价值:
          '面包糠中含有蛋白质、脂肪、碳水化合物、少量维生素及钙、镁、钾、锌等矿物质,易于消化、吸收,面包糠它一般用于油炸及油煎食品,其主要作用是起到缓解食品被炸焦的时间;由于其本身的特性,能起到外表焦(酥)香的效果特别适合营养不良的儿童青少年。\\n'
      }
    },
    {
      id: 203,
      name: '鸭子',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、益气补虚：其肉性味甘、寒，入肺胃肾经，有大补虚劳、滋五脏之阴、清虚劳之热、补血行水、养胃生津、止咳自惊、消螺蛳积、清热健脾、虚弱浮肿等功效;治身体虚弱、病后体虚、营养不良性水肿。\\n2、滋阴：入药以老而白、白而骨乌者为佳。用老而肥大之鸭同海参炖食，具有很大的滋补功效，炖出的鸭汁，善补五脏之阴和虚痨之热。',
        简介:
          '又名鹜肉、家凫肉。\\n鸭是为餐桌上的上乘肴馔，也是人们进补的优良食品。鸭肉的营养价值与鸡肉相仿。但在中医看来，鸭子吃的食物多为水生物，故其肉性昧甘、寒，入肺胃肾经，有滋补、养胃、补肾、除痨热骨蒸、消水肿、止热痢、止咳化痰等作用。凡体内有热的人适宜食鸭肉，体质虚弱，食欲不振，发热，大便干燥和水肿的人食之更为有益。',
        营养价值:
          '鸭肉中的脂肪酸熔点低，易于消化。所含B族维生素和维生素E较其他肉类多，能有效抵抗脚气病，神经炎和多种炎症，还能抗衰老。鸭肉中含有较为丰富的烟酸，它是构成人体内两种重要辅酶的成分之一，对心肌梗死等心脏疾病患者有保护作用。\\n'
      }
    },
    {
      id: 204,
      name: '五香粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '健脾温中、消炎利尿。',
        简介:
          '所谓五香粉是将超过5种的香料研磨成粉状混合一起，常使用在煎、炸前涂抹在鸡、鸭肉类上，也可与细盐混合做沾料之用。广泛用于东方料理的辛辣口味的菜肴，尤其适合用于烘烤或快炒肉类、炖、焖、煨、蒸、煮菜肴作调味。其名称来自于中国文化对酸、甜、苦、辣、咸五味要求的平衡。',
        营养价值:
          '五香粉汇集了各种原料的优点，气味芳香，具辛温之性，有健脾温中、消炎利尿等功效，对提高机体抵抗力有一定帮助。'
      }
    },
    {
      id: 205,
      name: '大茴',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 206,
      name: '黄酒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、含有丰富氨基酸：黄酒的主要成分除乙醇和水外，还含有18种氨基酸，其中有8种是人体自身不能合成而又必需的。\\n2、易于消化：黄酒含有许多易被人体消化的营养物质。\\n3、舒筋活血：冬天温饮黄酒，可活血祛寒、通经活络，有效抵御寒冷刺激，预防感冒。适量常饮有助于血液循环，促进新陈代谢，并可补血养颜。\\n4、美容抗衰老：黄酒是B族维生素的良好来源，长期饮用有利于美容、抗衰老。\\n5、促进食欲：锌是能量代谢及蛋白质合成的重要成分，缺锌时，食欲、味觉都会减退，性功能也下降。而黄酒中锌含量不少，饮用黄酒有促进食欲的作用。\\n6、保护心脏：黄酒内含多种微量元素。在心血管疾病中，这些微量元素均有防止血压升高和血栓形成的作用。\\n7、理想的药引子:，黄酒酒精度适中，是较为理想的药引子。此外，黄酒还是中药膏、丹、丸、散的重要辅助原料。\\n8、增鲜去腥：黄酒的另一功能是调料。黄酒酒精含量适中，味香浓郁，富含氨基酸等呈味物质，人们都喜欢用黄酒作佐料，在烹制荤菜时，特别是羊肉、鲜鱼时加入少许，不仅可以去腥膻还能增加鲜美的风味。',
        简介:
          '黄酒是世界上最古老的酒类之一，源于中国，且唯中国有之，与啤酒、葡萄酒并称世界三大古酒。约在三千多年前，商周时代，中国人独创酒曲复式发酵法，开始大量酿制黄酒。黄酒产地较广，品种很多，著名的有绍兴加饭酒、福建老酒、江西九江封缸酒、江苏丹阳封缸酒、无锡惠泉酒、广东珍珠红酒、山东即墨老酒等。',
        营养价值:
          '黄酒是一类以稻米、黍米、玉米、小米、小麦等为主要原料，采用蒸煮、加酒曲、糖化、发酵、压榨、过滤、煎酒、贮存、勾兑而成的酿造酒。\\n黄酒含有多酚、类黑精、谷胱甘肽等生理活性成分，具有清除自由基，预防心血管病、抗癌、抗衰老等生理功能。\\n黄酒中已检出的无机盐达18 种，包括钙、镁、钾、磷、铁、锌、等。黄酒中的维生素B、E 的含量也很丰富，主要来自原料和酵母自溶物。\\n黄酒中的蛋白质含量为酒中之最，每升绍兴加饭酒的蛋白质含量达 16g ，是啤酒的4 倍。黄酒中的蛋白质多以肽和氨基酸的形态存在，易被人体吸收。肽具有营养功能、生物学功能和调节功能。绍兴产黄酒中的氨基酸达21 种之多，且含8 种人体必需氨基酸。每升加饭酒中的必需氨基酸达3400mg ，而啤酒和葡萄酒中的必需氨基酸仅为440mg 或更少。\\n黄酒含丰富的功能性低聚糖，如每升绍兴加饭酒中的异麦芽低聚糖、潘糖、异麦芽三糖含量达 6g。这些低聚糖是在酿造过程中，物料经微生物酶的作用而产生的。功能性低聚糖进入人体后，几乎不被人体吸收、不产生热量，但可促进肠道内有益微生物双歧杆菌的生长发育，可改善肠道功能、增强免疫力、促进人体健康。'
      }
    },
    {
      id: 208,
      name: '糯米',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、滋补佳品：有补虚、补血、健脾暖胃、止汗等作用。\\n2、缓解脾胃虚寒：适用于脾胃虚寒所致的反胃、食欲减少、泄泻和气虚引起的汗虚、气短无力、妊娠腹坠胀等症。\\n3、缓解尿频症状：糯米有收涩作用，对尿频、自汗有较好的食疗效果。',
        简介:
          '糯米又叫江米，是家常经常食用的粮食之一。因其香糯粘滑，常被用以制成风味小吃，深受大家喜爱。逢年过节很多地方都有吃年糕的习俗。正月十五的元宵也是由糯米粉制成的。',
        营养价值:
          '1. 糯米含有蛋白质、脂肪、糖类、钙、磷、铁、维生素B1、维生索B2、烟酸及淀粉等，营养丰富，为温补强壮食品，具有补中益气，健脾养胃，止虚汗之功效，对脾胃虚寒，食欲不佳，腹胀腹泻有一定缓解作用；\\n2. 糯米有收涩作用，对尿频，盗汗有较好的食疗效果。'
      }
    },
    {
      id: 209,
      name: '肉末',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效，主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴、润肌肤、利小便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介: '将动物肉切成的细末。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 210,
      name: '中筋面粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '具有养心、益肾、除热、止渴 主治脏躁、烦热、消渴、泄痢、痈肿、外伤出血及烫伤等功效。',
        简介:
          '中筋面粉即普通面粉。蛋白质含量平均在11%左右，中筋粉多用在中式点心制作上，如包子、馒头、饺子等。大部分中式点心都是以中筋粉来制作的。',
        营养价值:
          '面粉富含蛋白质、碳水化合物、维生素和钙、铁、磷、钾、镁等矿物质，有养心益肾、健脾厚肠、除热止渴的功效。'
      }
    },
    {
      id: 211,
      name: '水',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 213,
      name: '米饭',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '有补中益气、健脾养胃、益精强志、和五脏、通血脉、聪耳明目、止烦、止渴、止泻的功效。',
        简介:
          '米是五谷之首，米饭更是人们日常饮食中的主角之一；一味米饭，与五味调配，几乎可以供给全身所需营养。',
        营养价值:
          '米饭的主要成分是碳水化合物，维持大脑功能必须的能源。还很有丰富的B族维生素和铜，铜是人体健康不可缺少的微量营养素，对于血液、中枢神经和免疫系统，头发、皮肤和骨骼组织以及脑子和肝、心等内脏的发育和功能有重要影响。'
      }
    },
    {
      id: 214,
      name: '大虾',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增强人体免疫力：虾的营养价值极高，能增强人体的免疫力和性功能，补肾壮阳，抗早衰，可医治肾虚阳痿、畏寒、体倦、腰膝酸痛等病症。\\n2、通乳汁：如果妇女产后乳汁少或无乳汁，鲜虾肉500克，研碎，黄酒热服，每日3次，连服几日，可起催乳作用。\\n3、缓解神经衰弱：虾皮有镇静作用，常用来治疗神经衰弱，植物神经功能紊乱诸症。海虾是可以为大脑提供营养的美味食品。海虾中含有三种重要的脂肪酸，能使人长时间保持精力集中。\\n4、有利于病后恢复：虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物。\\n5、预防动脉硬化：虾中含有丰富的镁，镁对心脏活动具有重要的调节作用，能很好的保护心血管系统，它可减少血液中胆固醇含量，防止动脉硬化，同时还能扩张冠状动脉，有利于预防高血压及心肌梗死。\\n6、消除“时差症”：日本大阪大学的科学家最近发现，虾体内的虾青素有助于消除因时差反应而产生的“时差症”。',
        简介:
          '虾介绍 虾，甲壳亚门(Crustacea)十足目(Decapoda)游泳亚目(Natantia)动物。近2,000种。与蟹、螯虾、蝲蛄、海螯虾、蝉虾和龙虾近缘。我国海域宽广、江河湖泊众多，盛产海虾和淡水虾。海虾是口味鲜美、营养丰富、可制多种佳肴的海味，有菜中之"甘草"的美称。海虾有对虾、明虾、基围虾、琵琶虾、龙虾等；淡水虾有青虾、河虾、草虾、小龙虾等；还有半咸水虾如白虾等。不管何种虾，都含有丰富的蛋白质，营养价值很高，其肉质和鱼一样松软，易消化，但又无腥味和骨刺，同时含有丰富的矿物质（如钙、磷、铁等），海虾还富含碘质，对人类的健康极有裨益。根据科学的分，虾可食部分蛋白质占16～20％左右。',
        营养价值:
          '1、虾中含有20%的蛋白质，是蛋白质含量很高的食品之一，是鱼、蛋、奶的几倍甚至十几倍，虾和鱼肉相比，所含的人体必需氨基酸缬氨酸并不高，但却是营养均衡的蛋白质来源，另外，虾类含有甘氨酸，这种氨基酸的含量越高，虾的甜味就越高。\\n2、虾和鱼肉禽肉相比，脂肪含量少，并且几乎不含作为能量来源的动物糖质，虾中的胆固醇含量较高，同时含有丰富的能降低人体血清胆固醇的牛磺酸，虾含有丰富的钾、碘、镁、磷等微量元素和维生素A等成分。\\n'
      }
    },
    {
      id: 215,
      name: '海参',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、调整机体免疫力：常吃海参的人很少感冒，因海参中所含的丰富的蛋白质、是人体免疫功能所必须的物质，能预防疾病感染，调整机体的免疫力，对感冒等传染性疾病有很好的预防功能。\\n2、滋阴养血：海参中具有构成男性精子细胞的主要成分，且具有调节性激素的功能，而海参又恰恰是“大富翁”，对治疗肾虚有特殊功效。另外，海参中的磷、锌、锰、硒、镍等元素都对人体多种生理活动，尤其对生殖功能作用突出，对促进性功能的提高很有帮助。\\n3、延缓衰老：海参中富含合成人体胶原蛋白的主要原料，含有长寿因子、抗老因子。具有延年益寿、消除疲劳、防治皮肤衰老、美容等功效。\\n4、抗癌护心脏：海参中所含的硒、海参皂苷等能抑制癌细胞的生长与转移,具有明显的抗癌作用。做化疗的人需要经常食用海参。',
        简介:
          '海参，属海参纲（Holothurioidea），是生活在海边至8000米的海洋软体动物，据今已有六亿多年的历史，海参以海底藻类和浮游生物为食。 海参全身长满肉刺，广布于世界各海洋中。我国南海沿岸种类较多，约有二十余种海参可供食用，海参同人参、燕窝、鱼翅齐名，是世界八大珍品之一。海参不仅是珍贵的食品，也是名贵的药材。',
        营养价值:
          '1、海参含有较丰富的蛋白质，较少的脂肪和胆固醇。\\n2、海参号称“精氨酸大富翁”。含有8种人体自身不能合成的必需氨基酸，其中精氨酸、赖氨酸含量最为丰富。\\n3、参含有丰富的微量元素，尤其是钙、钒、钠、硒、镁含量较高。海参所含的微量元素钒居各种食物之首，可以参与血液中铁的运输，增强造血能力。\\n4、含有特殊的活性营养物质，海参酸性粘多糖，海参皂甙（海参素、海参毒素），海参脂质，海参胶蛋白，牛磺酸等。\\n'
      }
    },
    {
      id: 216,
      name: '冬笋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、止血凉血：冬笋含有大量胶质，生成血小板，有止血功效。\\n2、通便：具有润滑肠道的功效，达到刺激排便的作用。\\n3、养肝：冬笋富含维生素，保护肝细胞和防止毒素对肝细胞的损害。\\n4、消食：冬笋有助于胃酸的分泌和食物的消化，宜于治疗饮食积滞证。\\n5、健脾：适用于脾气虚弱，运化无力所致的脘腹胀满，大便溏泄，食欲不振，肢倦乏力等症。\\n6、清热解毒：冬笋具有清热化痰、解渴除烦、清热益气等功效',
        简介:
          '冬笋是竹笋的一种，是竹的嫩芽，质量好的冬笋呈枣核形即两头小中间大，驼背鳞片，略带茸毛，皮黄白色，肉淡白色。冬笋素有“金衣白玉，蔬中一绝”之美誉。',
        营养价值:
          '冬笋是一种富有营养价值并具有医药功能的美味食品,质嫩味鲜,清脆爽口,含有蛋白质和多种氨基酸、维生素,以及钙、磷、铁等微量元素以及丰富的纤维素，能促进肠道蠕动，既有助于消化，有能预防便秘和结肠癌的发生。冬笋是一种高蛋白、低淀粉食品，对肥胖症、冠心病、高血压、糖尿病和动脉硬化等患者有一定的食疗作用。它所含的多糖物质，还具有一定的抗癌作用。冬笋含有较多草酸钙，患尿道结石、肾炎的人不宜多食。\\n'
      }
    },
    {
      id: 217,
      name: '豌豆',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、美容：豌豆含有丰富的维生素A原，维生素A原可在体内转化为维生素A，具有润泽皮肤的作用。\\n2、增强机体免疫功能：豌豆中富含人体所需的各种营养物质，尤其是含有优质蛋白质，可以提高机体的抗病能力和康复能力。\\n3、防癌治癌：豌豆花和豌豆荚中富含胡萝卜素，食用后可防止人体致癌物质的合成，从而减少癌细胞的形成，降低人体癌症的发病率。\\n4、通利大肠：豌豆中富含粗纤维，能促进大肠蠕动，保持大便通畅，起到清洁大肠的作用。',
        简介:
          '豌豆既可作蔬菜炒食，子实成熟后又可磨成豌豆面粉食用。因豌豆豆粒圆润鲜绿，十分好看，也常被用来作为配菜，以增加菜肴的色彩，促进食欲',
        营养价值:
          '在豌豆荚和豆苗的嫩叶中富含维生素C和能分解体内亚硝胺的酶，可以分解亚硝胺，具有抗癌防癌的作用。豌豆与一般蔬菜有所不同，所含的止杈酸、赤霉素和植物凝素等物质，具有抗菌消炎，增强新陈代谢的功能。在荷兰豆和豆苗中含有较为丰富的膳食纤维，可以防止便秘，有清肠作用。'
      }
    },
    {
      id: 219,
      name: '猪腿肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 220,
      name: '粗地瓜粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 221,
      name: '水淀粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '具有补中和血、益气生津、宽肠胃、通便秘的功效。',
        简介:
          '勾芡用的淀粉,又叫做团粉,是由多个葡萄糖分子缩合而成的多糖聚合物.烹调用的淀粉,主要有绿豆淀粉、马铃薯淀粉、麦类淀粉、菱角淀粉、藕淀粉、玉米淀粉等.淀粉不溶于水,在和水加热至60℃左右时（淀粉种类不同,糊化温度不一样）,则糊化成胶体溶液.勾芡就是利用淀粉的这种特性. ',
        营养价值:
          '由于用芡粉所做的浆、粉、糊、汁、芡的处理，还可起到保护层的作用，既防止营养成分的流失或被破坏，也可避免动物蛋白接触高温焦糊而产生的不利健康的物质。'
      }
    },
    {
      id: 223,
      name: '公蟹 母蟹',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 225,
      name: '鸭血',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、人体“清道夫”：鸭血还能较好地清除人体内的粉尘和有害金属微粒对人体的损害，堪称人体污物的“清道夫”。\\n2、止血凝血：鸭血含有维生素Ｋ，能促使血液凝固，因此有止血作用。\\n3、病后调养：鸭血还能为人体提供多种微量元素，对营养不良、肾脏疾患、心血管疾病的病后的调养都有益处，可用于治疗头晕目眩、吐血衄血、崩漏血晕、损伤出血以及惊厥癫痫等症。',
        简介:
          '为家鸭的血液。以取鲜血为好。味咸，性寒。能补血、解毒。用于失血血虚，或小儿白痢似鱼冻者，可以取鲜血趁热饮，或冲入热酒服。',
        营养价值:
          '1. 动物血中含铁量较高，而且以血红素铁的形式存在，容易被人体吸收利用。处于生长发育阶段的儿童和孕妇或哺乳期妇女多吃些有动物血的菜肴，可以防治缺铁性贫血，并能有效地预防中老年人患冠心病、动脉硬化等症。 \\n2. 动物血具有利肠通便作用，可以清除肠腔的沉渣浊垢，对尘埃及金属微粒等有害物质具有净化作用，以避免积累性中毒。因此它是人体污物的“清道夫”。 \\n3. 动物血含有维生素Ｋ，能促使血液凝固，因此有止血作用。 \\n4. 动物血还能为人体提供多种微量元素，对营养不良、肾脏疾患、心血管疾病的病后的调养都有益处。可用于治疗头晕目眩、吐血衄血、崩漏血晕、损伤出血以及惊厥癫痫等症。'
      }
    },
    {
      id: 226,
      name: '粉丝',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、粉丝中含有蛋白质、磷脂等，这些具有兴奋神经、增进食欲的作用，可以为机体提供日常所必需的营养。\\n2、粉丝中含有一种球蛋白和多糖，能够促进动物性胆固醇在肝脏内分解为胆酸，加快胆汁中胆盐的分泌并且降低小肠对胆固醇的吸收。\\n3、粉丝内还含有丰富的胰蛋白抑制剂，可以起到保护肝脏、减少蛋白分解的作用，从而可以有效保护我们的肾脏。',
        简介:
          '粉丝品种繁多，如绿豆粉丝、蚕豆粉丝，更多的是淀粉制的粉丝。如红薯粉丝，土豆粉丝等。粉条与粉丝的原料和制作工艺相同，只是\\n粉条更粗一些，比较耐煮，更适合炖食。',
        营养价值:
          '粉丝具有很好的附味性，将它和其他的食材搭配在一起稍煮的时候，可以吸收汤汁内鲜美的味道，再加上粉丝本身吃起来就柔润嫩滑，所以口感非常不错。粉丝里面主要含有碳水化合物、膳食纤维、蛋白质、烟酸、钙、镁、铁、钾、磷等矿物质元素。'
      }
    },
    {
      id: 227,
      name: '油豆腐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗血栓：制作大豆中含有的皂苷，清除体内自由基，具有显著的抗癌活性，具有抑制肿瘤细胞的生长，抑制血小板聚集，抗血栓的功效。\\n2、牛奶的替代品：豆腐的营养价值与牛奶相近，对因乳糖不耐症而不能喝牛乳，或为了控制慢性病不吃肉禽类的人而言，豆腐是最好的代替品。\\n3、更年期的“保护神”：有效的预防骨质疏松、乳腺癌和前列腺的发生。\\n4、预防心血管疾病：豆腐健脑的同时，还能抑制胆固醇的摄入。大豆蛋白显著降低血浆胆固醇、甘油三酯和低密度脂蛋白，不仅可以预防结肠癌，还有助于预防心脑血管疾病。\\n5、降低乳腺癌的几率：制作豆腐的大豆中含有大豆异黄酮，可调整乳腺对雌激素的反应，日本妇女尿中的异黄酮浓度为美国、荷兰妇女的100~1000倍，这与日本人常食大豆有关，也是日本相与欧美国家相比乳腺癌发生率较低的一个原因。此外，还可以有效的预防白血病，结肠癌，肺癌，胃癌等的发生。\\n6、有益于大脑的生长发育',
        简介:
          '油豆腐是豆腐的炸制食品，其色泽金黄，内如丝肉，细致绵空，富有弹性。系经磨浆、压坯、油炸等多道工序制作而成。既可作蒸、炒、炖之主菜，又可为各种肉食的配料，是荤宴素席兼用的佳品。',
        营养价值:
          '油豆腐富含优质蛋白、多种氨基酸、不饱和脂肪酸及磷脂等，铁、钙的含量也很高。\\n'
      }
    },
    {
      id: 228,
      name: '熟鸭肫',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 229,
      name: '鸭肠',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、对人体新陈代谢，神经、心脏、消化和视觉的维护都有良好的作用。\\n2、鸭肠富含蛋白质、B族维生素、维生素C、维生素A和钙、铁等微量元素。\\n3、提高免疫力',
        简介:
          '鸭肠是鸭的内脏之一，是很多菜肴都会用到的食材。可卤、可炒、可炖、可烫火锅。味道鲜美，香脆可口。对消化和视觉的维护都有良好的作用。',
        营养价值:
          '鸭肠富含蛋白质、B族维生素、维生素C、维生素A和钙、铁等微量元素，对人体新陈代谢，神经、心脏、消化和视觉的维护都有良好的作用。\\n鸭肠中的脂肪酸熔点低，易于消化，所含B族维生素和维生素E较其他肉类多，能有效抵抗脚气病，神经炎和多种炎症，还能抗衰老。\\n鸭肠中含有较为丰富的烟酸，它是构成人体内两种重要辅酶的成分之一，对心肌梗死等心脏疾病患者有保护作用。\\n鸭肠适用于体内有热、上火的人食用；发低热、体质虚弱、食欲不振、大便干燥和水肿的人，食之更佳。\\n同时适宜营养不良，产后病后体虚、盗汗、遗精、妇女月经少、咽干口渴者食用；还适宜癌症患者及放疗化疗后，糖尿病，肝硬化腹水，肺结核，慢性肾炎浮肿者食用。'
      }
    },
    {
      id: 230,
      name: '鸭边腿',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 232,
      name: '紫薯',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、防癌抗癌：紫薯富含硒和铁是人体抗疲劳、抗衰老、补血的必要元素，也可预防胃癌、肝癌等癌病的发生。\\n2、促进胃肠蠕动：紫薯富含纤维素，保持大便畅通，改善消化道环境，防止胃肠道疾病的发生。\\n3、有利于减肥瘦身：吃紫薯能够减肥、健美、防止亚健康、通便排毒。\\n4、增强免疫力：紫薯含有大量黏液蛋白，提高机体免疫力，预防胶原病发生。所含的钙和镁，可以预防骨质疏松症。',
        简介:
          '紫薯，又叫黑薯，薯肉呈紫色至深紫色。它除了具有普通红薯的营养成分外，还富含硒元素和花青素。',
        营养价值:
          '紫薯中含有丰富的蛋白质，18种易被人体消化和吸收的氨基酸，维生素C、B、A等8种维生素和磷、铁等10多种天然矿物质元素。其中铁和硒含量丰富。而硒和铁是人体抗疲劳、抗衰老、补血的必要元素，特别是硒被称为“抗癌大王”，易被人体吸收，可留在血清中，修补心肌，增强机体免疫力，清除体内自由基，抑制癌细胞中DNA的合成和癌细胞的分裂与生长，预防胃癌、肝癌等癌病的发生。紫薯富含纤维素，可增加粪便体积，促进肠胃蠕动，清理肠腔内滞留的粘液、积气和腐败物，排出粪便中的有毒物质和致癌物质，保持大便畅通，改善消化道环境，防止胃肠道疾病的发生。\\n紫薯含有大量药用价值高的花青素，法国科学家马斯魁勒博士发现花青素是天然强效自由基清除剂。花青素对100多种疾病有预防和治疗作用，被誉为继水、蛋白质、脂肪、碳水化合物、维生素、矿物质之后的第七大必需营养素。花青素是目前发现的防治疾病、维护人类健康最直接、最有效、最安全的自由基清除剂，其清除自由基的能力是维生素C的20倍、维生素E的50倍。花青素具有小分子结构，是惟一能透过血脑屏障清除自由基保护大脑细胞的物质，同时能减少抗生素给人体带来的危害。\\n'
      }
    },
    {
      id: 233,
      name: '白芝麻',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、防治皮肤炎症：可使皮肤白皙润泽，并能防治各种皮肤炎症。\\n2、养血护肤：可以治疗皮肤干枯、粗糙、令皮肤细腻光滑、红润光泽。\\n3、滋补养生：补班、养发、生津、通乳、润肠。\\n4、通便：润肠通便，对肠液减少引起的便秘，单独应用即有效验。\\n5、促进骨骼发育：经常食用对骨骼、牙齿的发育都大有益处。\\n6、延年益寿：可强壮身体、益寿延年、滋补肝肾、润养脾肺。\\n7.预防高血压：芝麻中人体必需脂肪酸含量很高，预防高血压的效果很好。\\n8.护发：助消化、维护皮肤、头发健康',
        简介:
          '白芝麻为胡麻科胡麻属植物脂麻的种子。白芝麻具有含油量高、色泽洁白、籽粒饱满、种皮薄、口感好、后味香醇等优良品质。白芝麻及其制品具有丰富的营养性和抗衰老性。',
        营养价值:
          '1. 芝麻含有大量的脂肪和蛋白质，还有膳食纤维、维生素B1.B2.尼克酸、维生素E、卵磷脂、钙、铁、镁等营养成分； 芝麻中的亚油酸有调节胆固醇的作用。\\n2. 芝麻中含有丰富的维生素E，能防止过氧化脂质对皮肤的危害，抵消或中和细胞内有害物质游离基的积聚，可使皮肤白皙润泽，并能防止各种皮肤炎症。\\n3. 芝麻还具有养血的功效，可以治疗皮肤干枯、粗糙、令皮肤细腻光滑、红润光泽。'
      }
    },
    {
      id: 235,
      name: '肉糜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉馅是指把猪肉去除皮肉和骨头，取净猪肉，再剁成肉蓉而成。根据选取猪肉部位的不同，猪肉末可分为纯瘦肉末、肥瘦肉末和肥肉末3种。纯瘦肉末系选用猪腿肉或臀尖肉加工制作而成；肥瘦肉末是选用五花肉加工而成；肥肉末是用肥膘肉配以少许瘦肉加工制作而成。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 236,
      name: '西兰花',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗癌：菜花中含有“索弗拉芬”能刺激细胞制造对机体有益的保护酶—Ⅱ型酶。这种具有非常强的抗癌活性酶，可使细胞形成对抗外来致癌物侵蚀的膜，对防止多种癌症起到积极的作用。\\n2、血管清理：西兰花是含有类黄酮最多的食物之一，类黄酮除了可以防止感染，还是最好的血管清理剂，能够阻止胆固醇氧化，防止血小板凝结，因而减少心脏病与中风的危险。\\n3、清热解渴：菜花的营养较一般蔬菜丰富。它含有蛋白质、脂肪、碳水化合物、食物纤维、维生素A、B、C、E、P、U和钙、磷、铁等矿物质。用菜花30克煎汤，频频饮服，不仅有清热解渴，利尿通便之功效，而且还有爽喉、开音、润肺、止咳的功效。\\n4、加强血管壁：有些人皮肤一旦受到小小的碰撞和伤害就会变得青一块紫一块的，这是因为体内缺乏维生素K的缘故。补充的最佳途径就是多吃西兰花，从而使血管壁加强，使血管不容易受伤破裂。\\n5、增强机体抵抗：常吃菜花可增强肝脏解毒能力并能提高机体的免疫力，可预防感冒和坏血病的发生。\\n6、有效预防关节炎：西兰花等十字花科蔬菜中富含的一种化合物(萝卜硫素)可有效预防最常见的一类关节炎，并减缓关节炎导致的软骨损伤等。这种被称作萝卜硫素的化合物会遏制一种可引发关节炎症的酶发挥作用，从而减缓软骨损伤并缓解关节疼痛。',
        简介:
          '花椰菜（学名：Brassica oleracea L. var. botrytis L.），又称花菜、菜花、椰菜花，是一种蔬菜。花椰菜，西兰花（青花菜）和结球甘蓝同为甘蓝的变种。',
        营养价值:
          '西兰花中含有蛋白质、碳水化合物、脂肪、矿物质、维生素C和胡萝卜素等。此外，西兰花中钙、磷、铁、钾、锌、锰等的含量都很丰富，它的矿物质成分比其他蔬菜更全面。\\n具体而言，西兰花的营养价值如下：\\n1、西兰花中所含的维生素K能维护血管的韧性，不易破裂。\\n2、西兰花中维生素C的含量极高，不仅有利于人的生长发育，也能提高人体免疫功能，促进肝脏解毒。维生素C还具有很强的清除自由基作用，尤其对致癌物--亚硝酸胺的形成有明显的阻断作用。\\n3、西兰花中提取的一种酶能预防癌症。\\n4、西兰花中含有大量的硒。硒具有抗癌、抗老化、增强免疫力、促进儿童生长发育的功能，同时还有助于预防高血压、心脏病等成人病。\\n5、西兰花中含有二硫酚硫酮，可降低形成黑色素的酶及阻止皮肤色素斑的形成，经常食用对肌肤有很好的美白效果。\\n6、西兰花中所含的黄酮类化合物可以减少心血管疾病的发生。\\n7、西兰花中还含有多种吲哚衍生物，这些化合物有降低人体内雌激素水平的作用，可预防乳腺癌的发生。\\n8、西兰花含有丰富的抗坏血酸，能增强肝脏的解毒能力，提高机体免疫力。'
      }
    },
    {
      id: 237,
      name: '食用油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、油的传热作用，使菜肴呈现出鲜嫩或酥脆的特点。\\n2、改善菜肴的色泽，油脂可以使菜肴呈现出各种不同的色泽。\\n3、增加营养成分，在烹调过程中，由于脂肪渗透至原料的组织内部，不仅改善了菜肴的风味，并且补充了某些低脂肪菜肴的营养成分，从而提高了菜肴的热量，即营养价值。',
        简介:
          '食用油也称为“食油”，是指在制作食品过程中使用的，动物或者植物油脂。常温下为液态。 由于原料来源、加工工艺以及品质等原因，常见的食用油多为植物油脂，包括粟米油、花生油、火麻油、玉米油、橄榄油、山茶油、棕榈油、芥花子油、葵花子油、大豆油、芝麻油、亚麻籽油（胡麻油）、葡萄籽油、核桃油、牡丹籽油等等。',
        营养价值:
          '食用油是人们生活的必需品，是提供人体热能和必需脂肪酸、促进脂溶性维生素吸收的重要食物。衡量油脂的营养价值有两个指数，一是不饱和脂肪酸的含量；二是必需脂肪酸的含量。植物油所含这两种脂肪酸，一般要比动物油高。对于中老年人以及心血管病患者来说，要少吃动物油，以植物油为主，有利于身体健康。对于正在生长发育的青少年来说，则不必过分限制动物油。一般情况下，食用动、植物油以3∶7的用量标准较为适宜。'
      }
    },
    {
      id: 239,
      name: '九节虾',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 240,
      name: '桂皮',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、具有温肾助阳，引火归原，散寒止痛，温经通脉的功效。\\n2、主治肾阳不足，畏寒肢冷，腰检酸软，阳痿遗精，宫冷不孕，小便不利或尿频、遗尿，短气喘促，浮肿尿少。\\n3、脘腹冷痛，食少便溏；命门火衰，火不归原，上热下寒，面赤足冷，头晕耳鸣，口舌糜烂。\\n4、虚寒腰痛，寒湿痹痛，寒疝，痛经经闭，产后瘀滞腹痛，阴疽流注，痈疡脓成不溃，或后溃后不敛。',
        简介:
          '桂皮，学名：柴桂，又称：肉桂、官桂或香桂，为樟科、樟属植物天竺桂、阴香、细叶香桂、肉桂或川桂等树皮的通称。本品为常用中药，又为食品香料或烹饪调料。商品桂皮的原植物比较复杂，约有十余种，均为樟科樟属植物。各地常用的有8种，其中主要有桂树、钝叶桂、阴香及华南桂等其他种类多为地区用药。各品种在西方古代被用作香料。中餐里用它给炖肉调味，是五香粉的成份之一。是最早被人类使用的香料之一。在公元前2800年的史料记载中就曾提到桂皮；在西方的《圣经》和古埃及文献中也曾提及肉桂的名称。秦代以前，桂皮在中国就已作为肉类的调味品与生姜齐名。桂皮，广东民间叫“阴香”属樟科肉桂之一种。中国广东、福建、浙江、四川等省均产。用作芳香调味品，此外还可提取桂皮油，为食品工业之重要香料，亦入药。桂皮，又称肉桂、官桂或香桂，是最早被人类使用的香料之一。',
        营养价值:
          '1、桂皮香气馥郁，可使肉类菜肴祛腥解腻，令人食欲大增。\\n2、菜肴中适量添加桂皮，有助于预防或延缓因年老而引起的Ⅱ型糖尿病。\\n3、桂皮中含苯丙烯酸类化合物，对前列腺增生有治疗作用。\\n'
      }
    },
    {
      id: 242,
      name: '莲藕',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、清热凉血：莲藕生用性寒，有清热凉血作用，可用来治疗热性病症；莲藕对热病口渴、衄血、咯血、下血者尤为有益。\\n2、通便止泻、健脾开胃：莲藕散发出一种独特清香，还含有鞣质，有一定健脾止泻作用，能增进食欲，促进消化，开胃健中。\\n3、益血生肌：有明显的补益气血，增强人体免疫力作用。故中医称其：“主补中养神，益气力”。\\n4、止血散瘀：藕含有大量的单宁酸，有收缩血管作用，可用来止血。藕还能凉血，散血。',
        简介:
          '藕是莲藕的地下茎的膨大部分，莲藕属睡莲科。莲藕主要分布于长江流域和南方各省、秋、冬及春初均可采挖。\\n藕呈短圆柱形，外皮粗厚，光滑为灰白色或银灰色，内部白色；节部中央膨大，内有大小不同的孔道若干条，排列左右对称；体较重，质脆嫩，在我国食用栽培的莲藕，可分为两大类：第一类为藕用种。其根茎较肥大，外皮白色，肉质脆嫩，味甜，产量高，结莲子不多；第二类为莲用种，莲较小，肉质稍带灰色，品质较差，但结果多，主要采收莲子。\\n作为蔬菜食用以藕用种为主。莲藕，微甜而脆，十分爽口，可生食也可做菜，而且药用价值相当高，是老幼妇孺、体弱多病者上好的食品和滋补佳珍。',
        营养价值:
          '莲藕的物质含量丰富，因此营养价值也高。研究证明，每100克莲藕中含有：水分77.9克、蛋白质1.0克、脂防0.1克、碳水化合物19.8克、热量84千卡、粗纤维0.5克、灰分0.7克、钙19毫克、磷51毫克、铁0.5毫克、胡萝卜素0.02毫克、硫胺素0.11毫克、核黄素0.04毫克、尼克酸0.4毫克、抗坏血酸25毫克。\\n莲藕含有淀粉、蛋白质、天门冬素、维生素C以及氧化酶成分，含糖量也很高，生吃鲜藕能清热解烦，解渴止呕；如将鲜藕压榨取汁，其功效更甚，煮熟的藕性味甘温，能健脾开胃，益血补心，故主补五脏，有消食、止渴、生肌的功效。\\n莲藕富含的维生素C和粗纤维既能帮助消化、防止便秘，又能供给人体需要的碳水化合物和微量元素，防止动脉硬化，改善血液循环，有益于身体健康。\\n在块茎类食物中，莲藕含铁量较高，故对缺铁性贫血的病人颇为适宜。莲藕的含糖量不算很高，又含有大量的维生素C和食物纤维，对于肝病、便秘、糖尿病等一切有虚弱之症的人都十分有益。'
      }
    },
    {
      id: 243,
      name: '油菜心',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 244,
      name: '枸杞',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、明目：擅长明目，所以俗称“明眼子”。历代医家治疗肝血不足、肾阴亏虚引起的视物昏花和夜盲症，常常使用枸杞子，著名方剂杞菊地黄丸,就以枸杞子为主要药物。民间也习用枸杞子治疗慢性眼病，枸杞蒸蛋就是简便有效的食疗方。\\n2、提高机体免疫力：枸杞有提高机体免疫力的作用，可以补气强精、滋补肝肾、抗衰老、止消渴、暖身体、抗肿瘤的功效。\\n3、降三高：调节血糖，降低血压，防治高血压、心脏病、动脉硬化等症。\\n4.枸杞子还有兴奋大脑神经、兴奋呼吸、促进胃肠蠕动等作用。',
        简介:
          '枸杞是茄科枸杞属的多分枝灌木植物，高0.5-1米，栽培时可达2米多。国内外均有分布。枸杞全身是宝，明李时珍《本草纲目》记载：“春采枸杞叶，名天精草；夏采花，名长生草；秋采子，名枸杞子；冬采根，名地骨皮”。枸杞嫩叶亦称枸杞头，可食用或作枸杞茶。现代研究，枸杞子有降低血糖、 抗脂肪肝作用，并能抗动脉粥样硬化。此外，枸杞还可用园林作绿篱栽植、树桩盆栽以及用作水土保持的灌木等。',
        营养价值:
          '杞子含有丰富的胡萝卜素、维生素A1、B1、B2、C以及钙、铁等健康眼睛的必需营养，所以俗称“明眼子”。历代医家治疗肝血不足、肾阴亏虚引起的视物昏花和夜盲症，常常使用枸杞子。著名方剂杞菊地黄丸，就以枸杞子为主要药物。民间也习用枸杞子治疗慢性眼病，枸杞蒸蛋就是简便有效的食疗方。\\n枸杞子色素是存在于枸杞浆果中的各类呈色物质的总称，是枸杞子的重要生理活性成分。主要包括β-胡萝卜素、少量的叶黄素及其他有色物质。枸杞子色素具有提高人体免疫功能、防止肿瘤形成及预防动脉粥样硬化等作用。枸杞有提高机体免疫力的作用，可以补气强精，滋补肝肾、抗衰老、止消渴、暖身体、抗肿瘤的功效。'
      }
    },
    {
      id: 245,
      name: '葱姜水',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 246,
      name: '白胡椒粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '温中下气、消痰解毒。',
        简介:
          '白胡椒，为胡椒科植物胡椒的干燥近成熟的果实。性状：表面黄白色或淡黄白色，平滑，顶端与基部间有多数浅色线状条纹。气味芳香，是人们喜爱的调味品之一。辛，温。温中散寒，下气，消痰；主产于广东、广西及云南等地，表面黄白色或淡黄白色，平滑，顶端与基部间有多数浅色线状条纹。其药用价值比黑胡椒稍高一些。',
        营养价值:
          '1. 胡椒的主要成分是胡椒碱，也含有一定量的芳香油、粗蛋白、粗脂肪及可溶性氮，能祛腥、解油腻，助消化；\\n2. 胡椒的气味能增进食欲；\\n3. 胡椒性温热，对胃寒所致的胃腹冷痛、肠鸣腹泻有很好的缓解作用，并治疗风寒感冒；'
      }
    },
    {
      id: 247,
      name: '香油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、延缓衰老：香油中含丰富的维生素E，具有促进细胞分裂和延缓衰老的功能。 　　\\n2、保护血管：香油中含有40%左右的亚油酸、棕榈酸等不饱和脂肪酸，容易被人体分解 吸收和利用，以促进胆固醇的代谢，并有助于消除动脉血管壁上的沉积物。 　　\\n3、润肠通便：习惯性便秘患者，早晚空腹喝一口香油，能润肠通便。 　　\\n4、减轻烟酒毒害：有抽烟习惯和嗜酒的人经常喝点香油，可以减轻烟对牙齿、牙龈、口腔黏膜的直接刺激和损伤，以及肺部烟斑的形成，同时对尼古丁的吸收也有相对的抑制作用。饮酒之前喝点香油，则对口腔、食道、胃贲门和胃黏膜起到一定的保护作用。 　　\\n5、保护嗓子：常喝香油能增强声带弹性，使声门张合灵活有力，对声音嘶哑、慢性咽喉炎有良好的恢复作用。\\n8、治疗鼻炎：慢性鼻炎患者，用消毒棉球蘸取香油涂于鼻腔患处，一次见效，两次症状全。 　　香油长期食用，抵抗力下降，身体冰凉，易引起消化道功能紊乱。\\n',
        简介:
          '芝麻油简称麻油，俗称香油，是以芝麻为原料加工制取的食用植物油，属半干性油，是消费者喜爱的调味品。',
        营养价值:
          '芝麻榨成油不但具有浓郁的香气，可促进食欲，更有利于招牌营养素的吸。其中含量近70%的维生素E具有优异的抗氧化作用，可以保肝护心，延缓衰老。\\n从芝麻中榨出香油中所含的卵磷脂都是益寿延年抗衰老的上佳成分，是中老年人最好的冬令补品。\\n香油是一种促凝血药，用于治疗血小板减少性紫癜和出血性素质有一定效果。'
      }
    },
    {
      id: 250,
      name: '嫩豆腐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、更年期的“保护神”：有效的预防骨质疏松、乳腺癌和前列腺的发生。\\n2、预防心血管疾病：豆腐健脑的同时，还有助于预防心脑血管疾病。\\n3、降低乳腺癌的几率：制作豆腐的大豆中含有大豆异黄酮，可调整乳腺对雌激素的反应。\\n4、补益清热养生：豆腐为补益清热养生食品，可补中益气、清热润燥、生津止渴、清洁肠胃。',
        简介:
          '豆腐是我国炼丹家——淮南王刘安发明的绿色健康食品。时至今日，已有二千一百多年的历史，深受我国人民、周边各国、及世界人民的喜爱。发展至今，已品种齐全，花样繁多，俱有风味独特，制作工艺简单食用方便的特点。有高蛋白，低脂肪，降血压，降血脂，降胆固醇的功效。是生熟皆可，老幼皆宜，养生摄生、益寿延年的美食佳品。安徽省淮南市——刘安故里，每年9月15日，有一年一度的豆腐文化节。深究者，可详阅《淮南子》及淮南地方志。理学家——朱熹有《素食诗》传世。 \\n豆腐是一种以黄豆为主要原料的食物，本身没有什么味道，但是含有高蛋白质，可以被做成各式各样的菜肴。它起源于中国，拥有美观、营养价值高、产品种类丰富等特点。',
        营养价值:
          '1.豆腐营养丰富，含有铁、钙、磷、镁等人体必需的多种微量元素，还含有糖类、植物油和丰富的优质蛋白，素有“植物肉”之美称。大豆的蛋白质生物学价值可与鱼肉相媲美，是植物蛋白中的佼佼者。大豆蛋白属于完全蛋白质，其氨基酸组成比较好，人体所必需的氨基酸它几乎都有。大豆可以直接烹调食用，人体对其蛋白质的消化吸收率只有65%，而制成豆腐消化率可以提升到92%~95%。\\n2.制作豆腐的大豆中含有18%左右的油脂，大部分能转移到豆腐中去。大豆油中的亚油酸比例较大，且不含胆固醇，有益于人体神经、血管、大脑的生长发育。\\n3.豆腐不含胆固醇，为高血压、高血脂、高胆固醇症及动脉硬化、冠心病患者的药膳佳肴。\\n4.豆腐含有丰富的植物雌激素，对防治骨质疏松症有良好的作用。'
      }
    },
    {
      id: 252,
      name: '芦笋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗癌之王：芦笋中含有丰富的抗癌元素之王—硒，阻止癌细胞分裂与生长，抑制致癌物的活力并加速解毒，甚至使癌细胞发生逆转，刺激机体免疫功能，促进抗体的形成，提高对癌的抵抗力，对膀胱癌、肺癌、皮肤癌等有特殊疗效，并且几乎对所有的癌症都有一定的疗效。\\n2、清热利尿：对于易上火、患有高血压的人群来说，芦笋能清热利尿，多食好处极多。\\n3、促进胎儿大脑发育：对于怀孕的产妇来说，芦笋叶酸含量较多，经常食用芦笋有助于胎儿大脑发育。',
        简介:
          '芦笋是世界十大名菜之一，又名石刁柏。在国际市场上享有“蔬菜之王”的美称，芦笋富含多种氨基酸、蛋白质和维生素，其含量均高于一般水果和蔬菜，特别是芦笋中的天冬酰胺和微量元素硒、钼、铬、锰等，具有调节机体代谢，提高身体免疫力的功效，在对高血压、心脏病、白血病、血癌、水肿、膀胱炎等的预防和治疗中，具有很强的抑制作用和药理效应。',
        营养价值:
          '芦笋有鲜美芳香的风味，膳食纤维柔软可口，能增进食欲，帮助消化。在西方，芦笋被誉为“十大名菜之一”，是一种高档而名贵的蔬菜、\\n现代营养学分析，芦笋蛋白质组成具有人体所必需的各种氨基酸，含量比例恰当，无机盐元素中有较多的硒、钼、镁、锰等微量元素，还含有大量以天门冬酰胺为主体的非蛋白质含氮物质和天门冬氮酸。\\n经常食用对心脏病、高血压、心率过速、疲劳症、水肿、膀胱炎、排尿困难等病症有一定的疗效。同时芦笋对心血管病、血管硬化、肾炎、胆结石、肝功能障碍和肥胖均有益。\\n同时芦笋所含多种维生素和微量元素的质量优于普通蔬菜。营养学家和素食界人士均认为它是健康食品和全面的抗癌食品。用芦笋治淋巴腺癌、膀胱癌、肺癌肾结石和皮肤癌有极好的疗效。对其它癌症、白血症等，也有很好效果。\\n国际癌症病友协会研究认为，芦笋可以使细胞生长正常化，具有防止癌细胞扩散的功能。辅助治疗肿瘤疾患时应保证每天食用才能有效。'
      }
    },
    {
      id: 253,
      name: '黄彩椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、预防心血管疾病：可改善黑斑及雀斑，还有消暑、补血、消除疲劳、预防感冒和促进血液循环等功效，能够使血液中的良好胆固醇增加，使血管强健，使血液循环转为良好，改善动脉硬化以及各种的心血管疾病。\\n2、促进新陈代谢：其中的椒类碱能够促进脂肪的新陈代谢，防止体内脂肪积存，从而减肥防病。\\n3、抗老化：红甜椒所具有的强大抗氧化作用，可抗白内障、心脏病和癌症，防止身体老化，并且使体内的细胞活化，有著非常明显的效果。',
        简介:
          '五彩椒又名朝天椒、五彩辣椒，是辣椒的变种，为茄科多年生半木质性植物，但常作一年生栽培。株高30-60厘米，茎直立，常呈半木质化，分枝多，单叶互生。花单生叶腋或簇生枝梢顶端，花白色，形小不显眼。花期5月初到7月底。果实簇生于枝端。同一株果实可有红、黄、紫、白等各种颜色，有光泽，盆栽观赏很逗人喜爱。也可以食用，风味同青椒一样。',
        营养价值:
          '甜椒中含有很丰富的维生素A、B、C，β胡萝卜素，糖类、纤维质、钙、磷、铁能增强免疫力，对抗自由基的破坏，保护视力，还可以使皮肤白皙亮丽。经常食用可以强化指甲和滋养发根，对于肌肤有活化细胞组织功能，促进新陈代谢，使皮肤光滑柔嫩，具有美容的功效。可以预防微血管的脆弱出血、牙龈出血、眼睛视网膜出血、脑血管出血，也是糖尿病患者较宜食用的食物。\\n'
      }
    },
    {
      id: 255,
      name: '河虾',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增强人体免疫力：虾的营养价值极高，能增强人体的免疫力和性功能，补肾壮阳，抗早衰，可医治肾虚阳痿、畏寒、体倦、腰膝酸痛等病症。\\n2、通乳汁：如果妇女产后乳汁少或无乳汁，鲜虾肉500克，研碎，黄酒热服，每日3次，连服几日，可起催乳作用。\\n3、缓解神经衰弱：虾皮有镇静作用，常用来治疗神经衰弱，植物神经功能紊乱诸症。海虾是可以为大脑提供营养的美味食品。海虾中含有三种重要的脂肪酸，能使人长时间保持精力集中。\\n4、有利于病后恢复：虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物。\\n5、预防动脉硬化：虾中含有丰富的镁，镁对心脏活动具有重要的调节作用，能很好的保护心血管系统，它可减少血液中胆固醇含量，防止动脉硬化，同时还能扩张冠状动脉，有利于预防高血压及心肌梗死。\\n6、消除“时差症”：日本大阪大学的科学家最近发现，虾体内的虾青素有助于消除因时差反应而产生的“时差症”。',
        简介:
          '河虾广泛分布于我国江河、湖泊、水库和池塘中的河虾（又称青虾，学名叫日本沼虾（Macrobranchium nipponense）），是优质的淡水虾类。它肉质细嫩，味道鲜美，营养丰富，是高蛋白低脂肪的水产食品，颇得消费者青睐。',
        营养价值:
          '1.虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物。\\n2.虾中含有丰富的镁，镁对心脏活动具有重要的调节作用，能很好的保护心血管系统，它可减少血液中胆固醇含量，防止动脉硬化，同时还能扩张冠状动脉，有利于预防高血压及心肌梗死。\\n3.虾的通乳作用较强，并且富含磷、钙、对小儿、孕妇尤有补益功效。\\n4.虾体内很重要的一种物质就是虾青素，就是表面红颜色的成分，虾青素是目前发现的最强的一种抗氧化剂，颜色越深说明虾青素含量越高。'
      }
    },
    {
      id: 256,
      name: '龙井茶',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 257,
      name: '开水',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 258,
      name: '干淀粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效: '具有补中和血、益气生津、宽肠胃、通便秘的功效。',
        简介:
          '勾芡用的淀粉,又叫做团粉,是由多个葡萄糖分子缩合而成的多糖聚合物.烹调用的淀粉,主要有绿豆淀粉、马铃薯淀粉、麦类淀粉、菱角淀粉、藕淀粉、玉米淀粉等.淀粉不溶于水,在和水加热至60℃左右时（淀粉种类不同,糊化温度不一样）,则糊化成胶体溶液.勾芡就是利用淀粉的这种特性. ',
        营养价值:
          '由于用芡粉所做的浆、粉、糊、汁、芡的处理，还可起到保护层的作用，既防止营养成分的流失或被破坏，也可避免动物蛋白接触高温焦糊而产生的不利健康的物质。'
      }
    },
    {
      id: 260,
      name: '广味香肠',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 261,
      name: '海苔',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、具有抗衰老、降血脂、抗肿瘤等多方面的生物活性。\\n2、促进骨骼，牙齿的生长。可以帮助人体维持机体的酸碱平衡。\\n3、能清热、化痰、延缓衰老，保持皮肤的润滑健康。能有效预防神经老化，调节机体的新陈代谢。\\n4、可促进淋巴细胞转化，提高机体的免疫力;可显著降低进血清胆固醇的总含量。',
        简介:
          '海苔：紫菜烤熟之后质地脆嫩，入口即化，特别是经过调味处理之后，添加了油脂、盐和其他调料，就摇身变成了特别美味的“海苔”了。海苔浓缩了紫菜当中的各种B族维生素，特别是核黄素和尼克酸的含量十分丰富，还有不少维生素A和维生素E，以及少量的维生素C。海苔中含有15%左右的矿物质，其中有维持正常生理功能所必需的钾、钙、镁、磷、铁、锌、铜、锰等，其中含硒和碘尤其丰富，这些矿物质可以帮助人体维持机体的酸碱平衡，有利于儿童的生长发育，对老年人延缓衰老也有帮助。',
        营养价值:
          '海苔浓缩了紫菜当中的各种B族维生素，特别是核黄素和尼克酸的含量十分丰富，还有不少维生素A和维生素E，以及少量的维生素C。海苔中含有15%左右的矿物质，其中有维持正常生理功能所必需的钾、钙、镁、磷、铁、锌、铜、锰等，其中含硒和碘尤其丰富，这些矿物质可以帮助人体维持机体的酸碱平衡，有利于儿童的生长发育，对老年人延缓衰老也有帮助。'
      }
    },
    {
      id: 263,
      name: '带皮猪五花肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 264,
      name: '绍酒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 266,
      name: '菠菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、通肠导便、防治痔疮：菠菜含有大量的植物粗纤维，具有促进肠道蠕动的作用，利于排便，且能促进胰腺分泌，帮助消化。对于痔疮、慢性胰腺炎、便秘、肛裂等病症有治疗作用。\\n2、促进生长发育、增强抗病能力：菠菜中所含的胡萝卜素，在人体内转变成维生素A，能维护正常视力和上皮细胞的健康，增加预防传染病的能力，促进儿童生长发育。\\n3、保障营养、增进健康：菠菜中含有丰富的胡萝卜素、维生素C、钙、磷及一定量的铁、维生素E等有益成分，能供给人体多种营养物质；其所含铁质，对缺铁性贫血有较好的辅助治疗作用。\\n4、促进人体新陈代谢：菠菜中所含微量元素物质，能促进人体新陈代谢，增进身体健康。大量食用菠菜，可降低中风的危险；',
        简介:
          '菠菜，藜科菠菜属一年生或二年生草本 。又称菠薐 、波斯草。以叶片及嫩茎供食用。原产波斯，2000年前已有栽培。后传到北非，由摩尔人传到西欧西班牙等国。菠菜647年传入唐朝。菠菜主根发达，肉质根红色，味甜可食。菠菜属耐寒性蔬菜，长日照植物。中国北方也有冬季播种 、来春收获的 ，俗称埋头菠菜。条播或撒播均可。菠菜的主要病害有霜霉病、病毒病、炭疽病，主要虫害有蚜虫、潜叶蝇等。',
        营养价值:
          '菠菜含有丰富的维他命A、维他命C及矿物质，尤其维他命A、维他命C含量是所有蔬菜类之冠，人体造血物质铁的含量也比其它蔬菜为多，对于胃肠障碍、便秘、痛风、皮肤病、各种神经疾病、贫血确有特殊食疗效果。对解酒毒及防止齿槽脓漏现象亦具有食疗神效。\\n菠菜中含有大量的β胡萝卜素和铁，也是维生素B6、叶酸、铁和钾的极佳来源。其中丰富的铁对缺铁性贫血有改善作用，能令人面色红润，光彩照人，因此被推崇为养颜佳品。菠菜叶中含有铬和一种类胰岛素样物质，其作用与胰岛素非常相似，能使血糖保持稳定。丰富的B族维生素含量使其能够防止口角炎、夜盲症等维生素缺乏症的发生。\\n菠菜中含有大量的抗氧化剂如维生素E和硒元素，具有抗衰老、促进细胞增殖作用，既能激活大脑功能，又可增强青春活力，有助于防止大脑的老化，防止老年痴呆症。哈佛大学的一项研究还发现，每周食用2～4次菠菜的中老年人，因摄入了维生素A和胡萝卜素，可降低患视网膜退化的危险，从而保护视力。'
      }
    },
    {
      id: 267,
      name: '红美人椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、解热、镇痛：辣椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、预防癌症：辣椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、增加食欲、帮且消化：辣椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、降脂减肥：辣椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '美人椒有红与绿两种颜色，肉质紧密厚实，外形细长，长约20cm，外表颜色鲜艳而又光泽。美人椒味道辛辣，一般不能当做普通蔬菜食用。适合，腌渍呈泡辣椒，或入菜用于调味。',
        营养价值:
          '辣椒具有很高的营养价值。它除含有丰富的蛋白质、碳水化合物、钙、磷、铁，还含有极为丰富的维生素C。每100克辣椒中维生素C的含量高达100至198毫克，位居瓜菜类食物之首。其中含钙最多者每百克可达75毫克，含铁量达 3．2毫克。\\n'
      }
    },
    {
      id: 269,
      name: '荷兰豆',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、提高机体免疫力：提高机体的抗病能力和康复能力。\\n2、防癌抗癌：防止人体致癌物质的合成，从而减少癌细胞的合成，预防癌症的发生。\\n3、抗菌消炎：具有抗菌消炎，增强新陈代谢的功效。\\n4、利肠通便：可以促进胃肠蠕动，防止便秘，益脾和胃，生津止渴，起到清肠利尿的作用。',
        简介:
          '荷兰豆又称荷仁豆、剪豆，属豆科(Leguminosae)豌豆属。以食用嫩荚为主，原产地中海沿岸及亚洲西部，荷兰豆嫩荚质脆清香，营养价值很高。',
        营养价值:
          '在荷兰豆荚和豆苗的嫩叶中富含维生素C和能分解体内亚硝胺的酶，可以分解亚硝胺，具有抗癌防癌的作用。荷兰豆与一般蔬菜有所不同，所含的止杈酸、赤霉素和植物凝素等物质，具有抗菌消炎，增强新陈代谢的功能。在荷兰豆和豆苗中含有较为丰富的膳食纤维，可以防止便秘，有清肠作用。'
      }
    },
    {
      id: 270,
      name: '蒜头',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 272,
      name: '蛤蜊',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、能滋阴生津，软坚散结，利小便。\\n2、用于肝肾阴虚，烦热盗汗，消渴；瘿瘤、瘰疬、痞块；水肿，小便不利。',
        简介:
          '蛤又叫蛤蜊，有花蛤、文蛤、西施舌等诸多品种。其肉质鲜美无比，被称为“天下第一鲜”、“百味之冠”，江苏民间还有“吃了蛤蜊肉，百味都失灵”之说。蛤蜊的营养特点是高蛋白、高微量元素、高铁、高钙、少脂肪。许多贝类也具上述特点。蛤蜊不仅味道鲜美，而且它的营养也比较全面，实属物美价廉的海产品。它含有蛋白质、脂肪、碳水化合物、铁、钙、磷、碘、维生素、氨基酸和牛磺酸等多种成分，是一种低热能、高蛋白，能防治中老年人慢性病的理想食品。',
        营养价值:
          '1、蛤肉含糖类，蛋白质，脂肪，菸酸，无机盐，维生素A、B1、B2。蛤壳含碳酸钙、磷酸钙、矽酸镁、碘及溴盐等。\\n2、蛤蜊的钙质含量，在海鲜中颇为凸出。以100公克重的蛤蜊为例，钙质含量就有130毫克，虽然不能跟奶制品相提并论，但也算是不错的钙质源。\\n3、蛤蜊的维生素B12含量也很丰富。B12关系到血液代谢，缺乏者可能出现恶性贫血，尤其是胃部手术后的患者，B12吸收率较差，可以多摄取一些蛤蜊。\\n4、蛤蜊里的牛磺酸，可以帮助胆汁合成，有助于胆固醇代谢，还能维持神经细胞膜的电位平衡，能抗痉挛、抑制焦虑。\\n5、由于蛤蜊脂肪含量不高，每100公克的热量只有55大卡，属于低脂肉类。对于想控制体重的人，蛤蜊是很不错的选择。以一份60公克重的蛤蜊，大蛤蜊大约6个，一般大小的蛤蜊约为22个，吃起来颇有饱足感，热量却只有40大卡左右。\\n'
      }
    },
    {
      id: 274,
      name: '西红柿',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、减缓色斑延缓衰老：补充番茄红素，抵抗衰老，增强免疫系统，减少疾病的发生。番茄红素还能降低眼睛黄斑的退化、减少色斑沉着。\\n2、抗癌：番茄红素能够有效预防前列腺癌、消化道癌、肝癌、肺癌、乳腺癌、膀胱癌、子宫癌、皮肤癌等。\\n3、降脂降压：降低血压经常发生牙龈出血或皮下出血的患者，吃番茄有助于改善症状。\\n4、防止血栓的发生：患冠心病及中风的病人每天适量饮用番茄汁有益于病的康复。\\n5、健胃消食：有助消化、润肠通便作用，可防治便秘。',
        简介:
          '番茄(tomato)别名西红柿、洋柿子，古名六月柿、喜报三元。果实营养丰富，具特殊风味。可以生食、煮食、加工制成番茄酱、汁或整果罐藏。番茄是全世界栽培最为普遍的果菜之一。 美国、苏联、意大利和中国为主要生产国。在欧、美洲的国家、中国和日本有大面积温室、塑料大棚及其他保护地设施栽培。中国各地普遍种植。栽培面积仍在继续扩大。',
        营养价值:
          '番茄含有对心血管具有保护作用的维生素和矿物质元素，能减少心脏病的发作。\\n番茄红素具有独特的抗氧化能力，能清除自由基，保护细胞，使脱氧核糖核酸及基因免遭破坏，能阻止癌变进程。西红柿除了对前列腺癌有预防作用外，还能有效减少胰腺癌、直肠癌、喉癌、口腔癌、肺癌、乳腺癌等癌症的发病危险。\\n番茄中的维C，有生津止渴，健胃消食，凉血平肝，清热解毒，降低血压之功效，对高血压、肾脏病人有良好的辅助治疗作用。多吃番茄具有抗衰老作用，使皮肤保持白皙。\\n尼克酸能维持胃液的正常分泌，促进红血球的形成，有利于保持血管壁的弹性和保护皮肤。所以食用西红柿对防治动脉硬化、高血压和冠心病也有帮助。西红柿多汁，可以利尿，肾炎病人也宜食用。\\n经常发生牙龈出血或皮下出血的患者，吃番茄有助于改善症状。\\n番茄所含的苹果酸或柠檬酸，有助于胃液对脂肪及蛋白质的消化。\\n'
      }
    },
    {
      id: 276,
      name: '春笋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、化痰止咳：对咽喉部有良好的湿润和物理治疗作用。\\n2、消食：春笋有助于胃酸的分泌和食物的消化，宜于治疗饮食积滞证。\\n3、补血益气：适宜肤色没有光华，失去红润、手脚冰冷的人群。\\n4、明目：春笋中含有丰富的维生素A，维生素A对眼睛的发育有十分重要的作用。\\n5、健脾：春笋适用于脾气虚弱，运化无力所致的脘腹胀满，大便溏泄，食欲不振，肢倦乏力等症。\\n6、养颜护肤：春笋含有胡萝卜素，有助于维持皮肤细胞组织正常机能，刺激皮肤新陈代谢，保持皮肤润泽细嫩。',
        简介:
          '别名笋，为多年生常绿草本植物，食用部分为初生、嫩肥、短壮的芽或鞭。竹原产中国，类型众多，适应性强，分布极广。毛竹、早竹等散生型竹种的地下茎入土较深，竹鞭和笋芽借土层保护，冬季不易受冻害，出笋期主要在春季。竹笋一年四季皆有，但惟有春笋、冬笋味道最佳。烹调时无论是凉拌、煎炒还是熬汤，均鲜嫩清香，是人们喜欢的佳肴之一。',
        营养价值:
          '春笋味道清淡鲜嫩，营养丰富。含有充足的水分、丰富的植物蛋白以及钙、磷、铁等人体必需的营养成分和微量元素，特别是纤维素含量很高，常食有帮助消化、防止便秘的功能。所以春笋是高蛋白、低脂肪、低淀粉、多粗纤维素的营养美食。'
      }
    },
    {
      id: 277,
      name: '油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、油的传热作用，使菜肴呈现出鲜嫩或酥脆的特点。\\n2、改善菜肴的色泽，油脂可以使菜肴呈现出各种不同的色泽。\\n3、增加营养成分，在烹调过程中，由于脂肪渗透至原料的组织内部，不仅改善了菜肴的风味，并且补充了某些低脂肪菜肴的营养成分，从而提高了菜肴的热量，即营养价值。',
        简介:
          '食用油也称为“食油”，是指在制作食品过程中使用的，动物或者植物油脂。常温下为液态。 由于原料来源、加工工艺以及品质等原因，常见的食用油多为植物油脂，包括粟米油、花生油、火麻油、玉米油、橄榄油、山茶油、棕榈油、芥花子油、葵花子油、大豆油、芝麻油、亚麻籽油（胡麻油）、葡萄籽油、核桃油、牡丹籽油等等。',
        营养价值:
          '食用油是人们生活的必需品，是提供人体热能和必需脂肪酸、促进脂溶性维生素吸收的重要食物。衡量油脂的营养价值有两个指数，一是不饱和脂肪酸的含量；二是必需脂肪酸的含量。植物油所含这两种脂肪酸，一般要比动物油高。对于中老年人以及心血管病患者来说，要少吃动物油，以植物油为主，有利于身体健康。对于正在生长发育的青少年来说，则不必过分限制动物油。一般情况下，食用动、植物油以3∶7的用量标准较为适宜。'
      }
    },
    {
      id: 278,
      name: '鲜酱油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲：烹调食品时加入一定量的酱油，可增加食物的香味，并可使其色泽更加好看，从而增进食欲。\\n2、防癌：酱油的主要原料是大豆，大豆及其制品因富含硒等矿物质而有防癌的效果。\\n3、降低胆固醇：酱油含有多种维生素和矿物质，可降低人体胆固醇，降低心血管疾病的发病率，并能减少自由基对人体的损害。\\n4、止痒消肿：酱油可用于水、火烫伤和蜂、蚊等虫的蜇伤，并能止痒消肿。',
        简介:
          '酱油，用豆、麦、麸皮酿造的液体调味品。色泽红褐色，有独特酱香，滋味鲜美，有助于促进食欲。是中国的传统调味品。酱油俗称豉油，主要由大豆、淀粉、小麦、食盐经过制油、发酵等程序酿制而成的。酱油的成分比较复杂，除食盐的成分外，还有多种氨基酸、糖类、有机酸、色素及香料等成分。以咸味为主，亦有鲜味、香味等。它能增加和改善菜肴的味道，还能增添或改变菜肴的色泽。我国人民在数千年前就已经掌握酿制工艺了。酱油一般有老抽和生抽两种：生抽较咸，用于提鲜；老抽较淡，用于提色。',
        营养价值:
          '酱油中的氨基酸是人体所需的主要营养物质，尤其是酱油中含有一些人体不能合成的氨基酸，总量多达17种，还含有B族维生素和安全无毒的棕红色素。 酱油主要由大豆，淀粉、小麦、食盐经过制油、发酵等程序酿制而成的。酱油的成分比较复杂，除食盐的成分外，还有多种氨基酸、糖类、有机酸、色素及香料民分。以咸味为主，亦有鲜味、香味等。它能增加和改善菜肴的口味，还能增添或改变菜肴的色泽。'
      }
    },
    {
      id: 280,
      name: '大米',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '大米可提供丰富B族维生素；大米具有补中益气、健脾养胃、益精强志、和五脏、通血脉、聪耳明目、止烦、止渴、止泻的功效；米粥具有补脾、和胃、清肺功效。',
        简介:
          '大厦米是中国人的主食之一，由稻子的子实脱壳而成。稻米中氨基酸的组成比较完全，蛋白质主要是米精蛋白，易于消化吸收，无论是家庭用餐还是去餐馆，米饭都是必不可少的。\\n大米按照品种类型分为籼米、粳米和糯米三类',
        营养价值:
          '大米中各种营养素含量虽不是很高，但因人们食用量大，故其也具有很高营养功效，是补充营养素的基础食物；米粥具有补脾、和胃、清肺功效。\\n'
      }
    },
    {
      id: 284,
      name: '鱼头',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、鱼头具有营养高、口味好、富含人体必需的卵磷脂和不饱和脂肪酸。\\n2、对降低血脂、健脑及延缓衰老有好处，有助于增强男性性功能。\\n3、对降低血脂、健脑及延缓衰老有好处。',
        简介:
          '鱼头介绍头营养高、口味好、是解放男性性压抑，提高男性性生活质量的一系列自慰用品，并对降低血脂、健脑及延缓衰老有好处。',
        营养价值:
          '1、鱼头肉质细嫩、营养丰富，除了含蛋白质、脂肪、钙、磷、铁、维生素B1，它还含有鱼肉中所缺乏的卵磷脂，该物质被机体代谢后能分解出胆碱，最后合成乙酰胆碱，乙酰胆碱是神经元之间化学物质传送信息的一种最重要的“神经递质”，可增强记忆、思维和分析能力，让人变得聪明； \\n2、鱼头还含丰富的不饱和脂肪酸，它对脑的发育尤为重要，可使大脑细胞异常活跃，故使推理、判断力极大增强，因此，常吃鱼头不仅可以健脑，而且还可延缓脑力衰退； \\n3、鱼鳃下边的肉呈透明的胶状，里面富含胶原蛋白，能够对抗人体老化及修补身体细胞组织。'
      }
    },
    {
      id: 285,
      name: '剁椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、保护心脏：辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇；\\n2、防癌抗癌：辣椒含有较多抗氧化物质，可预防癌症及其他慢性疾病；\\n3、开胃消食：吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲、增加饭量；\\n4、暖胃驱寒、止痛散热：辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状；\\n5、肌肤美容、降脂减肥：辣椒含有一种特殊物质，能加速新陈代谢天谢地达到燃烧体内脂肪的效果，从而起到减肥作用；这种物质还可以促进荷尔蒙分泌，对皮肤有很好的美容保健作用，是女性的“补品”。',
        简介:
          '剁椒又名剁辣子、坛子辣椒、七姊妹剁椒、七星椒剁椒，是以红鲜七姊妹辣椒、食盐等为原料制成的一种可以直接食用的辣椒制品，味辣而鲜咸，口感偏重，剁辣椒是湖南的特色食品，可出坛即食，也可当作佐料做菜。 一般来说，正宗湖南剁辣椒水分少，颜色暗红，口感不酸。只有在湘西，尤其是湘西南一带的剁辣椒，才带有当地特色的酸味，因为湘西人既“无辣不欢”，又“无酸不入口”。因此当地的剁辣椒为“酸剁辣椒”。剁椒是湖南、湖北、四川等地爱吃的一种用辣椒腌制成的咸菜，可直接食用，也可加工成菜品等。可以用灯笼椒（菜辣椒）或朝天椒已成熟变红的辣椒为原料制作，湖南主要盛产的一种小米椒，小米椒就是七姊妹辣椒（也叫小朝天椒），剁碎了以后加盐、大蒜、生姜拌匀，放大缸里腌一段时间，就成了色香味俱全、生物保鲜、不含防腐剂的纯天然绿色食品。',
        营养价值:
          '辣椒具有很高的营养价值。它除含有丰富的蛋白质、碳水化合物、钙、磷、铁，还含有极为丰富的维生素C。每100克辣椒中维生素C的含量高达100至198毫克，位居瓜菜类食物之首。其中含钙最多者每百克可达75毫克，含铁量达 3．2毫克。\\n'
      }
    },
    {
      id: 287,
      name: '包菜',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、杀菌：新鲜的圆白菜有杀菌、消炎的作用。咽喉疼痛、外伤肿痛、胃痛、牙痛时，可以将圆白菜榨汁后饮下或涂于患处。\\n2、增强机体免疫功能：它能提高人体免疫力，预防感冒。\\n3、防癌抗癌：保护癌症患者的生活指标，在抗癌蔬菜中，圆白菜排在第5位，相当显赫。\\n4、促进消化：多吃圆白菜，可增进食欲，促进消化预防便秘。圆白菜也是糖尿病和肥胖患者的理想食物。',
        简介:
          '结球甘蓝（Brassica oleracea L.var.capitata L.）是十字花科、芸苔属的植物，为甘蓝（Brassica oleracea L.）的变种。又名卷心菜、洋白菜、疙瘩白、包菜、圆白菜、包心菜、莲花白等。二年生草本，被粉霜。矮且粗壮一年生茎肉质，不分枝，绿色或灰绿色。基生叶多数，质厚，层层包裹成球状体，扁球形，直径10-30厘米或更大，乳白色或淡绿色；起源于地中海沿岸，16世纪开始传入中国。甘蓝具的耐寒、抗病、适应性强、易贮耐运、产量高、品质好等特点，在中国各地普遍栽培，是中国东北、西北、华北等地区春、夏、秋季的主要蔬菜之一。',
        营养价值:
          '1、包菜中含有丰富的维生素C、维生素E以及β-胡萝卜素等等的人体所需的元素，一份包菜的维生素含量要远远比一份西红柿的含量要高出3倍，因此平常适量的食用是有利于人体抗氧化作用和抗衰老，保青春的作用。\\n2、包菜中的含有丰富的异硫氰酸丙酯衍生体，是能够有效的杀死导致人体白血病发生的异常细胞。如果食用新鲜包菜，能够有效还可以帮助治疗人体伤口发炎、消毒作用。　如果食用新鲜包菜，能够有效还可以帮助治疗人体伤口发炎、消毒作用。\\n3、包菜中还含有大量的萝卜硫素，这种元素是有助于产生对身体有利的酶，从而形成能有效抵抗致癌物侵蚀的保护膜。常吃包菜还可以助消化、健脾胃的功能。'
      }
    },
    {
      id: 288,
      name: '蒜粒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 289,
      name: '味极鲜酱油',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增进食欲：烹调食品时加入一定量的酱油，可增加食物的香味，并可使其色泽更加好看，从而增进食欲。\\n2、防癌：酱油的主要原料是大豆，大豆及其制品因富含硒等矿物质而有防癌的效果。\\n3、降低胆固醇：酱油含有多种维生素和矿物质，可降低人体胆固醇，降低心血管疾病的发病率，并能减少自由基对人体的损害。\\n4、止痒消肿：酱油可用于水、火烫伤和蜂、蚊等虫的蜇伤，并能止痒消肿。',
        简介:
          '酱油，用豆、麦、麸皮酿造的液体调味品。色泽红褐色，有独特酱香，滋味鲜美，有助于促进食欲。是中国的传统调味品。酱油俗称豉油，主要由大豆、淀粉、小麦、食盐经过制油、发酵等程序酿制而成的。酱油的成分比较复杂，除食盐的成分外，还有多种氨基酸、糖类、有机酸、色素及香料等成分。以咸味为主，亦有鲜味、香味等。它能增加和改善菜肴的味道，还能增添或改变菜肴的色泽。我国人民在数千年前就已经掌握酿制工艺了。酱油一般有老抽和生抽两种：生抽较咸，用于提鲜；老抽较淡，用于提色。',
        营养价值:
          '酱油中的氨基酸是人体所需的主要营养物质，尤其是酱油中含有一些人体不能合成的氨基酸，总量多达17种，还含有B族维生素和安全无毒的棕红色素。 酱油主要由大豆，淀粉、小麦、食盐经过制油、发酵等程序酿制而成的。酱油的成分比较复杂，除食盐的成分外，还有多种氨基酸、糖类、有机酸、色素及香料民分。以咸味为主，亦有鲜味、香味等。它能增加和改善菜肴的口味，还能增添或改变菜肴的色泽。'
      }
    },
    {
      id: 290,
      name: '醋',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、抗衰老：醋可以抑制和降低人体衰老过程中氧化物的形成，有一定抗衰老作用。\\n2、软化血管：食醋有软化血管，降血脂，降低胆固醇的作用； 扩张血管,有利于降低血压,防止心血管疾病的发生。\\n3、预防肥胖：醋可使人体内过多的脂肪转化为体能消耗，并促使人体糖和蛋白质的代谢，故有一定的减肥作用。\\n4、养颜护肤：醋中丰富的有机酸对人体皮肤有柔和的刺激作用，促使小血管扩张，增强皮肤血液循环，使皮肤光润。\\n5、杀菌：醋可以杀伤肠道中的葡萄球菌，大肠杆菌，在一定程度上有预防痢疾的作用。\\n6、调节酸碱平衡：调节血液的酸碱平衡,维持人体内环境的相对稳定；帮助消化,有利于食物中营养成分的吸收。\\n7、增强肝脏功能：增强肝脏机能,促进新陈代谢，有利尿作用，并能降低尿糖含量。',
        简介:
          '醋是一种发酵的酸味液态调味品，以含淀粉类的粮食(高粱、黄米、糯米、籼米等)为主料，谷糠、稻皮等为辅料，经过发酵酿造而成。醋在烹调中为主要的调味品之一,以酸味为主,且有芳香味,用途较广，是糖醋味的主要原料。它能去腥解腻，增加鲜味和香味，能在食物加热过程中使维生素C减少损失，还可使烹饪原料中钙质溶解而利于人体吸收。比较著名的品种有江苏镇江的香醋和山西的老陈醋等，常用于溜菜、拌菜及腥味较重的菜肴中。',
        营养价值:
          '醋中含有丰富的氨基酸，其中含有人体不能自身合成，必须由食物供给的8种氨基酸。醋中的糖类物质也很多如葡萄糖、果糖、麦芽糖等。醋中的有机酸含量较多，它主要含有醋酸，其次含有乳酸、丙酮酸、甲酸、苹果酸、柠檬酸等。'
      }
    },
    {
      id: 291,
      name: '鸡精',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充营养：鸡精大量的谷氨酸钠，也含有多种氨基酸和一些蛋白质与多种维生素，这些物质都是人体正常工作时的必须营养成分，人们食用鸡精以后可以快速这些营养成分吸收和利用，对增强身体素质有一定的好处。\\n3、增加食欲：鸡精有很强的提味增鲜作用，它可以让食物的味道更诱人，能让人们的胃口大开，可以起到增加食欲的作用',
        简介:
          '鸡精是以新鲜鸡肉、鸡骨、鸡蛋为原料制成的复合增鲜、增香的调味料。可以用于使用味精的所有场合，适量加入菜肴、汤羹、面食中均能达到效果。鸡精中除含有谷氨酸钠外，更含有多种氨基酸。它是既能增加人们的食欲，又能提供一定营养的家常调味品。鸡精产品更加注重鲜味，所以味精含量较高；鸡粉则着重产品来自鸡肉的自然鲜香，因而鸡肉粉的使用量较高。',
        营养价值:
          '鸡精中除含有谷氨酸钠外，更含有多种氨基酸。它是既能增加人们的食欲，又能提供一定营养的家常调味品。'
      }
    },
    {
      id: 294,
      name: '鸡翅',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、美容养颜：大量的成胶原及弹性蛋白的，对于血管、皮肤及内脏颇具效果。\\n2、促进身体发育：翅膀内所含大量的维生素A，远超过青椒。对视力、生长、上皮组织及骨骼的发育、精子的生成和胎儿的生长发育都是必需的。',
        简介:
          '又名鸡翼、大转弯。\\n\\n鸡翅也称“鸡翼”“大转弯”。鸡的翅膀。肉少，皮富胶质。又分“鸡膀”“膀尖”两种。鸡膀，连接鸡体至鸡翅的第一关节处，肉质较多；膀尖，鸡翅第一关节处至膀尖，骨多肉少。\\n\\n看起来虽然没有多少肉，而且没多大价值，但是在软骨或骨头中，可摄取动物胶的结合组织，是含有大量的成胶原及弹性蛋白的，对于血管、皮肤及内脏颇具效果。翅膀内所含大量的维生素A，远超过青椒。烹调翅膀肉时，应以慢火烧煮，才能发出香浓的味道，而成胶原等有效的成分，也必须以长时间烧煮才可溶化。其表面所产生疙瘩般的小颗粒，有许多人因而不敢吃。单拨去皮后小孩也比较喜欢吃。',
        营养价值:
          '鸡翅含有多量可强健血管及皮肤的成胶原及弹性蛋白等，对于血管、皮肤及内脏颇具效果。翅膀内所含大量的维生素A，远超过青椒。对视力、生长、上皮组织及骨骼的发育、精子的生成和胎儿的生长发育都是必需的。\\n'
      }
    },
    {
      id: 296,
      name: '茴香八角',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 298,
      name: '小龙虾',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1.壮阳补肾：适用于治疗肾阳虚所致的阳痿、腰痛、小便频数及补五脏之气不足，适用于男子性功能障碍、遗精、肾虚阳痿、遗精早泄的男子食用。\\n2.通乳生乳：虾的通乳作用较强，并且富含磷、钙、对小儿、孕妇尤有补益功效;对产妇有通乳汁、补身体、促康复的功效。\\n3.化瘀解毒：能够促进人体气血运行，对治疗血瘀证有一定的帮助。\\n4.提高免疫力：虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物。',
        简介:
          '小龙虾学名克氏原螯虾，也叫红螯虾或者淡水小龙虾。虾营养丰富，且其肉质松软，易消化，对身体虚弱以及病后需要调养的人是极好的食物；虾中含有丰富的镁，镁对心脏活动具有重要的调节作用。',
        营养价值:
          '1、从蛋白质成分来看，龙虾的蛋白质含量为18.9%，高于大多数的淡水和海水鱼虾，其氨基酸组成优于肉类，含有人体所必需的而体内又不能合成或合成量不足的8种必需氨基酸，不但包括异亮氨酸、色氨酸、赖氨酸、苯丙氨酸、缬氨酸和苏氨酸，而且还含有脊椎动物体内含量很少的精氨酸，另外，龙虾还含有对幼儿而言也是必需的组氨酸。\\n2、龙虾的脂肪含量仅为0.2%，不但比畜禽肉低得多，比青虾、对虾还低许多，而且其脂肪大多是由人体所必需的不饱和脂肪酸组成，易被人体消化和吸收，并且具有防止胆固醇在体内蓄积的作用。\\n3、龙虾和其他水产品一样，含有人体所必需的矿物成分，其中含量较多的有钙、钠、钾、镁、磷，含量比较重要的有铁、硫、铜等。龙虾中矿物质总量约为1.6%，其中钙、磷、钠及铁的含量都比一般畜禽肉高，也比对虾高。因此，经常食用龙虾肉可保持神经、肌肉的兴奋性。'
      }
    },
    {
      id: 299,
      name: '小葱头',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 301,
      name: '青尖椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、保护心脏：辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇。\\n2、防癌抗癌：辣椒含有较多抗氧化物质，可预防癌症及其他慢性疾病。\\n3、开胃消食：吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲、增加饭量。\\n4、暖胃驱寒、止痛散热：辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。\\n5、肌肤美容、降脂减肥：辣椒含有一种特殊物质，能加速新陈代谢天谢地达到燃烧体内脂肪的效果。',
        简介:
          '属辣椒的一个大类。在我国，在许多地区都是非常重要的调味品，甚至没有它就无法下饭，可见人们对它的钟爱。由于南方多雨，空气潮湿，辣椒有祛湿功能，所以南方人均喜辣椒。',
        营养价值:
          '辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇；含有较多抗氧化物质，可预防癌症及其他慢性疾病；可以使呼吸道畅通，用以治疗咳嗽、感冒。吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲，增加饭量。\\n辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。它含有一种特殊物质，能加速新陈代谢以达到燃烧体内脂肪的效果显著，从而起到减肥作用。这种物质还可以促进荷尔蒙分泌，对皮肤有很好的美容保健作用，是女性的“补品”。\\n'
      }
    },
    {
      id: 302,
      name: '红尖椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、红尖椒辛温，能够通过发汗而降低体温，并缓解肌肉疼痛，因此具有较强的解热镇痛作用。\\n2、红尖椒的有效成分辣椒素是一种抗氧化物质，它可阻止有关细胞的新陈代谢，从而终止细胞组织的癌变过程，降低癌症细胞的发生率。\\n3、红尖椒强烈的香辣味能刺激唾液和胃液的分泌，增加食欲，促进肠道蠕动，帮助消化。\\n4、红尖椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥防病。',
        简介:
          '红尖椒原产于中南美洲热带地区，明代的时候传入我国。如今全国各地均有栽培，并且一年四季都有。墨西哥人将它视为国食，而在我国很多地方红尖椒也是非常重要的调味品。红尖椒晒干以后就是我们超市里所见的干辣椒。挑选鲜的红尖椒时应选果皮坚实，肉厚质细而脆嫩，无虫咬、黑点和腐烂的。',
        营养价值:
          '辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇；含有较多抗氧化物质，可预防癌症及其他慢性疾病；可以使呼吸道畅通，用以治疗咳嗽、感冒。吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲，增加饭量。\\n辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状。它含有一种特殊物质，能加速新陈代谢以达到燃烧体内脂肪的效果显著，从而起到减肥作用。这种物质还可以促进荷尔蒙分泌，对皮肤有很好的美容保健作用，是女性的“补品”。\\n'
      }
    },
    {
      id: 303,
      name: '姜粒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 305,
      name: '猪后腿肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾滋阴：猪肉性平味甘，有润肠胃、生津液、补肾气、解热毒的功效，主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴、润肌肤、利小便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '猪肉是目前人们餐桌上重要的动物性食品之一。因为猪肉纤维较为细软，结缔组织较少，肌肉组织中含有较多的肌间脂肪，因此，经过烹调加工后肉味物别鲜美。\\n从猪的腿部到后腿部分的肉称为腿肉，由于此部位整块都是瘦肉，脂肪含量极少，因此属于高蛋白、低脂肪且是高维生素的猪肉。',
        营养价值:
          '1、猪肉的蛋白质属优质蛋白质，含有人体全部必需氨基酸。\\n2、猪肉富含铁，是人体血液中红细胞的生成和功能维持所必须的元素。\\n3、猪肉是维生素的主要膳食来源，特别是精猪肉中维生素B1的含量丰富。\\n4、猪肉中还含有较多的对脂肪合成和分解有重要作用的维生素B2。'
      }
    },
    {
      id: 306,
      name: '高度白酒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、预防心血管病：少量饮用白酒，可预防心血管病的作用。 \\n2、消除疲劳和紧张：少量饮用白酒，能够通过酒精对大脑和中枢神经的作用，起到消除疲劳，松弛神经的功效。 \\n3、开胃消食：在进餐的同时，饮用少量的白酒，能够增进食欲，促进食物的消化。\\n4、驱除寒冷：白酒含有大量的热量，饮入人体后，这些热量会迅速被人体吸收。\\n5、促进新陈代谢：白酒能够促进人体的血液循环，对全身皮肤起到一定良性的刺激作用。\\n6、舒筋活血：白酒具有舒筋通络、活血化淤的功效。',
        简介:
          '白酒是世界蒸馏酒中独具一格的酒类，为麦黍、高粱、玉米、红薯、米糠等粮食或其他果品发酵、曲酿、蒸馏而成的一种饮料。其酒液无色透明，故称为白酒。白酒芳香浓郁，醇和软润，风味多样。因主要采用烧(蒸)工序，亦称烧酒。因含酒精量较高，所有有些地方直呼其为烈性酒或高度酒。我国的名白酒，历史悠久，在世界上独树一帜。',
        营养价值:
          '白酒含有极少量的钠、铜、锌，几乎不含维生素和钙、磷、铁等，所含有的仅是水和乙醇(酒精)。酒中的酒精被人体吸收后，虽然也可以氧化供热，但是饮白酒所感到的浑身发热，并非酒精供热的结果，而是在酒精的刺激下，由人体的微血管扩张，体表大量散热所致，实际上消耗的还是体内的葡萄糖。据测定，每饮烈酒500克，会使体内在一天内所摄取能量的1/3～1/2被它白白消耗掉。\\n由此可见，白酒的营养物质只是很少的一部分白酒中含有极少量的锌、铜、硒等矿物质，仅此而已。但这些成分的作用也不容小觑。\\n传统认为白酒的作用有活血通脉、助药力、增进食欲、消除疲劳，陶冶情操，使人轻快并有御寒提神的功能。饮用少量低度白酒可以扩张小血管，促进血液循环，延缓胆固醇等脂质在血管壁的沉积，对循环系统及心脑血管有利。\\n因此，适当饮酒对人体是非常有益的，但绝对不要过量，过量饮酒伤肝，可能导致脂肪肝、酒精肝炎、肝硬化，并逐步演变为肝癌。'
      }
    },
    {
      id: 307,
      name: '温水',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 308,
      name: '姜粉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、降温提神，增进食欲：生姜粉在炎热时节有兴奋、排汗降温、提神等作用；生姜粉可缓解疲劳、乏力、厌食、失眠、腹胀、腹痛等症状。\\n2、抗氧化，抑制肿瘤：生姜粉中所含的姜辣素和二苯基庚烷类化合物的结构均具有很强的抗氧化和清除自由基作用；抑制肿瘤作用；吃生姜粉能抗衰老，老年人常吃生姜粉可除“老人斑”。\\n3、美容防衰老：生姜粉含一种类似水杨酸的化合物，相当于血液的稀释剂和抗凝剂，生姜粉对降血脂、降血压、预防心肌梗塞有特殊作用，可防衰老。\\n4、祛寒：姜粉泡脚也可以起到驱寒的作用，生姜粉可以帮助预防感冒。\\n5、防晕车：生姜粉可缓解晕动病之头痛、眩晕、恶心、呕吐等症状，且药效可持续4小时以上。\\n6、改善睡眠：生姜粉泡脚能够很好的刺激足底穴位，增强各系统的新陈代谢，从而使人体放松、缓解疲劳。生姜粉能改善睡眠质量。',
        简介:
          '姜粉是以干姜植物为原料，磨成粉后，会散发出一股温暖的胡椒味，还带着淡淡的柠檬香。科学配制而成的香辛料调味品，味道尝起来火辣、浓烈其调香效果显着，风味浓郁，可增进食欲，有益健康，是家庭、餐饮业常备调味佳品。',
        营养价值:
          '现代科学研究表明，生姜中含有过氧化物歧化酶，它是一种抗衰老的物质。最近一些营养学家研究发现，生姜里含有一种特殊物质，其化学结构和阿司匹林乙酰水杨酸相似。这种物质，可防止血小板集聚，防止血栓形成的效果十分理想。此外，生姜还可以调节前列腺素的水平，而前列腺素也具有降低血小板聚集的作用。日本学者则认为，生姜中的姜酚有较强的利胆作用，生姜在一定程度上能抑制癌细胞的生长。德国学者则报道，姜粉的辛辣成分比目前应用的抗氧化剂--维生素E的抗氧化作用更强。\\n国防医学院航天医学所的研究也初步证实，服用生姜粉，可经由胃黏膜吸收，直接可以抑制胃蠕动的频率与振幅，缓解胃部的不适感。\\n根据国防医学院的观察、检验，生姜粉对血压、心跳、呼吸道、脑波等中枢神经并没有影响，重要的是，它几乎全在消化道起作用。所以，对一些人而言，姜粉比其它止恶药理想，主要就因姜粉对消化系统起作用，而不是脑部中枢神经，不会有恼人的昏昏欲睡、耳鸣、神经紧张等副作用。'
      }
    },
    {
      id: 310,
      name: '猪五花肉',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补肾养血：猪肉味甘咸、性平，入脾、胃、肾经;补肾养血，滋阴润燥;主治热病伤津、消渴羸瘦、肾虚体弱、产后血虚、燥咳、便秘、补虚、滋阴、润燥、滋肝阴，润肌肤，利二便和止消渴。\\n3、润燥：猪肉煮汤饮下可急补由于津液不足引起的烦燥、干咳、便秘和难产。',
        简介:
          '五花肉（又称肋条肉、三层肉）位于猪的腹部，猪腹部脂肪组织很多，其中又夹带着肌肉组织，肥瘦间隔，故称“五花肉”。这部分的瘦肉也最嫩且最多汁。五花肉一直是一些代表性中菜的最佳主角，如梅菜扣肉、南乳扣肉、东坡肉、回锅肉、鲁肉饭、瓜仔肉、粉蒸肉等等。它的肥肉遇热容易化，瘦肉久煮也不柴。',
        营养价值:
          '猪肉含有丰富的优质蛋白质和必需的脂肪酸，并提供血红素（有机铁）和促进铁吸收的半胱氨酸，能改善缺铁性贫血。'
      }
    },
    {
      id: 311,
      name: '辣椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、保护心脏：辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇；\\n2、防癌抗癌：辣椒含有较多抗氧化物质，可预防癌症及其他慢性疾病；\\n3、开胃消食：吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲、增加饭量；\\n4、暖胃驱寒、止痛散热：辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状；\\n5、肌肤美容、降脂减肥：辣椒含有一种特殊物质，能加速新陈代谢天谢地达到燃烧体内脂肪的效果，从而起到减肥作用；这种物质还可以促进荷尔蒙分泌，对皮肤有很好的美容保健作用，是女性的“补品”。',
        简介:
          '辣椒属茄科，一年生或多年生蔬菜。原产南美洲热带，明代传入我国。我国各地均有生产，以四川、湖南、湖北产量最多。四季均有供应。辣椒老熟后可晒制辣椒干。\\n辣椒的品质要求：作为鲜食的辣椒应以大小均匀，果皮坚实，肉厚质细而脆嫩新鲜，无虫咬、黑点和腐烂现象者为上品。干红辣椒是辣椒经晾干后的制品。印度人称辣椒为“红色牛排”；墨西哥人将辣椒视为国食。在我国许多地区辣椒都是非常重要的调味品，甚至没有它就无法下饭，可见人们对它的钟爱。',
        营养价值:
          '1. 辣椒含有丰富的维生素C，可以控制心脏病及冠状动脉硬化，降低胆固醇；\\n2. 辣椒含有较多抗氧化物质，可预防癌症及其他慢性疾病；\\n3. 吃饭不香、饭量减少时，在菜里放上一些辣椒就能改善食欲、增加饭量；\\n4. 辣椒具有强烈的促进血液循环的作用，可以改善怕冷、冻伤、血管性头痛等症状；\\n5. 辣椒含有一种特殊物质，能加速新陈代谢天谢地达到燃烧体内脂肪的效果，从而起到减肥作用；这种物质还可以促进荷尔蒙分泌，对皮肤有很好的美容保健作用，是女性的“补品”。\\n'
      }
    },
    {
      id: 313,
      name: '鸡翅根',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强身健体：鸡肉的消化率高，很容易被人体吸收利用，有增强体力、强壮身体的作用。\\n2、提高免疫力：现代社会中天天忙忙碌碌，常处于亚健康状态的白领最好多吃一些，以增强免疫力，减少患病几率。鸡肉具有温中益气、补精填髓、益五脏、补虚损的功效，用于治疗虚劳瘦弱、中虚食少、泄泻头晕心悸、月经不调、产后乳少、消渴、水肿等症状。\\n3、补肾精：可缓解由于肾精不足所导致的小便频繁、耳聋、精少精冷等症状。\\n4、促进智力发育：具有抗氧化和一定的解毒作用。在改善心脑功能、促进儿童智力发育方面，更是有较好的作用。',
        简介:
          '鸡翅即鸡翼，俗称鸡翅膀，是整个鸡身最为鲜嫩可口的部位之一，常见于多种菜肴或小吃中。常见如可乐鸡翅等。根据需求，还可以分为翅尖，翅中，翅根3部分。',
        营养价值:
          '1、翅根蛋白质含量较高,且易被人体吸收入利用,有增强体力,强壮身体的作用。此外,鸡肉还含有脂肪、钙、磷、铁、镁、钾、钠、维生素A、B1、B2、C、E和烟酸等成分。\\n2、翅根钾硫酸氨基酸的含量也很丰富,因此可弥补牛及猪肉的不足。\\n3、翅根比其他肉类的维生素A含量多,而在量方面虽比蔬菜或肝脏差,但和牛肉和猪肉相比,其维生素A的含量却高出许多。'
      }
    },
    {
      id: 317,
      name: '排骨',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、补充蛋白质和脂肪酸：猪肉为人类提供优质蛋白质和必需的脂肪酸。猪肉可提供血红素(有机铁)和促进铁吸收的半胱氨酸，能改善缺铁性贫血。\\n2、补钙：猪排骨除含蛋白质、脂肪、维生素外，还含有大量磷酸钙、骨胶原、骨粘蛋白等，可为幼儿和老人提供钙质。',
        简介:
          '排骨，指猪、牛、羊等动物剔肉后剩下的肋骨和脊椎骨，上面还附有少量肉类，可以食用，如：红烧排骨，是一道中国家常菜。',
        营养价值:
          '排骨除含蛋白、脂肪、维生素外，还含有大量磷酸钙、骨胶原、骨粘蛋白等，可为幼儿和老人提供钙质。\\n排骨有很高的营养价值，具有滋阴壮阳、益精补血的功效。熬汤来放上葱，和一些相应的调味料，煮过后非常美味，也很有营养。'
      }
    },
    {
      id: 319,
      name: '蒜片',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、强力杀菌：大蒜中含硫化合物具有奇强的抗菌消炎作用。\\n2、防治肿瘤和癌症：大蒜中的锗和硒等元素可抑制肿瘤细胞和癌细胞的生长。\\n3、排毒清肠：大蒜可有效抑制和杀死引起肠胃疾病的幽门螺杆菌等细菌病毒，清除肠胃有毒物质，刺激胃肠粘膜，促进食欲，加速消化。\\n4、降低血糖：大蒜可促进胰岛素的分泌，增加组织细胞对葡萄糖的吸收，提高人体葡萄糖耐量。\\n5、防治心脑血管疾病：大蒜可防止心脑血管中的脂肪沉积，诱导组织内部脂肪代谢。\\n6、保护肝功能：大蒜中的微量元素硒，通过参与血液的有氧代谢，清除毒素，减轻肝脏的解毒负担，从而达到保护肝脏的目的。\\n7、旺盛精力：大蒜可有效补充肾脏所需物质，改善因肾气不足而引发的浑身无力症状，并可促进精子的生成，使精子数量大增。\\n8、预防感冒：可预防感冒，减轻发烧、咳嗽、喉痛及鼻塞等感冒症状。',
        简介:
          '大蒜 （Garlic）又叫蒜头、大蒜头、胡蒜、葫、独蒜、独头蒜，是蒜类植物的统称。半年生草本植物，百合科葱属，以鳞茎入药。春、夏采收，扎把，悬挂通风处，阴干备用。农谚说“种蒜不出九（月），出九长独头”，6月叶枯时采挖，除去泥沙，通风晾干或烘烤至外皮干燥。',
        营养价值:
          '1.大蒜含有丰富的碳水化合物，较少的蛋白质，几乎不含脂肪。\\n2.大蒜中含有较为全面的微量元素，尤其钾和磷的含量较高。\\n3.大蒜中含有一种叫“硫化丙烯”的辣素。\\n4.大蒜中含有丰富的硒元素。'
      }
    },
    {
      id: 321,
      name: '面',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 323,
      name: '牛腩',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、调节病后体虚：牛肉富含蛋白质，氨基酸组成比猪肉更接近人体需要，能提高机体抗病能力，对生长发育及术后，病后调养的人在补充失血、修复组织等方面特别适宜，寒冬食牛肉可暖胃，是该季节的补益佳品。\\n2、补血养血：牛肉有补中益气，滋养脾胃，强健筋骨，化痰息风，止渴止涎之功效，适宜于中气下隐、气短体虚、筋骨酸软、贫血久病及面黄目眩之人食用。\\n3、强筋壮骨：水牛肉能安胎补神，黄牛肉能安中益气、健脾养胃、强筋壮骨。',
        简介:
          '牛腩即牛腹部及靠近牛肋处的松软肌肉，以新鲜黄牛的牛腩为好。是指带有筋、肉、油花的肉块，这只是一种统称。若依部位来分，牛身上许多地方的肉都可以叫做牛腩。国外进口的部分是以切成条状的牛肋条为主（又称条肉），是取自肋骨间的去骨条状肉，瘦肉较多，脂肪较少，筋也较少，适合红烧或炖汤。另外，在里脊肉上层有一片筋少、油少、肉多，但形状不大规则的里脊边，也可以称作牛腩，是上等的红烧部位。牛腱也可以算是牛腩的一种，筋肉多，油少，甚至全是瘦肉。因此一般用来卤，不适合炖汤，更不适合红烧。',
        营养价值:
          '1.牛肉提供高质量的蛋白质，含有全部种类的氨基酸，各种氨基酸的比例与人体蛋白质中各种氨基酸的比例基本一致，其中所含的肌氨酸比任何食物都高。\\n2.牛肉的脂肪含量很低，但它却是低脂的亚油酸的来源，还是潜在的抗氧化剂。\\n3.牛肉含有矿物质和维他命B群，包括烟酸，维生素B1和核黄素。牛肉还是每天所需要的铁质的最佳来源。\\n4.牛肉还含肉毒碱。'
      }
    },
    {
      id: 324,
      name: '番茄',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、减缓色斑延缓衰老：补充番茄红素，抵抗衰老，增强免疫系统，减少疾病的发生。番茄红素还能降低眼睛黄斑的退化、减少色斑沉着。\\n2、抗癌：番茄红素能够有效预防前列腺癌、消化道癌、肝癌、肺癌、乳腺癌、膀胱癌、子宫癌、皮肤癌等。\\n3、降脂降压：降低血压经常发生牙龈出血或皮下出血的患者，吃番茄有助于改善症状。\\n4、防止血栓的发生：患冠心病及中风的病人每天适量饮用番茄汁有益于病的康复。\\n5、健胃消食：有助消化、润肠通便作用，可防治便秘。',
        简介:
          '番茄(tomato)别名西红柿、洋柿子，古名六月柿、喜报三元。果实营养丰富，具特殊风味。可以生食、煮食、加工制成番茄酱、汁或整果罐藏。番茄是全世界栽培最为普遍的果菜之一。 美国、苏联、意大利和中国为主要生产国。在欧、美洲的国家、中国和日本有大面积温室、塑料大棚及其他保护地设施栽培。中国各地普遍种植。栽培面积仍在继续扩大。',
        营养价值:
          '番茄含有对心血管具有保护作用的维生素和矿物质元素，能减少心脏病的发作。\\n番茄红素具有独特的抗氧化能力，能清除自由基，保护细胞，使脱氧核糖核酸及基因免遭破坏，能阻止癌变进程。西红柿除了对前列腺癌有预防作用外，还能有效减少胰腺癌、直肠癌、喉癌、口腔癌、肺癌、乳腺癌等癌症的发病危险。\\n番茄中的维C，有生津止渴，健胃消食，凉血平肝，清热解毒，降低血压之功效，对高血压、肾脏病人有良好的辅助治疗作用。多吃番茄具有抗衰老作用，使皮肤保持白皙。\\n尼克酸能维持胃液的正常分泌，促进红血球的形成，有利于保持血管壁的弹性和保护皮肤。所以食用西红柿对防治动脉硬化、高血压和冠心病也有帮助。西红柿多汁，可以利尿，肾炎病人也宜食用。\\n经常发生牙龈出血或皮下出血的患者，吃番茄有助于改善症状。\\n番茄所含的苹果酸或柠檬酸，有助于胃液对脂肪及蛋白质的消化。\\n'
      }
    },
    {
      id: 325,
      name: '口蘑',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、提高免疫力：口蘑能够防止过氧化物损害机体，提高免疫力。\\n2、保护肝脏：口蘑可抑制血清和肝脏中胆固醇上升，对肝脏起到良好的保护作用。\\n3、美容减肥：口蘑是一种较好的减肥美容食品。具有防止便秘、促进排毒的作用。\\n4、预防骨质疏松：当白蘑菇含有维生素D。而多摄入维生素D，就能很好地预防骨质疏松症。\\n5、防癌：白蘑菇中含有可以抵抗病毒侵害的物质，而且经常食用可以防止癌症的发生。',
        简介:
          '口蘑是一种真菌类食用菜，它伞盖肥厚，清香适口，独具风味，被人们誉为“素中之肉”。口蘑的品种有白蘑、青腿子、马莲杆、杏香等，其中以白蘑最为名贵。新鲜的白蘑，菌盖洁白，褶细、盖大、肉厚、柄短，气味极清香。夏秋产蘑时节，一场细雨过后，十里之外就可以闻到蘑香。\\n口蘑味道鲜美，口感细腻软滑，十分适口，既可炒食，又可焯水凉拌，且形状规整好看，是人们最喜爱的蘑菇之一。',
        营养价值:
          '1. 富含微量元素硒的口蘑是良好的补硒食品，喝下口蘑汤数小时后，血液中的硒含量和血红蛋白数量就会增加，并且血中谷胱甘肽过氧化酶的活性会显著增强，它能够防止过氧化物损害机体，降低因缺硒引起的血压升高和血黏度增加，调节甲状腺的工作，提高免疫力；\\n2. 口蘑中含有多种抗病毒成分，这些成分对辅助治疗由病毒引起的疾病有很好效果；\\n3. 口蘑是一种较好的减肥美容食品。它所含的大量植物纤维，具有防止便秘，具有防止便秘、促进排毒、预防糖尿病及大肠癌、降低胆固醇含量的作用，而且它又属于低热量食品，可以防止发胖。\\n'
      }
    },
    {
      id: 326,
      name: '西芹',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、平肝降压：芹菜含酸性的降压成分，对兔、犬静脉注射有明显降压作用。临床对于原发性、妊娠性及更年期高血压均有效。\\n2、镇静安神：从芹菜子中分离出的一种碱性成分，对动物有镇静作用，对人体能起安定作用，有利于安定情绪，消除烦躁。\\n3、利尿消肿：芹菜含有利尿有效成分，消除体内钠潴留，利尿消肿。临床上以芹菜水煎可治疗乳糜尿。\\n4、防癌抗癌：芹菜是高纤维食物，它经肠内消化作用产生一种木质素或肠内脂的物质，这类物质是一种抗氧化剂，高浓度时可抑制肠内细菌产生的致癌物质。它还可以加快粪便在肠内的运转时间，减少致癌物与结肠粘膜的接触，达到预防结肠癌的目的。\\n5、养血补虚：芹菜含铁量较高，能补充妇女经血的损失，食之能避免皮肤苍白、干燥、面色无华，而且可使目光有神，头发黑亮。',
        简介:
          '西芹又名西洋芹菜，其营养丰富，富含蛋白质、碳水化合物、矿物质及多种维生素等营养物质，还含有芹菜油，具有降血压、镇静、健胃、利尿等疗效，是一种保健蔬菜， 西芹是这些年从国外引入，已广泛栽培并深受百姓喜爱的，叶柄宽厚，单株叶片数多，重量大，可达1Kg以上。西芹和本芹（中国芹菜）具有相同的营养和食疗价值。',
        营养价值:
          '西芹含有丰富蛋白质、胡萝卜素、碳水化合物、脂肪、B族维生素、维生素C、糖类、氨基酸及矿物质和膳食纤，其中磷和钙的含量较高。另外，芹菜叶中营养成分要高于芹菜茎'
      }
    },
    {
      id: 329,
      name: '黄豆',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、增强机体免疫功能：大豆含有丰富的蛋白质，含有多种人体必需的氨基酸，可以提高人体免疫力。\\n2、防止血管硬化：黄豆中的卵磷脂可除掉附在血管壁上的胆固醇，防止血管硬化，预防心血管疾病，保护心脏。大豆中的卵磷脂还具有防止肝脏内积存过多脂肪的作用，从而有效地防治因肥胖而引起的脂肪肝。\\n3、通导大便：大豆中含有的可溶性纤维，既可通便，又能降低胆固醇含量。\\n4、降糖、降脂：大豆中含有一种抑制胰酶的物质，对糖尿病有治疗作用。大豆所含的皂甙有明显的降血脂作用，同时，可抑制体重增加。\\n5、大豆异黄酮是一种结构与雌激素相似，具有雌激素活性的植物性雌激素，能够减轻女性更年期综合征症状、延迟女性细胞衰老、使皮肤保持弹性、养颜、减少骨丢失，促进骨生成、降血脂等。',
        简介:
          '又名大豆、黄大豆、枝豆、菜用大豆。\\n\\n大豆，为豆科大豆属一年生草本植物，原产我国。根据大豆的种皮颜色和粒形分为五类：黄大豆、青大豆、黑大豆、其他大豆（种皮为褐色、棕色、赤色等单一颜色的大豆）、饲料豆（一般籽粒较小，呈扁长椭圆形，两片子叶上有凹陷圆点，种皮略有光泽或无光泽）。我国自古栽培，至今已有5000年的种植史。现在全国普遍种植，在东北、华北、陕、川及长江下游地区均有出产，以长江流域及西南栽培较多，以东北大豆质量最优。世界各国栽培的大豆都是直接或间接由我国传播出去的。由于它的营养价值很高，被称为“豆中之王”、“田中之肉”、“绿色的牛乳”等，是数百种天然食物中最受营养学家推崇的食用。',
        营养价值:
          '1、黄豆含蛋白质40%左右，在量和质上均可与动物蛋白比美，500克黄豆的蛋白质含量相当于1500克鸡蛋，或6000克牛奶，或1000克瘦猪肉，所以黄豆有“植物肉”及“绿色乳牛”之誉。\\n2、黄豆蛋白质中所含必需氨基酸较全，尤其富含赖氨酸，正好补充谷类赖氨酸不足的缺陷，而黄豆中缺乏的蛋氨酸，又可得到谷类的补充。\\n3、黄豆脂肪含量为18—20%，在豆类中占首位，出油率达20％。另外，比动物性脂肪优越之点是含胆固醇少，而富含亚麻油酸及亚麻油稀酸，这类不饱和脂肪酸使黄豆具有降低胆固醇的作用；卵磷脂也较多，这对神经系统的发育有重要意义。\\n4、含钾、钠等无机盐、某些必需微量元素、属异黄酮类的大豆黄酮苷(包括金雀异黄素)、染科木苷以及大豆皂苷。干黄豆内虽不含维生素C，但发芽后能产生维生素C，在蔬菜淡季，可补充食用。另外，黄豆还含有维生素A、B、D、E及钙、磷、铁等矿物质。\\n5、黄豆加工后的各种豆制品，不但蛋白质含量高，并含有多种人体不能合成而又必需的氨基酸，胆固醇含量中豆腐的蛋白质消化率高达95％，为理想的补益食疗之品。\\n需要注意的是，生黄豆中，含有抗胰蛋白酶因子，影响人体对黄豆内营养成分的吸收。所以食用黄豆及豆制食品，烧煮时间应长于一般食品，以高温来破坏这些因子，提高黄豆蛋白的营养价值。'
      }
    },
    {
      id: 330,
      name: '小茴香',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、有温肾散寒，和胃理气的功效。\\n2、主要治疗胃寒腹痛、寒疝作痛、胃寒纳差等症，小茴香辛散温通，善暖中下二焦，尤以疏肝散寒止痛见长，为治寒疝要药。',
        简介:
          '小茴香为伞形科多年生草本植物茴香的干燥成熟果实，呈灰色，形如稻粒，于夏末秋初果实成熟时割取全株，晒干后，打下果实，去净杂质。产地较广，以四川、陕西、宁夏所产为好。有浓郁的香味，常与大茴香一起使用。小茴香为五香粉原料之一，在药用上有健康开胃、理气、祛风散寒等疗效。',
        营养价值:
          '1. 小茴香的主要成分是蛋白质、脂肪、膳食纤维、茴香脑、小茴香酮和茴香醛等，其香气主要来自茴香酮和茴香醛等香味物质；\\n2. 小茴香能刺激胃肠神经血管，促进唾液和胃液分泌，起到增进食欲、帮助消化的作用；\\n3. 小茴香还具有促进肠蠕动，缓解痉挛，减少疼痛，并有抗菌的作用。'
      }
    },
    {
      id: 331,
      name: '三奈',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 332,
      name: '熟花生',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、促进生长发育：花生含丰富的维生素及矿物质，可以促进人体的生长发育。\\n2、健脑益智：花生蛋白中含十多种人体所需的氨基酸，其中赖氨酸可使儿童提高智力，谷氨酸和天门冬氨酸可促使细胞发育和增强大脑的记忆能力。\\n3、延缓衰老：花生中所含有的儿茶素对人体具有很强的抗老化的作用，赖氨酸也是防止过早衰老的重要成分。常食花生，有益于人体延缓衰老，故花生又有“长生果”之称。\\n4、润肺止咳：润肺止咳花生中含有丰富的脂肪油、可以起到润肺止咳的作用，常用于久咳气喘，咯痰带血等病症。\\n5、止血：凝血止血花生衣中含有油脂和多种维生素，并含有使凝血时间缩短的物质，能对抗纤维蛋白的溶解，有促进骨髓制造血小板的功能，对多种出血性疾病，不但有止血的作用，而且对原发病有一定的治疗作用，对人体造血功能有益。”\\n6、降低胆固醇：防止冠心病花生油中含大量的亚油酸，这种物质可使人体内胆固醇分解为胆汁酸排出体外。避免胆固醇在体内沉积，减少高胆固醇发病机会，能够防止冠心病和动脉硬化。另外，花生中含有一种生物活性很强的天然多酚类物质—白藜芦醇，可预防癌症的发生及发展，具有抗动脉粥样硬化和冠心病，缺血性心脏病，高血脂的防治作用。\\n7、养血通乳：滋血通乳花生中含丰富的脂肪油和蛋白质，对产后乳汁不足者，有滋补气血，养血通乳作用。\\n8、防癌：花生纤维组织中的可溶性纤维被人体消化吸收时，会像海绵一样吸收液体和其他物质，然后膨胀成胶带体随粪便排出体外。当这些物体经过肠道时，与许多有害物质接触，吸取某些毒素，从而降低有害物质在体内的积存和所产生的毒性作用，减少肠癌发生的机会。',
        简介:
          '花生又名落花生，原产于南美洲一带，世界上栽培花生的国家有100多个，亚洲最为普遍，次为非洲，据中国有关花生的文献记载栽培史约早于欧洲100多年。花生被人们誉为“植物肉”，含油量高达50%，品质优良，气味清香。除供食用外，还用于印染、造纸工业，花生也是一味中药，适用营养不良、脾胃失调、咳嗽痰喘、乳汁缺少等症。花生的栽培管理技术性也相对较强。',
        营养价值:
          '花生的热量高于肉类，比牛奶高20%，比鸡蛋高40%。其他如蛋白质，核蛋素，钙，磷，铁等也都比牛奶、肉、蛋等要高。花生中还含有维生素A、B、E、K等，以及卵磷脂、蛋白氨基酸、胆碱和油酸、落花生酸、脂肪酸、棕榈酸等。'
      }
    },
    {
      id: 333,
      name: '熟芝麻',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、防治皮肤炎症：可使皮肤白皙润泽，并能防治各种皮肤炎症。\\n2、养血护肤：可以治疗皮肤干枯、粗糙、令皮肤细腻光滑、红润光泽。\\n3、滋补养生：补班、养发、生津、通乳、润肠。\\n4、通便：润肠通便，对肠液减少引起的便秘，单独应用即有效验。\\n5、促进骨骼发育：经常食用对骨骼、牙齿的发育都大有益处。\\n6、延年益寿：可强壮身体、益寿延年、滋补肝肾、润养脾肺。\\n7、预防高血压：芝麻中人体必需脂肪酸含量很高，预防高血压的效果很好。\\n8、护发：助消化、维护皮肤、头发健康',
        简介:
          '芝麻又叫胡麻、脂麻、乌麻等，属脂麻科一年生草本植物。味甘性平，具有补血明目，益肝养发，生津通乳，润肠通便，美容养颜，延年益寿等功能，被人们誉为“抗衰果”。 现代研究表明，芝麻中含有丰富的营养，芝麻的脂肪油含量达61.7％左右，是我国四大食用油料作物的佼佼者，芝麻油中以油酸、亚油酸、棕榈酸、甘油脂为主要成分；含蛋白质21.9％，氨基酸种类与瘦肉相似；还含有芝麻素、脂麻油酚、卵磷脂、蔗糖、多缩戊糖及钙、磷、铁等物质和维生素A、D、E等。',
        营养价值:
          '据测定，芝麻含有多种营养物质，每百克芝麻含蛋白质21.90克，脂肪61.70克，钙564.00毫克，磷368.00毫克；特别是铁的含量极高，每百克可高达50.00毫克。因此，古人说芝麻能“填精”、“益髓”、“补血”的功效。'
      }
    },
    {
      id: 334,
      name: '干辣椒碎',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 336,
      name: '咸蛋黄',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、滋阴补血：咸鸭蛋黄味甘，有滋阴补血的功效。\\n2、安神入眠：咸鸭蛋黄对失眠等症状有一定治疗作用，能安神入眠。',
        简介: '咸蛋黄是一种美食，主要原料有鸭蛋、禽蛋等。',
        营养价值:
          '咸蛋黄富含卵磷脂与不饱和脂肪酸，氨基酸等人体生命重要的营养元素。不过胆固醇是一柄双刃剑，胆固醇增高会影响动脉，易得动脉硬化，胆固醇缺少也会引起一系列健康问题。普通人一天食用一个到两个蛋黄就够了，不要太多。'
      }
    },
    {
      id: 337,
      name: '内酯豆腐',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、祛脂降压：使血压更易控制，并使毛细管扩张，血黏度降低，微循环改善。\\n2、通乳生乳：有补气血、生乳作用，对产妇有通乳汁、补身体、促康复的功效。\\n3、解毒：清理身体内长期淤积的毒素，增进身体健康。\\n4、抑癌抗瘤：延缓和抑制癌细胞生长、扩散。使癌细胞退化、萎缩。',
        简介:
          '内酯豆腐以葡萄糖酸内酯为凝固剂生产豆腐，可减少蛋白质流失，提高保水率。大大地增加了产量，且豆腐洁白细腻、有光泽、口感好、保存时间长。',
        营养价值:
          '1.豆腐营养丰富，含有铁、钙、磷、镁等人体必需的多种微量元素，还含有糖类、植物油和丰富的优质蛋白，素有“植物肉”之美称。大豆的蛋白质生物学价值可与鱼肉相媲美，是植物蛋白中的佼佼者。大豆蛋白属于完全蛋白质，其氨基酸组成比较好，人体所必需的氨基酸它几乎都有。大豆可以直接烹调食用，人体对其蛋白质的消化吸收率只有65%，而制成豆腐消化率可以提升到92%~95%。\\n2.制作豆腐的大豆中含有18%左右的油脂，大部分能转移到豆腐中去。大豆油中的亚油酸比例较大，且不含胆固醇，有益于人体神经、血管、大脑的生长发育。\\n3.豆腐不含胆固醇，为高血压、高血脂、高胆固醇症及动脉硬化、冠心病患者的药膳佳肴。\\n4.豆腐含有丰富的植物雌激素，对防治骨质疏松症有良好的作用。'
      }
    },
    {
      id: 338,
      name: '红彩椒',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、预防心血管疾病：可改善黑斑及雀斑，还有消暑、补血、消除疲劳、预防感冒和促进血液循环等功效，能够使血液中的良好胆固醇增加，使血管强健，使血液循环转为良好，改善动脉硬化以及各种的心血管疾病。\\n2、促进新陈代谢：其中的椒类碱能够促进脂肪的新陈代谢，防止体内脂肪积存，从而减肥防病。\\n3、抗老化：红甜椒所具有的强大抗氧化作用，可抗白内障、心脏病和癌症，防止身体老化，并且使体内的细胞活化，有著非常明显的效果。',
        简介:
          '五彩椒又名朝天椒、五彩辣椒，是辣椒的变种，为茄科多年生半木质性植物，但常作一年生栽培。株高30-60厘米，茎直立，常呈半木质化，分枝多，单叶互生。花单生叶腋或簇生枝梢顶端，花白色，形小不显眼。花期5月初到7月底。果实簇生于枝端。同一株果实可有红、黄、紫、白等各种颜色，有光泽，盆栽观赏很逗人喜爱。也可以食用，风味同青椒一样。',
        营养价值:
          '甜椒中含有很丰富的维生素A、B、C，β胡萝卜素，糖类、纤维质、钙、磷、铁能增强免疫力，对抗自由基的破坏，保护视力，还可以使皮肤白皙亮丽。经常食用可以强化指甲和滋养发根，对于肌肤有活化细胞组织功能，促进新陈代谢，使皮肤光滑柔嫩，具有美容的功效。可以预防微血管的脆弱出血、牙龈出血、眼睛视网膜出血、脑血管出血，也是糖尿病患者较宜食用的食物。\\n'
      }
    },
    {
      id: 339,
      name: '高汤',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、滋补养生：高汤营养丰富，尤其是蛋白质含量很高，能起到补脾胃，强筋骨的效果。\\n2、抗衰老：高汤中含有较多胶原蛋白，能起到促进微循环，抗衰老美容护肤的功效。\\n3、抗感冒：常食高汤能起到清除病毒，强身健体，抵抗感冒的作用。',
        简介:
          '高汤是烹饪中常用的一种辅助原料，以往通常是指鸡汤，经过长时间熬煮，其汤水留下，用于烹制其他菜肴时，在烹调过程中代替水，加入到菜肴或汤羹中，目的是为了提鲜，使味道更浓郁；根据菜肴不同，所用的高汤原料也不同，有鸡汤、牛肉汤、鲜鱼汤（奶白汤）几类，由于现代人们生活节奏的加快，没有时间充分熬制高汤，所以也有采用鸡精加温水调制的方法，也可以直接购买即时型高汤包或浓汤宝等速食产品代替高汤调味，同样可以起到提鲜的作用。',
        营养价值:
          '“高汤”又称鲜汤，通常指厨师自制用于烹饪的高级汤料，一般可分为毛汤、奶汤及清汤三大类。多数高汤是以富含呈鲜物质的鸡、鸭、猪、牛、羊、火腿、干贝、香菇等原料熬制的，汤中含有来自熬汤原料的核苷酸、呈味氨基酸、有机酸、肽类、含氮有机物等多种呈鲜物质。这些鲜味成分以及其他风味物质产生综合性的味道，使高汤的鲜味醇厚。高汤用于菜肴的制作，是许多市售调味品难以代替的。毛汤，可用于美化各种菜肴的味道;奶汤常用于高级筵席的奶汤类菜肴的制作;清汤常用于高级筵席的烧、烩或汤菜烹饪。不少厨师用自配的原料、相应的制法熬制出颇具特色的高汤，成为制作菜肴味型独特、口感丰满的“秘密技艺”。高汤能给麻、辣、鲜、香、滑、嫩、爽等各种风味增加柔和的感觉。它具有多物料的复合味感成分，又有原汁原味等特性，其鲜、香、滑、爽的调味效果迄今无调味品能与之媲美。\\n'
      }
    },
    {
      id: 342,
      name: '蘑菇',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、提高机体免疫力：蘑菇可以提高机体抵御各种疾病的免疫力。\\n2、镇痛、镇静：蘑菇中提取到一种物质具有镇痛、镇静的功效。\\n3、止咳化痰：蘑菇中发现其有明显的镇咳、稀化痰液的作用。\\n4、通便排毒：蘑菇中含有人体难以消化的粗纤维、半粗纤维和木质素，可保持肠内水分平衡。\\n5、蘑菇含有酪氨酸酶，对降低血压有明显效果。',
        简介:
          '蘑菇（学名：Agaricus campestris）是由菌丝体和子实体两部分组成，菌丝体是营养器官，子实体是繁殖器官。由成熟的孢子萌发成菌丝。菌丝为多细胞有横隔，借顶端生长而伸长，白色、细长，绵毛状，逐渐成丝状。菌丝互相缀合形成密集的群体，称为菌丝体。菌丝体腐生后，浓褐色的培养料变成淡褐色。蘑菇的子实体在成熟时很象一把撑开的小伞。由菌盖、菌柄、菌褶、菌环、假菌根等部分组成。蘑菇有药食作用。也被用于各种人物代称和卡通形象。',
        营养价值:
          '1.美味：蘑菇有除了酸甜苦辣咸以外的第六种味道——鲜。当它们与此外食品一路同化烹饪时，风味极佳，是很好的“鲜味补给”。\\n2.热量低：蘑菇里的营养有助心脏健康，并能增强免疫力。每餐蘑菇的热量概况只有20大卡，比吃年糕之类的热量少多了，是很好的减肥食品。\\n3.维生素D丰富：蘑菇不同于其他的蔬菜和果品，其中的维生素D含量很是丰富，有益于骨骼健康。阳光中的紫外线是促进蘑菇产生维生素D的重要物质。无论是采摘后的蘑菇还是没采摘的，都有此项功能。夏季紫外线比较强，可选择上午10点到下午3点区间的时间来晒蘑菇，这样只需晒一个小时就足够了。这样能够提高蘑菇中维生素D的含量。\\n4.抗氧化：蘑菇的抗氧化能力很强可以有效的延缓衰老\\n5.维生素A宝库：蘑菇所含蛋白质高达30%以上，每100克鲜菇中的维生素C含量高达206.28毫克，而且蘑菇中的胡萝卜素可转化为维生素A，因此蘑菇又有“维生素A宝库”之称。有的蘑菇中纤维素含量也超过一般蔬菜，能有效防止便秘。\\n6.营养丰富：蘑菇中的蛋白质含量多在30%以上，比一般的蔬菜和水果要高出很多。含有多种维生素和丰富的钙、铁等矿物质。最重要是它还含有人体自身不能合成却又是必须的8种氨基酸。\\n7.减肥：蘑菇中有大量无机质、维生素、蛋白质等丰富的营养成分，但热量很低，常吃也不会发胖。且蘑菇所含有很高的植物纤维素，可防止便秘、降低血液中的胆固醇含量。蘑菇中的维生素c比一般水果要高很多，可促进人体的新陈代谢。 [5] \\n8.独特鲜味减少食盐用量：蘑菇本身带有肉汤或肉的鲜味，而且由于这种鲜味很“冲”，在烹饪时能减少盐的使用。\\n一项研究表明：用蘑菇来替代墨西哥卷饼中80%的牛肉食材能让烹饪者减少25%的食盐用量，而且没有改变风味。 [6] \\n9.调节胆固醇：孟加拉学者进行的一项研究表明：食用蘑菇与参与者的总胆固醇和甘油三酯含量下降之间存在相关性。只要参与者停止食用蘑菇，这两项血生化指标就会回升'
      }
    },
    {
      id: 344,
      name: '肋骨',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {}
    },
    {
      id: 345,
      name: '冬菇',
      group: '食材',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        功效:
          '1、祛脂降压：能软化和保护血管，有降低人体中血脂和胆固醇的作用。\\n2、养肝：可助于肝脏结构和功能的维护和修复。适宜于肝病患者。\\n3、抑癌抗瘤：预防癌症，降低癌变的发生率。\\n4、其他功效： 防治感冒，降低胆固醇，防肝硬化，抗癌。',
        简介:
          '又名龙船香菇，盖因龙泉两字在龙泉土话里叫龙船，而庆元本来隶属龙泉管辖，后分县。景宁也未立县！唐末宋初在浙江已形成一定规模。龙泉、庆元、景宁等3个山区县是人工栽培冬菇的发祥地，至今每年仍有数万人在浙江或出省栽培冬菇，“龙”“庆”“景”三县素有“香菇之乡”的称号。冬菇规格严整，等级分明。分为花菇、厚菇、薄菇3等11级。冬菇含有丰富的蛋 冬菇\\n白质和多种人体必需的微量元素。冬菇嫩滑香甜，干菇美味可口，香气横溢，烹、煮、炸、炒皆宜，荤素佐配均能成为佳肴。冬菇还是防治感冒、降低胆固醇、防治肝硬化和具有抗癌作用的保健食品。',
        营养价值:
          '1、香菇含丰富的维生素D原，但维生素C甚少，又缺乏维生素A及A原。\\n2、菇蛋白质里包含18种氨基酸，人体必须的8种氨基酸里，香菇就占了7种，并且多属L型氨基酸，活性高，易被人体吸收，消化率高达80%。\\n3、香菇里含有大量谷氨酸和通常食物里罕见的伞菌氨酸、口蘑氨酸和鹅氨酸等，所以风味尤其鲜美。'
      }
    },
    {
      id: 2,
      name: '鱼香肉丝',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、准备材料\\n2、里脊肉切粗丝，加入适量盐、料酒和水淀粉腌制，倒少许油搅拌均匀，木耳、笋、青椒、胡萝卜切丝，葱姜蒜切末备用\\n3、准备两勺郫县豆瓣，用刀切切碎，将少许盐、适量生抽、糖、醋和淀粉加适量水调成酸甜口味的酱汁备用\\n4、热锅冷油，放入将浆好的肉丝放入，翻炒至变色\\n5、倒入切碎的郫县豆瓣，小火炒至析出红油\\n6、入葱姜蒜末中火炒至有香味\\n7、入蔬菜配料翻炒均匀\\n8、入调好的酱汁\\n9、汤汁烧开，收至浓稠，淋少许香油即可\\n',
        口味: '鱼香',
        工艺: '炒'
      }
    },
    {
      id: 10,
      name: '麻婆豆腐',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、主料；豆腐一块400克、牛肉末50克；调料：豆瓣酱30克、豆豉20克、盐2克、鸡粉2克、酱油15克、黄酒10克、大蒜末20克、肉汤300ml、水淀粉适量、花生油30克；配料：青蒜末30克、花椒面1克、香菜末5克。\\n2、先把豆腐切成2厘米见方的丁。\\n3、在清水里放少许盐。\\n4、把切好的豆腐在水中。\\n5、浸泡15分钟。\\n6、后捞出备用。\\n7、勺上火烧热，注入适量花生油便炒肉末。\\n8、末变色后下入郫县豆瓣酱煸炒\\n9、炒出香味后下入豆豉煸炒\\n10、把豆豉煸炒出香味后，下入蒜末煸炒。\\n11、然后烹入黄酒炒匀。\\n12、炒香以上材料后倒入肉汤煮开。\\n13、然后放入适量的酱油。\\n14、用盐调味。\\n15、然后下入豆腐煮开。\\n16、豆腐煮大约3-5分钟。\\n17、然后放入少许鸡粉提鲜。\\n18、用水淀粉勾芡。\\n19、此时要边摇锅边用手勺推动锅底，使豆腐不至糊锅，当淀粉彻底糊化后便可出锅码盘。\\n20、装盘以后趁热均匀的撒上一层花椒面。\\n21、然后，撒上青蒜末和少许香菜末，假如不喜香菜可不放。此菜至此便告全部操作完成。\\n',
        口味: '微辣',
        工艺: '炒'
      }
    },
    {
      id: 16,
      name: '辣子鸡',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、原料如上图。干辣椒剪开就比较辣，我一半剪开一半没剪开。\\n2、鸡肉切块，用盐一茶匙，生抽一汤匙，五香粉一茶匙，白糖半茶匙，料酒两汤匙，食用油半汤匙腌30分钟\\n3、烧开水，把鸡肉迅速放进去，煮开，倒一汤勺白酒。再次煮开捞出来洗净控干。\\n4、鸡肉放进八成热油，大火半煎半炒到金黄，油不要多。微黄的时候，捞出来，再放进去一次。\\n5、二次复炸完，把油全部滤掉，放入盐，孜然粉，花椒粉，炒匀。\\n6、入干辣椒，蒜片，八角，花椒，炒出香味，干辣椒变酥脆即可。放入油炸花生米，拌匀，撒一点鸡精就可以出锅了。\\n',
        口味: '麻辣',
        工艺: '炒'
      }
    },
    {
      id: 19,
      name: '糖醋里脊',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、原料图如图所示。姜磨成泥，挤出汁备用。\\n2、里脊肉切成等量大小的方块，用一个筷子放在下面，横着切成片，竖着切成条，底部不断。\\n3、切好的里脊丝，用盐，胡椒（白胡椒最好），蛋清，姜汁，抓匀腌渍十分钟。\\n4、腌渍好的里脊丝，用干淀粉拌均匀，抖落一下附在上面的淀粉，放在漏勺里备用。\\n5、漏勺浸入八成热油里，迅速炸定型，捞出来，复炸一次。里脊肉不要炸时间长，老了就硬，正好的才会吃起来外酥里嫩。\\n6、好的里脊装盘备用。\\n7、淀粉放入一点芝麻备用。\\n8、里放番茄酱，白糖，半碗水，一起熬滚以后，煮一分钟。勾芡。\\n9、芡。浇在立即肉上即可。\\n',
        口味: '酸甜',
        工艺: '调味'
      }
    },
    {
      id: 25,
      name: '酸辣土豆丝',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、准备材料，土豆、葱姜蒜、花椒、干红辣椒、盐、糖、醋。\\n2、将土豆切成整齐的大薄片，这是切出均匀的丝的要点。\\n3、再将土豆片切成细丝。\\n4、用清水将切好的土豆丝泡去淀粉，（这样炒出的土豆丝清爽不粘）。\\n5、将葱切末、辣椒剪成小段、蒜切末、红椒切丝、姜切末。\\n6、内放油放入花椒煸炒出香味。\\n7、炸好的花椒捞出，锅内放入葱、姜、蒜末、辣椒段煸炒出香味。\\n8、入泡好的土豆丝。\\n9、炒一小会后倒入适量醋继续翻炒土豆丝。\\n10、放入红椒丝翻炒均匀。\\n11、最后加葱花、适量盐、糖、鸡精调味即可。\\n12、简单但不失美味的酸辣土豆丝。\\n',
        口味: '酸辣',
        工艺: '炒'
      }
    },
    {
      id: 31,
      name: '年年有余水煮鱼',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、材料：草鱼、黄豆芽调味：鸡蛋清、姜、蒜、郫县豆瓣酱、辣椒若干、花椒适量、盐、淀粉、料酒。\\n2、将草鱼去腮、内脏处理干净。\\n3、切下头、尾留用，沿中间鱼骨将鱼肉片成两片。\\n4、鱼皮朝下，斜刀切除鱼身的大刺片，再切成薄厚适中的鱼片。\\n5、鱼皮朝下，斜刀切除鱼身的大刺片，再切成薄厚适中的鱼片。\\n6、、蒜切片，干辣椒掰成小段。\\n7、片中倒入一个蛋清，加盐、料酒、淀粉抓匀后腌制20分钟。\\n8、豆芽掐根部，洗净备用。\\n9、豆芽入加入少许盐的清水中煮至软、至熟捞出。\\n10、铺在装水煮鱼的容器底部。\\n11、锅置火上倒入油，下花椒慢炸约2分钟。\\n12、倒入干辣椒和豆瓣酱，炒出香味和红油。\\n13、待辣椒变色，捞出一半的花椒、辣椒待用；将蒜片和姜倒入锅中，炒出香味。\\n14、倒入鱼头、尾、鱼骨炒匀。\\n15、加入适量热水，没过鱼即可。\\n16、水沸后，将鱼片一片片放入锅中，并用筷子轻轻搅散。\\n17、煮到鱼片变色至熟，约1~2分钟，即可。\\n18、将锅中的鱼片、鱼汤倒入铺好豆芽的碗中。\\n19、将事先盛出的花椒、辣椒铺于碗中，淋入热油即可。\\n',
        口味: '麻辣',
        工艺: '煮'
      }
    },
    {
      id: 35,
      name: '宫保鸡丁',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、原料图如图。\\n2、鸡胸肉用刀背拍一下，切成大拇指甲大小的丁。\\n3、用料酒一汤匙，食用油半汤匙，白胡椒半茶匙，盐半茶匙，淀粉一茶匙，腌渍十分钟入味。\\n4、葱切段。\\n5、锅里放油，七八成热下鸡丁炒变白。\\n6、入干辣椒，葱和一茶匙花椒粉，炒出香味。\\n7、入料汁，大火炒到粘稠干松即可。\\n8、火，拌入花生米即可。\\n',
        口味: '酸辣',
        工艺: '炒'
      }
    },
    {
      id: 40,
      name: '鱼香茄子',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、主料：紫皮茄子、青红椒、姜、蒜、葱配料：郫县豆瓣酱、油、盐、淀粉、生抽、老抽、蚝油、醋、糖、麻油、水\\n2、茄子切成条，放入盐水中浸泡十分钟；再捞出沥干水分，撒一些干淀粉拌匀；（用盐水浸泡后再裹一些干淀粉可以使茄子在油炸过程中少吸油）\\n3、锅中放入适量油，烧7成热，把茄子放入炸，注意保持中火和不停翻动，以免炸糊；捞的时候用勺子按压一下炸过的茄子，可以再控出一些油来。\\n4、炒锅内留少许底油（油一定要少，因为茄子本身有油了），放入姜蒜爆香后加豆瓣酱翻炒；\\n5、加入青红椒翻炒；\\n6、入炸好的茄子同炒；最后倒入事先调好的调味汁（盐、淀粉、生抽、老抽、蚝油、醋、糖、麻油、水）翻炒均匀即可。\\n',
        口味: '鱼香',
        工艺: '炒'
      }
    },
    {
      id: 43,
      name: '红红火火水煮肉片',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、切好的肉片用淀粉、盐、料酒 鸡蛋抓匀，备用。\\n2、上好浆的肉片腌制20分钟。\\n3、油菜洗净焯水，焯好的青菜放在大腕里。\\n4、锅中放油烧热。\\n5、下入腌好的肉片。\\n6、炒肉片变色成出备用。\\n7、中留底油，爆香花椒，下入泡椒 郫县豆瓣炒出香味后倒入麻辣烫油。\\n8、入适量高汤或者清水，放适量盐，烧开。\\n9、肉片滑入锅中的水中，拨散开稍煮。\\n10、全部倒在刚才的菜上面，在肉片上面撒上比较大量的花椒和干辣椒 芝麻。\\n11、另起一锅，倒入油，烧烫。\\n12、浇在肉片上即可。\\n',
        口味: '麻辣',
        工艺: '煮'
      }
    },
    {
      id: 47,
      name: '豉香回锅肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、准备材料：五花肉，青蒜，红椒（颜色好看）。\\n2、将五花肉洗净，锅中放入适量水和姜片、葱段、八角、，水开后放入肉煮至8分熟（约10分钟，用筷子能戳透肉），捞起用冷水稍浸，沥干。\\n3、将肉切成约4厘米宽、5厘米长、0.3厘米厚左右的薄片。青蒜红椒切段，葱切段，姜、蒜切片。\\n4、炒锅烧热，放少许油，下肉片略炒至肉片微卷曲并出油（这样吃起来不会太油腻）。\\n5、锅中留底油，炒香葱姜蒜后，加郫县豆瓣酱一汤匙，甜面酱小半匙，豆豉一汤匙炒出红油。\\n6、下入五花肉和红椒翻炒均匀。\\n7、入料酒和少许生抽、糖翻炒。再加入青蒜段炒至断生即可。\\n8、锅趁热吃吧。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 53,
      name: '水煮肉片',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、主料:猪里脊1条清洗干净，放入冰箱稍冻一会，这样肉片会切的更薄。\\n2、配料:油菜、金针菇、绿豆牙。\\n3、将金针菇切掉根部清洗干净、绿豆芽掐去根部清洗干净，油菜清洗干净。\\n4、将猪里脊切薄片。\\n5、加入少量生抽、适量料酒、白糖、淀粉、胡椒粉、清水将里脊腌制20分钟。\\n6、锅烧热加入植物油，将肉片煸炒。\\n7、变颜色约七分熟时盛出备用。\\n8、起锅放入姜、蒜、陴县豆瓣酱炒香。\\n9、入适量清水烧开，把青菜放入烫熟。\\n10、青菜盛在较大的容器里。\\n11、将肉片放入锅中大火烧开即可。\\n12、将肉片盛在青菜上，倒入汤。\\n13、在上面放入麻椒、干红辣椒，锅内烧热油浇在上面即可。\\n',
        口味: '麻辣',
        工艺: '煮'
      }
    },
    {
      id: 58,
      name: '油焖大虾',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、从市场买来的青虾一斤。\\n2、用干净的剪刀剪去虾枪、虾须，去掉沙线，然后加少许料酒腌制一下去腥。\\n3、葱姜切小段备用。\\n4、锅热后放入比平时炒菜略多一点的花生油。\\n5、油热后放入腌制好的虾。\\n6、虾的一面变红后放入葱姜丝，然后翻面。\\n7、入由白糖、白醋、生抽、盐调制好的汁，焖2-3分钟左右。\\n8、汤汁收的差不多即可出锅开吃了。\\n',
        口味: '酸甜',
        工艺: '焖'
      }
    },
    {
      id: 60,
      name: '鲫鱼豆腐汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、鲫鱼洗净。\\n2、平底锅烧热，放入少量油，将鲫鱼放入。\\n3、煎至两面呈金黄色，（煎的过程中火力不能小，要中火、中大火相互转换为宜，将两面煎成金黄色），依次加入大葱片、姜片。\\n4、加入热水。\\n5、加入料酒。\\n6、火烧开后继续煮7、8分钟，转中小火煮20分钟左右。\\n7、后加入豆腐煮熟。\\n8、锅前调入盐，撒上葱花即可（鱼汤本身就很鲜，所以不建议再加鸡精或味精）。\\n',
        口味: '咸鲜',
        工艺: '煮'
      }
    },
    {
      id: 63,
      name: '醋溜白菜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、先把白菜洗净。\\n2、切成小块。\\n3、葱、姜、蒜切碎，白糖、醋、酱油、盐、味精放到一起调匀。\\n4、锅里放油，放入葱、姜、蒜煸炒出香味。\\n5、先放入白菜帮翻炒。\\n6、制白菜帮变软。\\n7、后放入白菜叶翻炒。\\n8、入调料汁翻炒片刻即可。\\n9、锅装盘，即可享用。\\n',
        口味: '酸甜',
        工艺: '炒'
      }
    },
    {
      id: 65,
      name: '糖醋鲤鱼',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、鲤鱼一条。\\n2、葱姜蒜及调料。\\n3、鲤鱼收拾干净后，沥干水，在鱼身两面个2.5厘米各斜切一刀（先立切1厘米深，再平切2厘米深）。\\n4、用胡椒粉、生抽和少许盐略腌。\\n5、将生抽、糖、醋、料酒、番茄酱、清水调成糖醋汁待用。\\n6、粉、面粉调成糊、均匀抹在腌好的鱼上。\\n7、烧至七成热，提起鱼尾，先将鱼头入油稍炸。\\n8、舀油淋在鱼身上，待面糊凝固时再把鱼慢慢放入油锅内。\\n9、鱼炸至金黄色，捞出控油放入盘中待用。\\n10、炒锅内留少许油，放入葱花、姜末、蒜末爆香，再倒入调好的汁。\\n11、加少许湿淀粉收浓起锅浇在鱼身上即可。\\n',
        口味: '酸甜',
        工艺: '溜'
      }
    },
    {
      id: 68,
      name: '红烧鱼块',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、洗净的鱼切块。\\n2、鱼切放碗里加适量盐，料酒和几片姜腌制半小时。\\n3、大葱白，姜，蒜，香葱分别切末。\\n4、把酱油 蚝油 白糖 醋 适量水 调成汁。\\n5、腌好的鱼块吸干水份。\\n6、里放油，把鱼入锅中小火煎至两面发黄。\\n7、出。\\n8、起锅放油炒香姜 蒜，大葱末。\\n9、煎好鱼块入锅炒匀。\\n10、再把调好的汁倒入。\\n11、可以再加少许水没过鱼块。\\n12、中小火烧至收汁即可。\\n',
        口味: '咸鲜',
        工艺: '烧'
      }
    },
    {
      id: 72,
      name: '甜甜蜜蜜拔丝山药',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、材料：山药、绵白糖、辅料：生粉、植物油.\\n2、山药去皮切滚刀块。（最好带一次性手套，防止粘液刺激皮肤过敏）。\\n3、用清水泡洗山药块，沥干水分。\\n4、拍上少许生粉。\\n5、锅置火上加适量油烧至7成热，逐一下入山药块。\\n6、至脆硬时捞起沥油。（喜欢面口的可复炸至金黄色捞出）。\\n7、内抹少油防粘。\\n8、起锅加入植物油、绵白糖，比例为1:3。\\n9、火不停的搅动。\\n10、待糖溶解，继续搅拌。\\n11、待糖浆变稀，色泽淡黄。（千万不能温度高了，就功亏一篑了糖就会变苦成焦糖了）\\n12、迅速放入炸好的山药块。\\n13、关火翻炒均匀即可。\\n',
        口味: '甜味',
        工艺: '拔丝'
      }
    },
    {
      id: 76,
      name: '柠檬可乐鸡翅',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、鸡翅洗净，葱姜切大片，柠檬切两半。\\n2、先给洗净的鸡翅用牙签来做个针灸，孔越多越好，方便入味。\\n3、扎了孔的鸡翅用酱油，葱姜片，盐，料酒，和适量柠檬汁腌30分钟以上。\\n4、然后把腌过的鸡翅入5成油锅炸三四分钟，外皮金黄即可捞出。\\n5、炸好的鸡翅和之前腌鸡翅的料再加半瓶可乐一起放入炒锅中大火烧开。\\n6、小火炖。\\n7、火炖至汁快收干时改大火收汁，再挤几滴柠檬汁再鸡翅上即可食用。\\n8、锅装盘。\\n',
        口味: '咸甜',
        工艺: '烧'
      }
    },
    {
      id: 80,
      name: '酱牛肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、牛肉650克。\\n2、丁香.白芷各10克.冰糖7粒.干辣椒5个.花椒10克.八角2个.香叶5片。\\n3、姜5片.蒜5头.葱2根。\\n4、牛肉洗净用餐叉在牛肉上扎小孔以便腌制时好入味。\\n5、牛肉放入容器里.放入切好的姜蒜片.葱段.加适量的盐.老抽.料酒.鸡粉。\\n6、匀后腌制二小时以上。\\n7、里放少量的油.小火放入冰糖炒化后加入适量的水.放入腌好的牛肉.连腌汁一 起到入。\\n8、火煮开.撇清浮沫.然后再把所有准备的香料倒入锅内.中小火煮至牛肉用筷子能顺利扎透就可关火。\\n9、好的牛肉继续留在锅内自然晾凉。\\n10、切片码入碟放上香菜即可上桌。\\n',
        口味: '酱香',
        工艺: '酱'
      }
    },
    {
      id: 90,
      name: '拔丝地瓜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、地瓜削皮切块。\\n2、炸~油烧开后改成小火后放入地瓜~~地瓜容易上色~~火不要大了。\\n3、炸成这样即可。\\n4、适量水和冰糖~慢火先将冰糖烧化。\\n5、冰糖溶化后开始起小泡~~慢慢变成大泡。\\n6、液慢慢变稠~糖色也变深。\\n7、泡越来越小越来越密就OK了。\\n8、上倒入地瓜块翻匀即可。\\n9、凉就可以吃咯。\\n10、可以当饭吃哦。\\n',
        口味: '甜味',
        工艺: '拔丝'
      }
    },
    {
      id: 92,
      name: '鲁味红烧茄子',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、准备好所有的食材。\\n2、青红椒洗净切条，蒜瓣切末。\\n3、茄子洗净切条用淡盐水浸泡10分钟。\\n4、取一个小碗加入，盐，老抽，生抽，醋，糖，鸡精，蒜末，水淀粉拌均匀成为料汁备用。\\n5、锅中油烧热，放入挤干水分的茄子炸制茄子变软捞出沥油。\\n6、锅留少许底油爆香葱姜。\\n7、入青红椒翻炒均匀\\n8、入炸好的茄子翻炒。\\n9、入调好的料汁翻炒均匀。\\n10、淋入少许香油。\\n11、翻炒均匀盛盘时撒香菜即好。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 97,
      name: '京酱肉丝卷',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、准备好肉丝，用腌料腌制20分钟，不需要切太细。\\n2、在腌肉的过程中，我们将豆腐皮入沸水中焯两分钟。\\n3、焯好的豆腐皮过一下凉水，切去四周的硬皮，再切成方形块。\\n4、准备好大葱丝和黄瓜丝。\\n5、将番茄酱、甜面酱和蚝油准备好。\\n6、匀。\\n7、里加肉，油热后放入姜末，炒出香味后，放入肉丝，滑炒至变色捞起。\\n8、里再加适量的油，放入准备好的酱料翻炒片刻，倒入肉丝，将酱料均匀裹在肉丝上即可。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 102,
      name: '豆腐香菇汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、料：水豆腐1块钱 新鲜香菇9个  香葱1棵  生姜1小块 、 调料：调和油半汤勺  料酒1汤勺 盐巴适量 味精适量\\n2、把香菇洗净豆腐切小块，香葱和生姜洗净切好备用。、\\n3、锅内倒油把香葱爆香\\n4、倒入香菇翻炒待香菇炒软以后倒入高汤或开水.。\\n5、倒入料酒、\\n6、入豆腐和生姜开大火待汤开。\\n7、出锅前倒入和味精调好味。\\n8、以上桌了\\n',
        口味: '清淡',
        工艺: '煮'
      }
    },
    {
      id: 106,
      name: '佛跳墙',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、先把姜片铺在罐底。\\n2、然后铺上冬笋片。\\n3、依次铺上香菇。\\n4、再放入熟鸡肉。\\n5、同时放入虾肉。\\n6、入瑶柱。\\n7、放入鹌鹑蛋。\\n8、后放入广肚。\\n9、上鱼翅，并把鱼翅铺平。\\n10、最上面放上一只小鲍鱼。\\n11、把一半花雕酒舀入罐内。\\n12、炒勺上火注入上汤。\\n13、倒入另一半花雕酒煮开。\\n14、用少许盐调味。\\n15、再撒入少许胡椒粉。\\n16、把汤舀入罐内。\\n17、盖好罐的盖子。\\n18、用保鲜膜把罐子包上。\\n19、要把罐子密封的严谨一些。\\n20、把密封好的罐子放入笼中。\\n21、盖好锅盖，用中火蒸两小时。\\n22、蒸好后取出，用剪刀剪开保鲜膜。\\n23、在罐子下垫上垫盘便可上桌食用。\\n',
        口味: '其他',
        工艺: '焖'
      }
    },
    {
      id: 116,
      name: '七星鱼丸',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、将草鱼宰杀干净，轻拍取出鱼线后顺着鱼骨用刀将鱼肉和鱼骨分开，另一次同样处理。\\n2、去掉脊骨、主刺，顺纤维纹路刮取鱼肉。（接近鱼皮的鱼肉肌红蛋白较多，色泽较深，会影响鱼丸色泽洁白的效果，所以不用刮掉。）\\n3、用洁净的纱布包裹鱼肉，漂浮于清水中，以去除血筋和混浊杂质。\\n4、直至鱼肉呈白色，然后用洁净纱布滤去水。\\n5、虾去壳，挑出虾线洗净待用。\\n6、鱼肉、虾仁平放在砧板上，用擀面杖敲打。\\n7、至鱼肉稍有转白，手感有粘性，使鱼肉全部成泥。\\n8、馅中加入生抽2勺、盐1/2勺、白糖1/3勺，搅拌均匀。\\n9、味后的肉馅中加入葱姜水，搅拌至上劲。\\n10、做成个头均匀、大小一致的丸子。\\n11、将鱼肉泥放于容器内，先加入鱼泥1/3左右的清水、玉米淀粉、盐，用力搅打均匀。\\n12、用力搅打以后，鱼泥蛋白质疑胶，呈透明状；放入少许猪油搅拌均匀待用。\\n13、双手抹少许化猪油，取适量鱼泥包入馅料，搓圆。\\n14、砂锅置于火上，倒入高汤烧至温热。\\n15、将鱼丸逐一下入锅中，改用旺火烧沸。待其表面蛋白质相对凝固后，用手勺背部顺锅边下入轻轻推动，防止丸子粘住锅底而损坏其形状。\\n16、撇去浮沫后改中小火汆至鱼丸刚熟透，盛入汤碗，撒上少许葱末、胡椒粉、香油即成。\\n',
        口味: '清淡',
        工艺: '氽'
      }
    },
    {
      id: 120,
      name: '青椒酿肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、肉馅加入盐、料酒、生抽、耗油，姜末、鸡蛋搅拌均匀。\\n2、调汁：1勺生抽、1勺蚝油、少许老抽和白糖！半勺淀粉加水搅匀成水淀粉！姜蒜切末。\\n3、青椒洗净去除里面的籽。\\n4、用筷子把肉陷往里塞、尽量塞满。\\n5、全部做好备用。\\n6、入适量油烧至五六成热、放入酿好的青椒。\\n7、青椒煎至表面起皮成虎皮壮、盛出。\\n8、余的油把姜蒜末炒香。\\n9、入调好的汁烧开。\\n10、放入煎好的青椒烧开后调中火焖煮五六分钟。\\n11、煮至汤汁浓稠时、用水淀粉勾芡。\\n12、成品。\\n13、成品。\\n',
        口味: '咸鲜',
        工艺: '烧'
      }
    },
    {
      id: 126,
      name: '香菇青菜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、先把青菜摘洗干净。\\n2、香菇洗净，去掉根蒂部分。\\n3、把香菇切开。\\n4、放到热水里淖一下。\\n5、锅里放油，放入姜丝煸炒。\\n6、入香菇翻炒。\\n7、耳摘洗干净，放入锅中翻炒。\\n8、炒均匀。\\n9、菜过热水淖一下，放入锅中。\\n10、翻炒均匀。\\n11、放入盐、味精调味，即可出锅。\\n12、盛入盘中，即可享用。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 131,
      name: '太极芋泥',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、芋头洗净，蒸熟，去皮，碾成泥。\\n2、加入白糖。\\n3、再加入熟猪油、少许清水调成软硬适度的膏状。\\n4、将调好芋头泥和红豆沙馅码入盘中，码成太极图形，用刀抹平。\\n5、用小号裱花嘴在西红柿皮和青椒上刻出小圆形。\\n6、别放在芋头泥和豆沙馅上做装饰。\\n',
        口味: '甜味',
        工艺: '蒸'
      }
    },
    {
      id: 137,
      name: '花旗参乌鸡汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、把所有材料准备好。\\n2、红枣洗干净，去核。\\n3、花旗参泡一下后切成片（花旗参片可省略此步骤）。\\n4、瘦肉洗干净，切成小块。\\n5、乌鸡洗干净，切成大块。\\n6、进煮开水的锅，大火煮一下，逼出污血。\\n7、出，用清水冲洗干净浮沫，并沥干水分备用。\\n8、锅中注入适量清水，加入所有材料，插上电源，高火煮开后转中低火煮1.5小时。\\n9、的时候，按个人口味调入适量盐。\\n',
        口味: '清淡',
        工艺: '炖'
      }
    },
    {
      id: 142,
      name: '荔枝鸡球',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、准备材料。\\n2、鸡肉剁成肉末，加一个鸡蛋、盐、蚝油、料酒。\\n3、顺时针搅拌至上劲。\\n4、用手湿水搓成丸子放油锅里中火炸成金黄色。\\n5、荔枝剥去壳去核，彩椒切成块。\\n6、锅热油，爆香葱姜。下彩椒翻炒。\\n7、入荔枝肉、丸子，将花椒粉、鸡精、盐、蚝油、水淀粉调成汁倒入。\\n8、葱段，烧沸即可。\\n9、热吃吧。\\n',
        口味: '咸甜',
        工艺: '炒'
      }
    },
    {
      id: 146,
      name: '田园骨头汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、准备好材料\\n2、锅中烧水，放入骨头、姜片、料酒将水烧开\\n3、骨头煮至没了血水后，捞出放清水中冲洗干净，捞出沥水\\n4、胡萝卜去皮，切成段，甜玉米也切成段\\n5、砂锅中放水，放入焯好水的骨头，姜片，料酒，醋煮三十分钟\\n6、入胡萝卜，玉米后再煮三十分钟，加入盐即可食用\\n',
        口味: '咸鲜',
        工艺: '炖'
      }
    },
    {
      id: 149,
      name: '包心鱼丸',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、虾仁剁成泥与五花肉末混合拌匀，加入葱末、盐、酱油、香油、鸡精、糖拌成馅。\\n2、再捏成小丸子备用。\\n3、鱼肉用刀背碾成泥。\\n4、加入盐和适量水。\\n5、顺着一个方向搅至上劲成糊状。\\n6、入地瓜淀粉，拌匀制成鱼胶。\\n7、中倒入清水备用。手上蘸一些清水，取适量鱼胶。\\n8、入一个肉丸。\\n9、成圆形。\\n10、放入水中煮熟，捞出，盛入容器中。锅中倒入高汤，加盐和鸡精烧开，浇在鱼丸上，最后淋上香油和葱末即可。\\n',
        口味: '咸鲜',
        工艺: '煮'
      }
    },
    {
      id: 153,
      name: '白萝卜猪蹄汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、准备好材料。\\n2、萝卜洗净切大块； 姜切片；\\n3、锅中加水加几片姜烧开，入猪蹄汆水；\\n4、然后汤锅中下白萝卜、猪蹄、姜片4片，加水4大碗，烧开后撇去浮沫，转小火煲2个小时即可。         喝时加盐调味~~\\n',
        口味: '咸鲜',
        工艺: '煲'
      }
    },
    {
      id: 157,
      name: '清蒸鲈鱼',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、原料，一半姜葱切细丝泡水备用（装饰用）。\\n2、鲈鱼画花刀，用半汤匙蒸鱼豉油，香葱，姜丝，盐，胡椒粉腌渍五分钟。\\n3、腌渍的葱姜铺下面。\\n4、鱼站里起来，身上撒点香葱姜丝，淋半汤勺猪油，开水上锅，蒸四分钟倒掉蒸鱼盘里的水，放三汤匙米酒继续蒸三分钟。\\n5、不要揭开锅盖，焖五分钟。\\n6、取出来，葱姜扔掉，汤汁浇在鱼身上，若是在家吃不换盘子也成，我换盘子的时候，没有用器具，直接倾斜盘子，鱼自己滑进另一个盘子。\\n7、烧热，浇在鱼身上。也可以不浇，但是我强烈的认为，浇了才好吃！\\n8、后装饰一下，嘴里塞个圣女果，身上撒上泡水的葱姜，要是红辣椒更好看，我没买。\\n',
        口味: '原味',
        工艺: '蒸'
      }
    },
    {
      id: 159,
      name: '双皮奶',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、材料：纯牛奶、白糖、鸡蛋、蜜豆、草莓\\n2、牛奶倒入锅中煮热，但不能煮开。\\n3、趁热倒在碗里，不久牛奶表层结出奶皮。\\n4、用筷子将奶皮刺穿，缓缓地将碗里的奶倒出，留少许奶液防止奶皮粘底。\\n5、鸡蛋打散取蛋白，加入2勺白糖搅匀。\\n6、液倒入牛奶中搅匀。\\n7、筛网过滤，去除表面的泡沫、气泡。\\n8、延碗边慢慢倒回原来的碗里，奶皮慢慢地浮起。\\n9、上保鲜膜入蒸锅，大火蒸10分钟，关火再焖2-3分钟即可。\\n10、取出后依个人口味加入蜜豆、莲子、水果类食用。\\n',
        口味: '甜味',
        工艺: '蒸'
      }
    },
    {
      id: 163,
      name: '可乐鸡翅',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、准备好可乐，鸡翅解冻好洗净，切好葱白，姜片。\\n2、锅内倒凉水，把鸡翅放入，倒入1茶勺料酒，盖上锅盖煮。\\n3、煮至血沫烧出后，继续烧2分钟左右。\\n4、然后捞出用清水冲洗干净后，沥干水分备用。\\n5、锅烧热，把鸡皮那面朝下先煎黄再翻面。（煎出油份后吃着不会觉得腻）\\n6、入1厅的可乐没过鸡翅，加入姜片和葱白，倒入半小勺老抽，和半小勺生抽。\\n7、上锅盖大火烧开后转中火烧。\\n8、至汤汁浓稠后，把姜片和葱白捞出，继续烧2分钟左右即可。\\n9、健康的做法，用百事可乐做的可乐鸡翅口感最甜；可口可乐做的可乐鸡翅甜味适中；健怡可乐做的可乐鸡翅甜味最淡。\\n10、很香的呦，怎么吃都不腻呢！\\n11、简单又实惠呢，赶紧试试吧！\\n12、可乐味道的呢！\\n',
        口味: '甜味',
        工艺: '烧'
      }
    },
    {
      id: 165,
      name: '梅菜扣肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、将正正方方的肥瘦相间的五花肉块放入冷水中，加入姜片和适量白酒；\\n2、 大火煮开， 捞去浮沫， 再转为小火；\\n3、  一直煮到用筷子很容易的插入进去后关火， 捞出来放入冷水中浸泡；\\n4、  凉后在厨房纸巾上控干水分； 煸炒；\\n5、 烧热锅，放入适量的油，将五花肉肉皮向下放入里面去炸；\\n6、直至将五花肉表皮炸至金黄；\\n7、再次捞出后放入冷水中浸泡；\\n8、烧热锅，放少许油，下入大片的葱姜煸炒；\\n9、出香味后放入泡发的梅干菜继续翻炒；\\n10、 加入少许的盐和糖等调味， 翻炒均匀；\\n11、盛入碗中， 挑出姜葱；\\n12、 冷却后的五花肉块切成厚薄适中的片；\\n13、 放入碗中， 再加入适量的盐、腐乳汁、生抽、料酒和白糖；\\n14、  抓均匀后腌制一个小时以上，将腌制好的肉片码放在碗底，\\n15、上面铺满炒过的梅干菜；\\n16、  菜上扣个盘，高压锅上汽后转为小火蒸上25分钟；\\n17、 拿出来后倒扣， 盘在下面；\\n18、 最后再表面上撒些小葱末， 这样色香味诱人的大年菜“梅菜扣肉”就完成了。\\n',
        口味: '咸鲜',
        工艺: '蒸'
      }
    },
    {
      id: 171,
      name: '蚝油杏鲍菇',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、准备材料\\n2、杏鲍菇胡萝卜切滚刀块，青椒切片。\\n3、锅里倒油，烧热倒入杏鲍菇胡萝卜姜片，煸炒到杏鲍菇发软。\\n4、倒入蚝油，调入盐翻炒均匀。\\n5、大火把锅里炒出的水收一下。\\n6、入青椒炒断生即可。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 173,
      name: '菠萝咕噜肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、原料图，菠萝加冰糖煮成糖水菠萝。姜磨姜汁备用。\\n2、猪里脊一面斜切花刀，切好翻面再切一遍。然后切成一口大小的肉块。\\n3、淀粉和面粉混合，彩椒切块，洋葱切块。肉用盐，胡椒粉，姜汁，蛋清腌渍半小时。\\n4、肉均匀的沾一层粉，用手拍打掉多余的面粉，全部沾好备用。\\n5、油烧八成热，下肉团炸微黄，捞出来，继续烧油，再下入一次。\\n6、到自己想要颜色浅一点的时候，捞出来备用。\\n7、里放三分之一汤匙食用油，炒一下彩椒和洋葱片，炒均匀。\\n8、入一汤匙番茄酱，一茶匙糖，炒匀。放半碗煮菠萝的糖水，一茶匙盐，调成合口的酸甜汁，至汤汁粘稠。\\n9、放进去翻均匀，沾匀汤汁即可。出锅放点鸡精提味即可。\\n',
        口味: '酸甜',
        工艺: '炸'
      }
    },
    {
      id: 178,
      name: '豉油鸡',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、鸡肉洗净放盘内备用。\\n2、姜切丝，蒜切末备用。\\n3、锅内倒入适量花生油。\\n4、再倒入同等量的酱油。\\n5、倒入少许香油。\\n6、少许盐。\\n7、锅内的料调和均匀。\\n8、鸡肉放入锅内使每块鸡肉上都沾上酱汁。\\n9、上锅内中火煮。\\n10、待开锅冒气10秒后改小火打开锅盖翻动一下每块鸡，再盖上锅盖煮一分钟再翻，用同样的方法直到鸡肉熟。\\n11、加入蒜米和姜丝，再焖煮2分钟。\\n12、把鸡肉斩块，锅内酱汁倒在鸡肉上即可。\\n',
        口味: '咸鲜',
        工艺: '焖'
      }
    },
    {
      id: 180,
      name: '鱼香茄子煲',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、茄子切小块\\n2、姜,蒜,葱,泡椒切成末\\n3、烧开水,放切好的茄子,水再开后煮二分钟捞出放砂锅中\\n4、猪肉剁成蓉,加盐,料酒,酱油腌制15分钟\\n5、醋,美极鲜,料酒,白糖,花椒粉,酱油,调成鱼香汁\\n6、锅烧热,加入油,放红油豆瓣酱炒香\\n7、入蒜末,葱末,姜末,泡椒粒一起炒香\\n8、入腌制好的肉末煸炒\\n9、入鱼香汁煮开\\n10、把肉末鱼香汁烧开后倒入焯好水的茄子中,盖上盖,焖煮十五分钟,撒上葱花即可\\n',
        口味: '咸鲜',
        工艺: '煲'
      }
    },
    {
      id: 186,
      name: '蚝油生菜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、生菜一斤洗干净。\\n2、葱蒜切碎末，一勺蚝油、一勺生抽、一勺淀粉，加水调成蚝油汁。\\n3、生菜放入开水中烫熟，水里放少许糖。\\n4、烫熟的生菜沥水装盘。\\n5、热锅下油，爆香葱白蒜末。\\n6、入调好的蚝油汁，小火慢熬至浓稠，用铲子画圈，约两三分钟。\\n7、好蚝油汁后关火，撒上葱花，淋在生菜上。\\n8、拌就可以吃了。\\n',
        口味: '酸甜',
        工艺: '拌'
      }
    },
    {
      id: 188,
      name: '蒜茸粉丝蒸虾',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、粉丝用清水泡软。\\n2、虾去头去虾线。\\n3、将虾沿背部剖开。\\n4、用刀在虾肉上按图中方向纵切几刀，不要把虾肉切断。（这样是为了防止虾在蒸熟后扭曲）\\n5、将泡好的粉丝剪成两段，平铺在盘中。\\n6、剖好的虾摆好造型。\\n7、蒜和青椒红椒切末。\\n8、内放油烧至6成热，下一半的蒜末炸成金黄色关火后放入另一半蒜末，用余温爆香。\\n9、蒜末中加入一品鲜酱油和适量清水，咸度不够可以加盐。\\n10、将蒜茸料汁浇在虾上，锅内水开后大火蒸5-8分钟。出锅后撒青红椒装饰。（由于虾是剖开的容易熟，所以蒸的时间不要过长）\\n',
        口味: '咸鲜',
        工艺: '蒸'
      }
    },
    {
      id: 192,
      name: '美味土豆饼',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、准备食材，将土豆事先煮熟。\\n2、将煮熟的土豆捣成土豆泥。\\n3、将香葱、火腿切碎。\\n4、放在土豆泥上，撒上胡椒粉、倒上酱油。\\n5、用勺子拌匀。\\n6、模具或者用手安城圆形。\\n7、底锅抹油，小火煎两面金黄。\\n8、盘即可！\\n',
        口味: '清淡',
        工艺: '煎'
      }
    },
    {
      id: 199,
      name: '红烧狮子头',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、准备食材。\\n2、鹌鹑蛋清水中清洗下，入锅煮熟，过冷水剥壳。\\n3、肉打成肉泥。\\n4、马蹄去皮切末。\\n5、肉放盆中，加入鸡蛋、葱花、马蹄末、面包糠、生抽、盐、黄酒。\\n6、同一方面搅打上劲。\\n7、上一次性手套，放适量肉馅在手上，再放入鹌鹑蛋，做成肉丸形状，再左右手来回将肉丸子摔打几下，使之排出空气，结实一点。\\n8、部完成了。\\n9、中倒入适量油，烧至8成热时，放入肉丸子。\\n10、炸至外表呈金黄色（油要温度高点，肉丸下油锅后才能迅速定型，不易散开）。\\n11、倒出锅内的油，在锅中加入炸好的肉丸子、水、生抽、老抽、冰糖、黄酒、桂皮、香叶、辣椒、八角、盐，大火煮开。\\n12、转小火30分钟左右至快收汁关火。\\n',
        口味: '咸鲜',
        工艺: '烧'
      }
    },
    {
      id: 202,
      name: '家庭自制盐水鸭',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一天',
        做法:
          '1、鸭子洗净，冲十分钟去血污。\\n2、脚爪，翅膀，内脏，头，脖子单独留下。（可以不留脖子和头），头要洗净，用碱面反复搓洗，直到没有粘液。\\n3、盐，花椒，五香粉，小火炒到盐呈微黄色。并且有香味。\\n4、用花椒盐均匀的撒在鸭子和零件上，按摩一会。\\n5、装进保鲜袋。冰箱冷藏三小时以上。\\n6、打结，姜拍碎，大茴，香叶放进锅里煮开。放一汤匙白醋一汤匙盐。\\n7、火煮开，小火煮20分钟即可。\\n8、子腌渍好放在冷的卤水中浸泡两个小时。捞出来挂着晾干。大概一小时左右。\\n9、水中放姜块拍散，黄酒半碗，把鸭子放进去，大火烧开，撇净浮沫。关最小火，不能沸腾。焖三十分钟即可。\\n10、卤好的鸭子拿出来晾凉切块即可。零件们。\\n11、鸭子。肉很嫩，很好吃。\\n12、切块一定要用快刀，不锈钢那种肯定不行，我家的刀很大，但是都需要我扬起来劈的。最好男的来做这个工作，有力气。\\n',
        口味: '原味',
        工艺: '卤'
      }
    },
    {
      id: 207,
      name: '双色糯米烧麦',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、提前一天把糯米用水泡上，泡好的糯米上笼蒸40分钟。\\n2、香菇、胡萝卜、葱姜、火腿切末待用。\\n3、肉末加葱姜末、盐、生抽、老抽、鸡精、胡椒粉、十三香搅拌均匀。\\n4、炒锅热油，放入猪肉馅翻炒一下。\\n5、再加入香菇、胡萝卜、葱姜、火腿翻炒均匀；加少许调料入味。\\n6、好的糯米放入炒锅里和已入味的猪肉馅混合，加一些香葱。\\n7、拌均匀待用。\\n8、菠菜和胡萝卜切碎，加少许水打成汁。\\n9、滤掉碎末后留汁水待用。\\n10、面粉加蔬菜汁和成面团。\\n11、醒发一小时。\\n12、将面团擀成圆形皮（四围薄中间厚的）。\\n13、包入馅料，整形。\\n14、整形~~用手指将腰部捏紧，露出一部分出来。\\n15、上锅大火蒸10分钟即可。\\n',
        口味: '五香',
        工艺: '蒸'
      }
    },
    {
      id: 212,
      name: '扬州蛋炒饭',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、准备好所有的食材。\\n2、米饭用饭勺播散备用。\\n3、鸡胸肉切粒用盐，糖，料酒，淀粉腌制片刻。\\n4、火腿，冬笋，香菇，海参全部切小粒备用。\\n5、炒锅倒入少许猪油烧热。\\n6、入鸡肉翻炒均匀。\\n7、出后再放入虾仁翻炒。\\n8、入笋丁和香菇丁翻炒。\\n9、倒入海参翻炒。\\n10、加入火腿继续翻炒。\\n11、再把炒过的鸡肉倒入继续翻炒。\\n12、加入料酒。\\n13、在加入适量的盐。\\n14、再淋入少许鸡汤。\\n15、翻炒均匀关火成为什锦浇头备用。\\n16、锅中加入油烧热倒入蛋液翻炒熟盛出备用。\\n17、炒锅再加一些油爆香葱花。\\n18、倒入米饭翻炒均匀。\\n19、倒入鸡蛋继续翻炒。\\n20、把刚才炒好的浇头放入一半和米饭一起淋入适量的香油炒均匀。\\n21、盛出2/3米饭，再把剩下的浇头和米饭炒均匀。\\n22、炒好后盖在盛出的米饭上面即好。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 218,
      name: '清蒸手工狮子头',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、准备好主料：猪腿肉。\\n2、准备好配料：马蹄、葱、姜。\\n3、马蹄去皮切成小丁、葱姜切成末。\\n4、1大勺的地瓜粉加入5汤勺的清水拌匀，备用。\\n5、把肥肉和瘦肉分别切成丁，肥肉先放一边备用。\\n6、把瘦肉剁成较粗的肉糜。\\n7、入肥肉丁。\\n8、成较细腻的肉糜。（不要太成糊了，要保持有颗粒状，这样狮子头才松脆）\\n9、入马蹄丁、葱姜末。\\n10、稍微剁匀即可。（这里不要剁太久，主要是为了混合，如果把马蹄全剁烂了，狮子头里就没有马蹄的颗粒了，也就不那么脆了）\\n11、把剁好的肉放入一个较大的碗中，调入上述调料，戴上一次性手套，分次加入前面准备好的地瓜粉做的水淀粉，把肉糜抓匀。（大约抓2、3分钟就可以了，不用搅拌上劲）\\n12、取适量肉糜放在左手掌中，右手用菜刀反复的刮起，直至成为一个圆的狮子头的样子。（这一步有点难度，需要熟练的技巧，我是从小看家里的厨师和爸爸都是这样做的，所以也就这样学，现在已经熟练了，如果不会这种方法的话，可以用个铁勺子，右手拿着，配合着左手上反复的刮起制圆。铁勺子就是一般喂孩子吃饭的那种，因为这种勺子中间是圆的，而我们平时喝汤的陶瓷的汤勺，底是平的，所以不适合）\\n13、依次做好所有的狮子头，我做了2盘。\\n14、做好以后上锅蒸熟。（冷水入锅，水开后转中火蒸约5分钟，图中是已经蒸好的，可以看到盘子里有很多汤汁，这是因为调味时加了水淀粉）\\n15、蒸好的狮子头取出装盘，可依据自己的想象稍微装饰一下。\\n16、把盘里的汤汁倒进锅里，调入少许水淀粉，勾成薄芡。（薄芡就可以，不要太浓绸）\\n17、把芡汁均匀的淋在装饰好的盘子里即可。\\n',
        口味: '清淡',
        工艺: '技巧'
      }
    },
    {
      id: 222,
      name: '清蒸大闸蟹',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、准备公蟹母蟹各三只。\\n2、大闸蟹用牙刷刷净。\\n3、蒸锅添水，将姜片放入水中，再倒入少量啤酒。\\n4、将绑好的活蟹放入，盖盖，冷水大火蒸15——18分钟（蒸的时间视蟹的大小决定）\\n5、生姜、葱切末。\\n6、入白糖和醋，即成为姜醋蘸汁（蟹性寒，须加姜醋才可食用。）\\n7、紧趁热食用吧。\\n',
        口味: '咸鲜',
        工艺: '蒸'
      }
    },
    {
      id: 224,
      name: '鸭血粉丝汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、准备好所有的食材。\\n2、粉丝用清水浸泡备用。\\n3、鸭血入开水锅中煮上3分钟捞出过凉备用。\\n4、熟鸭肫和鸭肠切片，油豆腐切三角片备用。\\n5、鸭边腿洗净用开水焯烫过凉。\\n6、备好调味料。\\n7、煮锅内胆倒入适量的清水，放入葱姜，大料，花椒，香叶，桂皮，陈皮，料酒和鸭边腿。\\n8、火煮开5分钟关火。\\n9、入外锅中加盖焖之20分钟即好。\\n10、汤锅中爆香葱姜\\n11、倒入油豆腐翻炒片刻。\\n12、再加入切片的鸭血翻炒。\\n13、加入刚刚煮好的鸭汤。\\n14、加入适量的盐。\\n15、再放入胡椒粉。\\n16、煮开5分钟后加入泡好的粉丝煮至透明。\\n17、取一个大碗盛入粉丝鸭汤再把熟的鸭肠和鸭肫摆在上面，撒香菜淋入香油或者辣椒油即好。\\n',
        口味: '咸鲜',
        工艺: '煮'
      }
    },
    {
      id: 231,
      name: '江米糕',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、准备好所有的食材。\\n2、芝麻小火炒香备用。\\n3、紫薯去皮切片放入碗中。\\n4、入蒸锅中煮熟。\\n5、糯米淘洗干净放入电饭锅中做成糯米饭。\\n6、豆放入搅拌机中搅打成蓉。\\n7、蜜豆蓉放入碗中拌均匀备用。\\n8、好的紫薯取出用勺子压成泥。\\n9、米饭蒸好取出稍微凉一凉。\\n10、取一个寿司卷，上面铺上保鲜膜，放入糯米饭。\\n11、糯米饭上再放一块保鲜膜，用擀面杖把糯米饭擀成圆饼状。\\n12、去掉上面的保鲜膜铺上一半紫薯泥。\\n13、然后在另一边铺上蜜豆蓉。\\n14、然后卷成长条，用寿司卷帮助定型。\\n15、去掉寿司卷和保鲜膜。\\n16、把炒熟的芝麻撒在上面，均匀的滚好沾满。\\n17、再切小块即可食用。\\n',
        口味: '甜味',
        工艺: '蒸'
      }
    },
    {
      id: 234,
      name: '清蒸狮子头',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、原料。\\n2、木耳泡发切丝。\\n3、西兰花掰开用盐水泡10分钟后洗净。豆腐皮切丝 火腿切菱形块。\\n4、豆腐皮焯水捞出备用。\\n5、西兰花焯水捞出备用。笋切片焯水捞出\\n6、糜加葱、姜、笋，一起剁成肉泥。喜欢更滑的，用料理机打成肉泥。\\n7、好的肉泥加一点五茶匙盐，生抽，胡椒搅拌上劲。\\n8、入蛋清，淀粉，食用油，继续搅拌成发白看起来细腻的肉末。\\n9、三分之一肉泥，两手反复摔打成光滑的肉团。\\n10、锅里烧开水，狮子头下入锅中焯定型。\\n11、砂锅或者炖盅里铺上豆腐皮，木耳丝。\\n12、狮子头放入，摆好火腿，兑入高汤，撒半茶匙盐。\\n13、下层放米蒸。\\n14、上层放狮子头。蒸45-50分钟。\\n15、蒸好的狮子头用焯水的西兰花装饰即可。\\n16、清蒸的超级鲜美，三个狮子头三个人的分量。\\n',
        口味: '咸鲜',
        工艺: '蒸'
      }
    },
    {
      id: 238,
      name: '盐水虾',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、原料图：九节虾。\\n2、配料图：生姜、香葱、花椒、八角、桂皮。\\n3、虾洗净后，在虾的倒数第2个关节处用牙签挑去虾线，全部处理完。\\n4、锅中加入适量水，调入盐，加入所有配料大火烧开后继续滚约2分钟，煮出配料的香味。\\n5、下入处理好的虾，调入1汤勺料酒。\\n6、续煮至开锅即可。如果做冷盘的话可以捞出放入冰水中浸泡至凉透后捞出摆盘。（冰水最好是用凉白开制作）\\n',
        口味: '清淡',
        工艺: '煮'
      }
    },
    {
      id: 241,
      name: '清炖狮子头',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、将五花肉去皮切碎，用刀剁成米粒大小的馅。\\n2、莲藕去皮切成小碎丁；枸杞浸泡开，葱姜打成汁；白菜、油菜洗净备用。\\n3、肉馅中加入莲藕碎，调入盐、料酒、胡椒粉拌匀。\\n4、加葱姜水搅拌均匀，再逐渐加入清水顺同一方向搅拌至上劲。\\n5、砂锅底层铺入一层白菜，将调好的肉馅制成大丸子放入。\\n6、足量清水，调入少许盐、料酒，用大白菜盖在肉丸上。\\n7、火烧开后转小火炖1.5小时，放入枸杞再炖5分钟，出锅前放入油菜心即可。\\n8、淡爽口，香滑软嫩。\\n',
        口味: '清淡',
        工艺: '炖'
      }
    },
    {
      id: 249,
      name: '虾仁豆腐',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、准备材料。\\n2、虾仁中放适量盐跟淀粉，用手抓腌均匀。\\n3、将豆腐切小块，得温柔些切，嫩豆腐容易碎。\\n4、葱段、姜丝放碗里，加适量水。\\n5、再加生抽、甜面酱，适量盐、芝麻油调成汁。\\n6、热后，倒炒菜用的油量，下入豆腐块，轻推锅柄。\\n7、反面都微煎下。\\n8、入调好的汁。\\n9、盖煮约5分钟，使豆腐入味下。\\n10、将虾仁倒入。\\n11、等虾仁转成红色时，关火，加点鸡精即可。\\n',
        口味: '酱香',
        工艺: '煎'
      }
    },
    {
      id: 251,
      name: '鲜菇芦笋小炒',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、准备材料，芦笋、香菇、黄彩椒。\\n2、将芦笋切段，香菇切片，黄彩椒切丝。\\n3、沸水中滴几滴油加少许盐，将芦笋绰烫一下捞出用凉水浸凉。\\n4、炒锅放油，干红辣椒、姜、蒜末爆香锅。\\n5、再放入香菇片和黄彩椒翻炒。\\n6、入少许生抽，再加适量盐调味，翻炒至断生后盛出即可。\\n',
        口味: '咸鲜',
        工艺: '炒'
      }
    },
    {
      id: 254,
      name: '龙井虾仁',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、茶叶用少许开水泡出香味备用。\\n2、将河虾去壳，洗净，加入盐、蛋清、干淀粉拌匀腌制15分钟。\\n3、锅中倒稍微多一些的油，烧至3成热下入虾仁滑油。\\n4、捞出、沥油备用。\\n5、.锅中留底油，下葱段煸出香味。\\n6、后将葱段捞出。\\n7、入虾仁，加鸡精、绍酒翻炒均匀。\\n8、后倒入泡好的龙井茶汁翻炒均匀即可。\\n',
        口味: '清淡',
        工艺: '炒'
      }
    },
    {
      id: 259,
      name: '大珠小珠落玉盘',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、准备材料：豆腐皮、广味香肠、海苔、鸡蛋。\\n2、将豆腐皮裁去硬边，取一片海苔平铺在豆腐衣上。\\n3、将香肠铺在海苔上。\\n4、紧紧的卷起来，用湿淀粉沾边后裹紧。我用了三张豆腐衣卷在外面。\\n5、开水上锅蒸10分钟左右。\\n6、鸡蛋液搅拌均匀。\\n7、锅烧热油，将搅匀的蛋液用漏勺中滴入油锅内。（漏勺一定要选择圆孔的，孔不要太大，否则，就成鸡蛋块啦！）\\n8、液一落入油锅，马上变成了美丽的蛋花，这时候要赶紧用筷子搅拌开来，不然就全粘到一块了。\\n9、蛋花炸到浅金黄色时即可控油捞出（为了防止蛋花油腻,一定要多控一会油）\\n10、将鸡蛋花撒适量糖和芝麻摆在中间，香肠腐衣卷切盘即可。\\n11、柠檬片摆盘装饰\\n',
        口味: '原味',
        工艺: '蒸'
      }
    },
    {
      id: 262,
      name: '电压力锅版东坡肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、材料图。\\n2、将五花肉整块儿焯水：凉水入锅，中大火加热至沸腾，保持3、5分钟，出净血沫，捞出冲洗干净；\\n3、用刀刃刮净猪皮（如果还有毛茬，找个小镊子清除，比如“眉毛夹”，哈哈~），切成方形大块儿；\\n4、在电压力锅的内锅底部平铺上一层葱段和姜片；\\n5、将肉块儿肉皮朝下，排铺在锅底，并加入酱油、料酒和冰糖；\\n6、上盖子，接通电源，按电压力锅使用说明，选择肉类排骨、焖炖功能，别忘了按下“中途加菜”键（中间要翻面的）；压力锅开始烹饪，默认时间45分钟；\\n7、计时10分钟时压力锅自动排气，提示中途加菜，打开锅盖，将肉块翻面，使肉皮朝上；盖上锅盖，自动开始继续烹饪；\\n8、饪结束后，等待压力锅完成自动排气；\\n9、动排气结束后，就可以吃了。为了保证东坡肉的口感，不妨再坚持一会儿——将肉块儿取出，肉皮朝上排进蒸盘，浇上过滤后的原汤汁；\\n10、盖上保鲜膜，入蒸锅大火上汽后蒸30分钟——这是最地道的东坡肉的标准做法。\\n',
        口味: '咸鲜',
        工艺: '炖'
      }
    },
    {
      id: 265,
      name: '麻酱菠菜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、净的菠菜下锅焯水，往水里倒一点烹调油、糖。\\n2、准备调味料。我用的芝麻酱是原味的，需要调味儿，如果是咸味儿的就不要再放盐了，芝麻酱本身比较稠加之无味，我用了凉开水和生抽及盐\\n3、菠菜焯一滚，捞出淋水散热，因为气温不高，我没有过水。\\n4、用生抽加凉开水，将糖和盐化开\\n5、将生抽水倒入芝麻酱中。\\n6、分拌均匀。\\n7、果芝麻酱还是很稠，再添加小量凉开水。\\n8、到调出满意的麻酱。\\n9、透的菠菜整形装盘子，浇上调好的芝麻酱，再放上油辣椒，放上松籽，放上红椒丝，边吃边拌吧。\\n',
        口味: '清淡',
        工艺: '煮'
      }
    },
    {
      id: 268,
      name: '清炒荷兰豆',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、主料准备好，荷兰豆洗净，撕去两边的老筋\\n2、锅里烧开水后，放入适量盐和少量油，随后放荷兰豆焯水，待荷兰豆变色后立刻捞起\\n3、随后放入凉水中，浸泡一会\\n4、蒜头切沫，红椒切丝\\n5、锅里放适量油，烧热后，爆香蒜蓉\\n6、后放红椒拌炒\\n7、荷兰豆一起拌炒\\n8、至断生后，调入适量盐即可\\n',
        口味: '原味',
        工艺: '炒'
      }
    },
    {
      id: 271,
      name: '蛤蜊蒸蛋',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、蛤蜊用淡盐水泡一夜，盖上一个盘子晃动十几下。若是怕不干净，可以放点白酒后晃动。烧开水，放入蛤蜊，开口一个捞一个，直到全部开口。\\n2、鸡蛋充分打散，兑入等量的纯净水（温开水也可以，至于比例看自己喜好，我觉得一比一比较香，多点水就比较嫩。），加入盐充分搅拌均匀。这是蛋羹滑嫩的基础。\\n3、蛤蜊摆在炖盅内，或者碗里。\\n4、滤网过滤蛋液入容器内。包上保鲜膜用牙签戳几个小洞，或者盖上蛋盅盖子。中小火蒸8分钟-10分钟即可。\\n5、红椒，豉油，香油，兑好\\n6、好的蛋羹吃的时候淋上步骤5中的料汁即可。\\n',
        口味: '咸鲜',
        工艺: '蒸'
      }
    },
    {
      id: 273,
      name: '番茄鱼片',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、西红柿去皮切小丁备用。草鱼收拾干净，片下一面鱼肉。\\n2、在用刀将腹部的大刺片下去。\\n3、切成大片。\\n4、将鱼肉放入碗中，加蛋清、绍酒、盐、干淀粉上浆腌制15分钟入味。\\n5、.锅中倒入植物油，烧至5成热，将鱼肉放入锅中炸至金黄捞出。\\n6、留底油，下葱姜蒜末炒出香味。\\n7、入西红柿丁和番茄酱小火煸炒，炒至西红柿软烂成汁。\\n8、入白糖。\\n9、许绍酒、醋、鸡精、少许盐（口淡滴可以不加）炒匀。\\n10、用水淀粉勾芡。\\n11、倒入炸好的鱼片，快速翻炒均匀。\\n12、起锅前加入香菜末即可。\\n',
        口味: '酸甜',
        工艺: '炸'
      }
    },
    {
      id: 275,
      name: '油焖春笋',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、春笋去壳洗净，香葱洗净\\n2、用刀的平面将春笋拍破，再切寸段\\n3、放入沸水中焯水3分钟捞出备用\\n4、香葱切段\\n5、锅中倒入适量油，将油烧热后放入几根葱白爆香\\n6、入春笋翻炒片刻，调入半勺盐\\n7、酱油\\n8、抽\\n9、勺糖\\n10、翻炒均匀后倒入小半碗清水，盖上盖子焖5到8分钟\\n11、汤汁收至浓稠后，将剩余的葱段放入，撒点胡椒粉翻炒均匀即可出锅\\n12、吃在嘴里非常脆嫩爽口哦！\\n',
        口味: '咸鲜',
        工艺: '焖'
      }
    },
    {
      id: 279,
      name: '无孔不入的青菜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、米饭比平时做饭，要水少很多，平时做饭，要到手指关节的一半，做菜饭刚刚淹没米就好了。\\n2、青菜洗净切碎备用。\\n3、锅里放油，炒一下姜末。\\n4、放入蔬菜炒匀全部沾上油即可，不要炒熟炒老了。调入一茶匙盐。半茶匙鸡精。\\n5、米饭跳过来立刻打开，把蔬菜拌进去，要拌均匀。\\n6、上焖八分钟即可。\\n',
        口味: '清淡',
        工艺: '焖'
      }
    },
    {
      id: 282,
      name: '传统红烧肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、五花肉800克、八角15克、香叶1片、葱段50克、姜片30克、白砂糖20克、盐适量、酱油25克、黄酒30克、冰糖25克、花生油15克。\\n2、先把五花肉切成2.5厘米见方的块儿。\\n3、用凉水下锅。\\n4、水开后把肉块儿煮5分钟。\\n5、捞出，控净水份备用。\\n6、锅上火倒入少许油，煸香八角。\\n7、入细砂糖。\\n8、炒糖色。\\n9、炒到微黄色即可。\\n10、砂糖彻底融开，炒到稍微上色后，下入肉块儿煸炒，把肉块儿煸炒到耗干水份颜色透亮、表面微黄。\\n11、并开始出油后烹入黄酒。\\n12、倒入酱油翻炒。\\n13、炒到黄酒挥发，酱油均匀的吸附在肉块上为止。\\n14、把肉炒匀后，往锅中注入开水，水和肉块持平即可。\\n15、然后，放入葱段、姜片、香叶。\\n16、最后放入冰糖。\\n17、盖上锅盖用小火焖煮30-40分钟。\\n18、肉焖熟后，捡出葱、姜、八角、香叶不要。\\n19、放少许盐，然后用旺火收汁。\\n20、汤汁收净便可出锅。\\n21、在收汁的时候，可顺便把多余的油滗出留作它用，此油味道很香，可炒菜还可做其它用途。\\n',
        口味: '咸甜',
        工艺: '焖'
      }
    },
    {
      id: 283,
      name: '剁椒鱼头',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、鱼头加盐搓洗干净，冲掉盐水，撒胡椒粉一茶匙，食用油半汤匙，盐半茶匙，鸡精半茶匙，搓揉均匀，腌渍十分钟。\\n2、葱姜蒜垫底。\\n3、铺上剁椒蒸八分钟虚火蒸两分钟。\\n4、撒上葱姜蒜末。\\n5、油烧热，冒青烟的时候离火，数三个数，浇在鱼上即可。\\n6、下的汤汁用来拌面条特别好吃。\\n',
        口味: '微辣',
        工艺: '蒸'
      }
    },
    {
      id: 286,
      name: '手撕包菜',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '十分钟',
        做法:
          '1、准备好食材\\n2、包菜清洗干净，用手撕成小块\\n3、炒锅烧热，下油，下蒜粒辣椒段炒香\\n4、下包菜一起翻炒\\n5、炒至包菜8成熟，加盐，味极鲜，醋，鸡精炒匀即可起锅\\n',
        口味: '微辣',
        工艺: '炒'
      }
    },
    {
      id: 292,
      name: '毛氏红烧肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、先把五花肉切成三厘米见方的块，把切好的肉凉水下锅。\\n2、水开煮3-5分钟捞出。\\n3、炒勺上火放少许底油，下入焯过水的五花肉煸炒。\\n4、把五花肉块用中小火煸出油，肉块煸至颜色微黄捞出备用。\\n5、锅中留底油下入豆豉、八角、桂皮煸炒。\\n6、出香味儿后下入葱段、姜片和干辣椒煸炒。\\n7、出香味儿后，倒入煸好的五花肉块炒匀，然后烹入绍酒炒匀。\\n8、烹入酱油炒匀。\\n9、入适量的开水，水和肉持平略多一些即可。\\n10、注入水后放入冰糖。\\n11、盖上锅盖，用小火焖烧40分钟。\\n12、肉烧至40分钟后，拣出八角、桂皮和葱姜不要。\\n13、用旺火收汁，汤汁将近收净时撒入少许味精炒匀，然后便可出锅。\\n14、出锅后，把肉装入保温碗中便可上桌食用。\\n',
        口味: '中辣',
        工艺: '烧'
      }
    },
    {
      id: 293,
      name: '剁椒蒸鸡翅',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、原料图。\\n2、鸡翅剁小块焯水。捞出洗净沥干备用。\\n3、姜末蒜末和剁椒混合。\\n4、锅里放油，炒香剁椒碎。\\n5、放入鸡肉，盐拌匀。关火。\\n6、入碗中，上锅蒸15分钟左右即可。\\n',
        口味: '中辣',
        工艺: '蒸'
      }
    },
    {
      id: 295,
      name: '红烧肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、冷水入锅，放入五花肉出水。\\n2、出完水冲洗干净。\\n3、热油倒入香料煸香。\\n4、把五花肉放入一起煸炒至微黄，全部盛起待用。\\n5、锅里另放油把冰糖放入小火熬制泛黄化开。\\n6、入一碗开水搅拌均匀。\\n7、待用的肉和香料一起倒进锅中，倒入黄酒和生抽大火煮开后改小火慢炖一个小时。\\n8、烧至一半把香料全都挑出来。\\n9、收干后就可以起锅了。\\n',
        口味: '咸甜',
        工艺: '炖'
      }
    },
    {
      id: 297,
      name: '麻辣小龙虾',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、小龙虾漂水几天，用牙刷刷干净；去头去虾肠，洗干净备用。\\n2、青蒜和香葱洗干净切段备用；姜和蒜切片，葱头切丝备用。\\n3、花椒一小把，干辣椒切段备用。\\n4、甜酱1勺。\\n5、锅热注油，倒入部分青蒜，香葱，葱头，姜和蒜片一起爆香。\\n6、倒入干辣椒，花椒和八角一起翻炒。\\n7、辣椒约变色时，放入小龙虾大火爆炒。\\n8、虾壳变红时，倒入一勺甜酱继续翻炒上色。\\n9、次放入少许白酒炒匀。\\n10、再放入1勺半的盐一起翻炒。\\n11、放入一碗水约和龙虾齐平。\\n12、大火烧开。\\n13、转小火烧约三分之一汤汁。\\n14、再放入剩下的青蒜，香葱和蒜片等炒匀。\\n15、最后大火收汁，盛起装盘即可。\\n',
        口味: '麻辣',
        工艺: '炒'
      }
    },
    {
      id: 300,
      name: '农家小炒肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、五花肉切薄片，青蒜切段，青红尖椒切段，蒜姜切小粒\\n2、用盐，料酒，生抽，老抽腌制五花肉15分钟\\n3、热锅凉油，下腌好的五花肉煸炒至出油，变为金黄色\\n4、将煸好的五花肉盛出，锅中留下底油，下姜蒜粒炒香\\n5、加入豆鼓和辣酱炒香\\n6、入炒好的五花肉和切好的尖椒\\n7、椒五分熟后加入青蒜炒至变色即可\\n',
        口味: '微辣',
        工艺: '炒'
      }
    },
    {
      id: 304,
      name: '自制腊肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数天',
        做法:
          '1、买来的肉洗净晾干。\\n2、准备好要用的配料。\\n3、准备好要用的香料。\\n4、除白酒外，把其它的配料放进大锅中，煮开，搅动至冰糖溶化。\\n5、晾凉，倒入白酒，搅匀。\\n6、晾干的肉放进调味锅里，如果肉上有水，可以用厨房用纸抹干，放在阴凉处，每天把肉翻动一次，腌7天。\\n7、腌好后，用棉绳把肉串起来，挂在阳台上。\\n8、这样晾10天左右就差不多了，切成小块。\\n9、进保鲜袋内，放冰箱冷冻室保存。\\n',
        口味: '五香',
        工艺: '腌'
      }
    },
    {
      id: 309,
      name: '肥而不腻的毛氏红烧肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '一小时',
        做法:
          '1、五花肉洗净，切成2.5厘米见方。\\n2、锅中放水，下入切好的五花肉。\\n3、把五花肉焯水后捞出控干水分。\\n4、准备好葱姜蒜 八角 桂皮 干辣椒。\\n5、锅中放入少许的油炒香葱姜蒜 八角 桂皮 辣椒。\\n6、入焯水的五花肉煸炒至表面微黄后盛出。\\n7、起锅，锅内放少许油，加糖炒至棕红色。\\n8、入煸好的五花肉翻炒。\\n9、火翻炒至五花肉都均匀的裹上糖色。\\n10、倒入黄酒和少量的开水，转小火焖至1小时，加入盐收干汤汁即可。\\n',
        口味: '微辣',
        工艺: '焖'
      }
    },
    {
      id: 312,
      name: '湘式辣鸡块',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、鸡翅根洗净，改刀成两块。\\n2、焯水后洗净浮沫。\\n3、香菇切片；青椒切碎。\\n4、锅内热油，七成热下葱段、姜片和蒜末（大约需要五六瓣），爆香后，下入鸡块，调入料酒，加酱油、糖，翻炒均匀，使鸡块上色。\\n5、下入剁椒（可根据各人嗜辣的程度来决定用量）。\\n6、匀后，盛入空碗内，上蒸锅蒸二十分钟。\\n7、蒸好的鸡块重新倒入炒锅内，下入香菇，调入鸡精，大火尽量收干汤汁后，临起锅前下入青椒，炒匀即可。\\n',
        口味: '中辣',
        工艺: '烧'
      }
    },
    {
      id: 315,
      name: '香煎藕盒',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、备好食材。\\n2、面粉中加鸡蛋、盐、五香粉、苏打粉、水，拌成面糊糊。\\n3、筷子挑起能流成线的面糊就行。\\n4、肉剁成肉泥，葱花，姜末，盐，鸡精，料酒，生抽，向一个方向搅拌上劲。（肉馅一般是3肥7瘦的比例为最好，我用的全瘦肉，故里面还加了点鹌鹑蛋）\\n5、肉馅拌匀备用。\\n6、藕切约0.5毫米左右的片。\\n7、一片藕片，将拌好的肉馅放适量在上面。\\n8、上另一片藕，轻压一下。\\n9、次做好全部藕盒。\\n10、锅中倒油烧五成热，将做好的藕盒挂上面糊。\\n11、放入锅中炸成双面金黄即可捞起，用吸油吸下油，即可装盘。\\n12、看成品吧。\\n',
        口味: '五香',
        工艺: '煎'
      }
    },
    {
      id: 316,
      name: '蜜汁排骨',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、把排骨过水，沥干水份。\\n2、用盐、生抽腌制半小时。蒜切末。西兰花也过水沥干水份。花围一下边就可以了。\\n3、油锅烧热，放白糖，中火炒至糖化开起泡。\\n4、倒入腌制的排骨，迅速翻炒，让排骨裹上糖色。\\n5、放入切好的蒜末，在倒少许酱油，耗油。翻炒均匀。\\n6、入少许料酒，翻炒一会倒入清水，没过排骨，加入三颗的小冰糖，大火烧开。小火慢炖20分钟。\\n7、锅收汁。\\n8、盘，把西兰花围一下边就可以了。\\n',
        口味: '甜味',
        工艺: '炖'
      }
    },
    {
      id: 318,
      name: '蚝油焖鸡翅',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、鸡翅斜划两刀，方便入味。焯水过冷水控干备用。\\n2、锅里放油，鸡翅煎两面微黄，把油全部倒出去。\\n3、鸡翅拨到一边（我是偷懒，其实要不是平底锅，就要盛出来），炒香姜片，蒜片。\\n4、倒入蚝油，番茄酱，二比一，小火炒冒泡。一定要开小火。\\n5、兑水，放鸡翅，水将要淹没鸡翅就好。大火烧开小火焖煮十分钟。\\n6、尝味道，放三分之一茶匙盐，半茶匙胡椒，千万别咸了，调味到比自己的感觉淡一些，因为还要收汁。\\n7、汁的时候，先把鸡翅翻着身，汁水快干了再反过来，这样两面上色都很漂亮。汤汁粘稠的裹在鸡翅上，很诱人。放点鸡精提味即可。\\n',
        口味: '咸鲜',
        工艺: '焖'
      }
    },
    {
      id: 320,
      name: '牛肉板面',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、牛肉400g。\\n2、牛肉洗净切粒。\\n3、锅内放水烧开倒入牛肉粒、焯水水再次烧开即可捞出。\\n4、捞出的牛肉粒放凉水中漂洗去除血沫。\\n5、香料。\\n6、锅放油下入香料炒香倒入牛肉粒。\\n7、牛肉粒煸炒一会倒入老抽翻炒一下兑足水大火烧开。\\n8、蛋煮熟。\\n9、烧开的牛肉粒倒入砂锅调味、小火煮1个小时、把煮熟的鸡蛋剥皮放入砂锅使其入味、干红辣椒用油炸香倒入沙锅内。\\n10、粗盐10g。\\n11、把盐放大碗中加热水化开放凉。\\n12、把面倒入盆内搅动成面穗状。\\n13、再把面穗揉搓成面团盖湿布饧半小时。\\n14、食用碱5g。把碱兑水化开。\\n15、手蘸碱水在饧好的面团上揣。一定要揣透。再次饧二十分钟。\\n16、把饧好面团方案板上再次揉透。\\n17、把揉透的面团压扁大约1厘米厚。\\n18、改刀切成约2厘米宽。\\n19、把切好的面用手搓一下使其呈圆条状、逐个做好、上面拍一些面粉、避免再饧的时候粘连、弄好后饧30分钟。\\n20、把饧好的面拿出两个、不可再次揉搓。\\n21、摆齐用擀面杖擀向两端擀开擀薄\\n22、一碗面四根足够、把四根均擀开、擀薄\\n23、再左右手捏着面头，举过头顶，狠狠地摔在案子上。接二连三，噼里啪啦，边摔，边拉，板面由此而得名。\\n24、这是率好的板面。\\n25、锅内烧开水。\\n26、青菜。\\n27、锅开后把摔好的板面下入锅内待锅开到少许凉水放入青菜。\\n28、捞起煮好的板面和菜、清白润滑、然后浇上卤子、白的面条、绿的菜叶、红的卤子。\\n',
        口味: '微辣',
        工艺: '煮'
      }
    },
    {
      id: 322,
      name: '蔬菜牛肉汤',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、牛肉切小块，放入冷水锅，烧开后捞出，冲洗干净血沫。\\n2、汤锅内加足量冷水,放入洗净的牛肉块,加入葱段和姜片,大火烧开,撇干净浮沫,加入少量料酒去腥,烧开后转小火炖1小时。\\n3、番茄洗净,划个浅浅的十字。取一个干净的锅,加冷水烧开后,放入番茄烫一下,待皮卷起后捞出,去皮和蒂,搅拌成番茄酱备用。\\n4、搅拌成番茄酱\\n5、蘑菇切片，胡萝卜、洋葱、西芹都切成丁。\\n6、内加少量橄榄油（加点黄油的话会更香哦）放入洋葱丁炒香，然后依次加入胡萝卜丁，西芹和蘑菇继续炒，最后放入准备好的番茄酱翻炒后盛出。\\n7、牛肉汤锅里的葱段和姜片捞出，然后把炒好的蔬菜放入汤锅,小火炖1个小时后,加入适量的盐和胡椒粉调味儿。（如果想要颜色更鲜亮些好看些，可以调入适量番茄酱或者番茄沙司）\\n8、碗热乎乎的蔬菜牛肉汤就做得了，超好喝哦！\\n',
        口味: '咸鲜',
        工艺: '炖'
      }
    },
    {
      id: 327,
      name: '油爆虾',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、虾洗净，放淘米篮里沥掉水份。\\n2、姜切丝，葱切段。\\n3、锅上火，锅里加适量的油，可以淹掉虾的量，油烧至6成热倒入虾（因为虾是活的，记得倒入同时用锅盖盖上一小会）火可以关稍微小一点。\\n4、炸至虾弯曲变红，漏勺捞出。\\n5、等捞出的虾温度降了一半，锅里重新开火，大火，油温升起来在倒入虾复炸一次。\\n6、起锅，开火，倒很少的油放入姜丝葱段出香味，倒入5勺的生抽，白糖2小勺。（盐可放可不放，看使用的生抽咸淡度而定）\\n7、入虾翻锅，充分吸收汤汁装盘。\\n',
        口味: '五香',
        工艺: '炸'
      }
    },
    {
      id: 328,
      name: '黄豆牛肉酱',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '数小时',
        做法:
          '1、黄豆提前一晚用清水泡发，第二天做的时候将牛肉清洗干净，切成比较大的粒状，如果有时间，还可以将牛肉用清水泡两个小时，便于血水的淅出。锅里倒油，因为是做酱，所以油要得比较多，放入配料1，小火慢炸20分钟，直到香气四溢。\\n2、为了口感好一些，将油里的配料捞出来不要，然后倒入牛肉粒，也用小火慢炸。\\n3、黄豆提前煮好，我在煮的时候放了1个八角和少量的盐，再准备好姜蒜末，大葱切碎，干辣椒切碎。\\n4、准备好熟芝麻和熟花生，我用的花生是直接用烤箱烤熟的，感觉比油炸的健康一些。\\n5、准备好需要的三种酱，混合均匀。\\n6、肉在炸的过程中，开始因为水气多，所以会有很多泡沫。\\n7、着时间的流逝，水气慢慢炸干，油也变得清澈了。因为我家小熊喜欢吃干一些的肉，所以我也炸得比较久，具体多久也没看时间，估计有30分钟吧。\\n8、入姜蒜末和大葱末，再倒入豆豉、冰糖和干辣椒碎，慢慢翻炒一下。\\n9、入准备好的酱翻炒，直到感觉油的颜色变深变红，倒入黄豆，再放一些十三香、料酒和花椒粉，关到最小火，慢慢熬20-30分钟。\\n10、起锅前倒入芝麻和花生即可。\\n',
        口味: '微辣',
        工艺: '酱'
      }
    },
    {
      id: 335,
      name: '蛋黄豆腐',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、将内酯豆腐切小块，放入淡盐水中浸泡5分钟。\\n2、香葱、姜、彩椒洗净切成末，咸鸭蛋黄切成小丁。\\n3、锅中火上少许油烧热，下入葱姜末煸香。\\n4、倒入咸蛋黄，略炒一下。\\n5、随即倒入高汤，烧开。\\n6、入豆腐块、调少许盐，改至中小火烧至入味。\\n7、少许白胡椒粉提味。\\n8、彩椒碎丁、香葱碎、淋少许香油即可入盘上桌。\\n',
        口味: '清淡',
        工艺: '烧'
      }
    },
    {
      id: 340,
      name: '寸金肉',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '半小时',
        做法:
          '1、准备好所有的食材。\\n2、葱姜切碎加入热水制成葱姜汁备用。\\n3、猪里脊肉切大片用刀背拍松。\\n4、把猪肉片放入碗中加入盐，胡椒粉，鸡精，黄酒，葱姜水拌均匀。\\n5、火腿切碎末加入葱花和1克淀粉拌均匀。\\n6、蛋加入14克淀粉拌均匀成为蛋糊备用。\\n7、腌制好的肉片放入适量的火腿馅。\\n8、成长条封口沾点蛋液粘牢。\\n9、次全部做好。\\n10、均匀的滚上蛋液。\\n11、在沾满芝麻。\\n12、油锅烧制5成热放入肉条炸制浮起。\\n13、捞出沥油。\\n14、等油温升高再次放入复炸一遍至金黄。\\n15、捞出放在吸油纸上吸出油份，吃的时候每个切三小段即好。\\n',
        口味: '咸鲜',
        工艺: '炸'
      }
    },
    {
      id: 341,
      name: '椒盐蘑菇',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '廿分钟',
        做法:
          '1、蘑菇洗净晾干，撕成细条\\n2、鸡蛋磕入碗中，加淀粉、盐、胡椒粉、鸡精搅拌均匀\\n3、将鸡蛋液倒入蘑菇条中搅匀\\n4、空锅烧热，加花椒粉、盐、糖、胡椒粉炒热出香盛出备用\\n5、锅内入油，烧4成热，依次下入拌好的蘑菇条炸至金黄捞出沥干油\\n6、炒好的调料撒入蘑菇中拌匀即可\\n',
        口味: '咸鲜',
        工艺: '炸'
      }
    },
    {
      id: 343,
      name: '三鲜蒸排骨',
      group: '菜谱',
      radius: 5,
      color: null,
      textSize: '20',
      figure: null,
      properties: {
        耗时: '三刻钟',
        做法:
          '1、原料图如图。\\n2、排骨切小块焯水煮三分钟，水沸腾的时候撒点料酒。捞出洗净备用。\\n3、排骨用生姜丝和除水淀粉外所有调料，腌渍一小时。\\n4、冬笋冬菇切片，火腿条。\\n5、盘底铺配料。排骨码放在上面，腌渍排骨的汁水浇上。\\n6、锅蒸30分钟。\\n7、好的排骨滤掉汤汁，放点鸡精搅拌均匀，用水淀粉勾芡。\\n8、在排骨上即可。\\n',
        口味: '咸鲜',
        工艺: '蒸'
      }
    }
  ],
  links: [
    {
      name: '属于',
      id: 59,
      source: 53,
      target: 1,
      value: 1,
      from: 53,
      to: 1
    },
    {
      name: '属于',
      id: 53,
      source: 47,
      target: 1,
      value: 1,
      from: 47,
      to: 1
    },
    {
      name: '属于',
      id: 46,
      source: 43,
      target: 1,
      value: 1,
      from: 43,
      to: 1
    },
    {
      name: '属于',
      id: 43,
      source: 40,
      target: 1,
      value: 1,
      from: 40,
      to: 1
    },
    {
      name: '属于',
      id: 38,
      source: 35,
      target: 1,
      value: 1,
      from: 35,
      to: 1
    },
    {
      name: '属于',
      id: 32,
      source: 31,
      target: 1,
      value: 1,
      from: 31,
      to: 1
    },
    {
      name: '属于',
      id: 26,
      source: 25,
      target: 1,
      value: 1,
      from: 25,
      to: 1
    },
    {
      name: '属于',
      id: 18,
      source: 19,
      target: 1,
      value: 1,
      from: 19,
      to: 1
    },
    {
      name: '属于',
      id: 15,
      source: 16,
      target: 1,
      value: 1,
      from: 16,
      to: 1
    },
    {
      name: '属于',
      id: 9,
      source: 10,
      target: 1,
      value: 1,
      from: 10,
      to: 1
    },
    {
      name: '属于',
      id: 1,
      source: 2,
      target: 1,
      value: 1,
      from: 2,
      to: 1
    },
    {
      name: '属于',
      id: 122,
      source: 97,
      target: 57,
      value: 1,
      from: 97,
      to: 57
    },
    {
      name: '属于',
      id: 116,
      source: 92,
      target: 57,
      value: 1,
      from: 92,
      to: 57
    },
    {
      name: '属于',
      id: 113,
      source: 90,
      target: 57,
      value: 1,
      from: 90,
      to: 57
    },
    {
      name: '属于',
      id: 97,
      source: 80,
      target: 57,
      value: 1,
      from: 80,
      to: 57
    },
    {
      name: '属于',
      id: 93,
      source: 76,
      target: 57,
      value: 1,
      from: 76,
      to: 57
    },
    {
      name: '属于',
      id: 89,
      source: 72,
      target: 57,
      value: 1,
      from: 72,
      to: 57
    },
    {
      name: '属于',
      id: 82,
      source: 68,
      target: 57,
      value: 1,
      from: 68,
      to: 57
    },
    {
      name: '属于',
      id: 78,
      source: 65,
      target: 57,
      value: 1,
      from: 65,
      to: 57
    },
    {
      name: '属于',
      id: 73,
      source: 63,
      target: 57,
      value: 1,
      from: 63,
      to: 57
    },
    {
      name: '属于',
      id: 68,
      source: 60,
      target: 57,
      value: 1,
      from: 60,
      to: 57
    },
    {
      name: '属于',
      id: 64,
      source: 58,
      target: 57,
      value: 1,
      from: 58,
      to: 57
    },
    {
      name: '属于',
      id: 193,
      source: 153,
      target: 101,
      value: 1,
      from: 153,
      to: 101
    },
    {
      name: '属于',
      id: 188,
      source: 149,
      target: 101,
      value: 1,
      from: 149,
      to: 101
    },
    {
      name: '属于',
      id: 184,
      source: 146,
      target: 101,
      value: 1,
      from: 146,
      to: 101
    },
    {
      name: '属于',
      id: 179,
      source: 142,
      target: 101,
      value: 1,
      from: 142,
      to: 101
    },
    {
      name: '属于',
      id: 174,
      source: 137,
      target: 101,
      value: 1,
      from: 137,
      to: 101
    },
    {
      name: '属于',
      id: 168,
      source: 131,
      target: 101,
      value: 1,
      from: 131,
      to: 101
    },
    {
      name: '属于',
      id: 160,
      source: 126,
      target: 101,
      value: 1,
      from: 126,
      to: 101
    },
    {
      name: '属于',
      id: 149,
      source: 120,
      target: 101,
      value: 1,
      from: 120,
      to: 101
    },
    {
      name: '属于',
      id: 143,
      source: 116,
      target: 101,
      value: 1,
      from: 116,
      to: 101
    },
    {
      name: '属于',
      id: 132,
      source: 106,
      target: 101,
      value: 1,
      from: 106,
      to: 101
    },
    {
      name: '属于',
      id: 127,
      source: 102,
      target: 101,
      value: 1,
      from: 102,
      to: 101
    },
    {
      name: '属于',
      id: 255,
      source: 192,
      target: 156,
      value: 1,
      from: 192,
      to: 156
    },
    {
      name: '属于',
      id: 249,
      source: 188,
      target: 156,
      value: 1,
      from: 188,
      to: 156
    },
    {
      name: '属于',
      id: 246,
      source: 186,
      target: 156,
      value: 1,
      from: 186,
      to: 156
    },
    {
      name: '属于',
      id: 238,
      source: 180,
      target: 156,
      value: 1,
      from: 180,
      to: 156
    },
    {
      name: '属于',
      id: 234,
      source: 178,
      target: 156,
      value: 1,
      from: 178,
      to: 156
    },
    {
      name: '属于',
      id: 226,
      source: 173,
      target: 156,
      value: 1,
      from: 173,
      to: 156
    },
    {
      name: '属于',
      id: 221,
      source: 171,
      target: 156,
      value: 1,
      from: 171,
      to: 156
    },
    {
      name: '属于',
      id: 211,
      source: 165,
      target: 156,
      value: 1,
      from: 165,
      to: 156
    },
    {
      name: '属于',
      id: 206,
      source: 163,
      target: 156,
      value: 1,
      from: 163,
      to: 156
    },
    {
      name: '属于',
      id: 201,
      source: 159,
      target: 156,
      value: 1,
      from: 159,
      to: 156
    },
    {
      name: '属于',
      id: 197,
      source: 157,
      target: 156,
      value: 1,
      from: 157,
      to: 156
    },
    {
      name: '属于',
      id: 338,
      source: 241,
      target: 198,
      value: 1,
      from: 241,
      to: 198
    },
    {
      name: '属于',
      id: 331,
      source: 238,
      target: 198,
      value: 1,
      from: 238,
      to: 198
    },
    {
      name: '属于',
      id: 319,
      source: 234,
      target: 198,
      value: 1,
      from: 234,
      to: 198
    },
    {
      name: '属于',
      id: 314,
      source: 231,
      target: 198,
      value: 1,
      from: 231,
      to: 198
    },
    {
      name: '属于',
      id: 307,
      source: 224,
      target: 198,
      value: 1,
      from: 224,
      to: 198
    },
    {
      name: '属于',
      id: 304,
      source: 222,
      target: 198,
      value: 1,
      from: 222,
      to: 198
    },
    {
      name: '属于',
      id: 297,
      source: 218,
      target: 198,
      value: 1,
      from: 218,
      to: 198
    },
    {
      name: '属于',
      id: 286,
      source: 212,
      target: 198,
      value: 1,
      from: 212,
      to: 198
    },
    {
      name: '属于',
      id: 277,
      source: 207,
      target: 198,
      value: 1,
      from: 207,
      to: 198
    },
    {
      name: '属于',
      id: 268,
      source: 202,
      target: 198,
      value: 1,
      from: 202,
      to: 198
    },
    {
      name: '属于',
      id: 263,
      source: 199,
      target: 198,
      value: 1,
      from: 199,
      to: 198
    },
    {
      name: '属于',
      id: 404,
      source: 279,
      target: 248,
      value: 1,
      from: 279,
      to: 248
    },
    {
      name: '属于',
      id: 395,
      source: 275,
      target: 248,
      value: 1,
      from: 275,
      to: 248
    },
    {
      name: '属于',
      id: 391,
      source: 273,
      target: 248,
      value: 1,
      from: 273,
      to: 248
    },
    {
      name: '属于',
      id: 385,
      source: 271,
      target: 248,
      value: 1,
      from: 271,
      to: 248
    },
    {
      name: '属于',
      id: 381,
      source: 268,
      target: 248,
      value: 1,
      from: 268,
      to: 248
    },
    {
      name: '属于',
      id: 378,
      source: 265,
      target: 248,
      value: 1,
      from: 265,
      to: 248
    },
    {
      name: '属于',
      id: 371,
      source: 262,
      target: 248,
      value: 1,
      from: 262,
      to: 248
    },
    {
      name: '属于',
      id: 366,
      source: 259,
      target: 248,
      value: 1,
      from: 259,
      to: 248
    },
    {
      name: '属于',
      id: 360,
      source: 254,
      target: 248,
      value: 1,
      from: 254,
      to: 248
    },
    {
      name: '属于',
      id: 353,
      source: 251,
      target: 248,
      value: 1,
      from: 251,
      to: 248
    },
    {
      name: '属于',
      id: 348,
      source: 249,
      target: 248,
      value: 1,
      from: 249,
      to: 248
    },
    {
      name: '属于',
      id: 490,
      source: 312,
      target: 281,
      value: 1,
      from: 312,
      to: 281
    },
    {
      name: '属于',
      id: 478,
      source: 309,
      target: 281,
      value: 1,
      from: 309,
      to: 281
    },
    {
      name: '属于',
      id: 462,
      source: 304,
      target: 281,
      value: 1,
      from: 304,
      to: 281
    },
    {
      name: '属于',
      id: 455,
      source: 300,
      target: 281,
      value: 1,
      from: 300,
      to: 281
    },
    {
      name: '属于',
      id: 446,
      source: 297,
      target: 281,
      value: 1,
      from: 297,
      to: 281
    },
    {
      name: '属于',
      id: 439,
      source: 295,
      target: 281,
      value: 1,
      from: 295,
      to: 281
    },
    {
      name: '属于',
      id: 433,
      source: 293,
      target: 281,
      value: 1,
      from: 293,
      to: 281
    },
    {
      name: '属于',
      id: 429,
      source: 292,
      target: 281,
      value: 1,
      from: 292,
      to: 281
    },
    {
      name: '属于',
      id: 420,
      source: 286,
      target: 281,
      value: 1,
      from: 286,
      to: 281
    },
    {
      name: '属于',
      id: 414,
      source: 283,
      target: 281,
      value: 1,
      from: 283,
      to: 281
    },
    {
      name: '属于',
      id: 408,
      source: 282,
      target: 281,
      value: 1,
      from: 282,
      to: 281
    },
    {
      name: '属于',
      id: 558,
      source: 343,
      target: 314,
      value: 1,
      from: 343,
      to: 314
    },
    {
      name: '属于',
      id: 555,
      source: 341,
      target: 314,
      value: 1,
      from: 341,
      to: 314
    },
    {
      name: '属于',
      id: 549,
      source: 340,
      target: 314,
      value: 1,
      from: 340,
      to: 314
    },
    {
      name: '属于',
      id: 540,
      source: 335,
      target: 314,
      value: 1,
      from: 335,
      to: 314
    },
    {
      name: '属于',
      id: 525,
      source: 328,
      target: 314,
      value: 1,
      from: 328,
      to: 314
    },
    {
      name: '属于',
      id: 521,
      source: 327,
      target: 314,
      value: 1,
      from: 327,
      to: 314
    },
    {
      name: '属于',
      id: 513,
      source: 322,
      target: 314,
      value: 1,
      from: 322,
      to: 314
    },
    {
      name: '属于',
      id: 508,
      source: 320,
      target: 314,
      value: 1,
      from: 320,
      to: 314
    },
    {
      name: '属于',
      id: 504,
      source: 318,
      target: 314,
      value: 1,
      from: 318,
      to: 314
    },
    {
      name: '属于',
      id: 500,
      source: 316,
      target: 314,
      value: 1,
      from: 316,
      to: 314
    },
    {
      name: '属于',
      id: 494,
      source: 315,
      target: 314,
      value: 1,
      from: 315,
      to: 314
    },
    {
      name: '主食材',
      id: 19,
      source: 19,
      target: 3,
      value: 1,
      from: 19,
      to: 3
    },
    {
      name: '主食材',
      id: 2,
      source: 2,
      target: 3,
      value: 1,
      from: 2,
      to: 3
    },
    {
      name: '辅料',
      id: 3,
      source: 2,
      target: 4,
      value: 1,
      from: 2,
      to: 4
    },
    {
      name: '主食材',
      id: 321,
      source: 234,
      target: 4,
      value: 1,
      from: 234,
      to: 4
    },
    {
      name: '辅料',
      id: 493,
      source: 312,
      target: 5,
      value: 1,
      from: 312,
      to: 5
    },
    {
      name: '辅料',
      id: 253,
      source: 188,
      target: 5,
      value: 1,
      from: 188,
      to: 5
    },
    {
      name: '辅料',
      id: 223,
      source: 171,
      target: 5,
      value: 1,
      from: 171,
      to: 5
    },
    {
      name: '辅料',
      id: 4,
      source: 2,
      target: 5,
      value: 1,
      from: 2,
      to: 5
    },
    {
      name: '主食材',
      id: 151,
      source: 120,
      target: 5,
      value: 1,
      from: 120,
      to: 5
    },
    {
      name: '辅料',
      id: 224,
      source: 171,
      target: 6,
      value: 1,
      from: 171,
      to: 6
    },
    {
      name: '辅料',
      id: 187,
      source: 146,
      target: 6,
      value: 1,
      from: 146,
      to: 6
    },
    {
      name: '辅料',
      id: 5,
      source: 2,
      target: 6,
      value: 1,
      from: 2,
      to: 6
    },
    {
      name: '主食材',
      id: 516,
      source: 322,
      target: 6,
      value: 1,
      from: 322,
      to: 6
    },
    {
      name: '主食材',
      id: 281,
      source: 207,
      target: 6,
      value: 1,
      from: 207,
      to: 6
    },
    {
      name: '辅料',
      id: 323,
      source: 234,
      target: 7,
      value: 1,
      from: 234,
      to: 7
    },
    {
      name: '辅料',
      id: 6,
      source: 2,
      target: 7,
      value: 1,
      from: 2,
      to: 7
    },
    {
      name: '主食材',
      id: 163,
      source: 126,
      target: 7,
      value: 1,
      from: 126,
      to: 7
    },
    {
      name: '辅料',
      id: 7,
      source: 2,
      target: 8,
      value: 1,
      from: 2,
      to: 8
    },
    {
      name: '辅料',
      id: 330,
      source: 234,
      target: 9,
      value: 1,
      from: 234,
      to: 9
    },
    {
      name: '辅料',
      id: 232,
      source: 173,
      target: 9,
      value: 1,
      from: 173,
      to: 9
    },
    {
      name: '辅料',
      id: 158,
      source: 120,
      target: 9,
      value: 1,
      from: 120,
      to: 9
    },
    {
      name: '辅料',
      id: 80,
      source: 65,
      target: 9,
      value: 1,
      from: 65,
      to: 9
    },
    {
      name: '辅料',
      id: 21,
      source: 19,
      target: 9,
      value: 1,
      from: 19,
      to: 9
    },
    {
      name: '辅料',
      id: 8,
      source: 2,
      target: 9,
      value: 1,
      from: 2,
      to: 9
    },
    {
      name: '主食材',
      id: 70,
      source: 60,
      target: 11,
      value: 1,
      from: 60,
      to: 11
    },
    {
      name: '主食材',
      id: 10,
      source: 10,
      target: 11,
      value: 1,
      from: 10,
      to: 11
    },
    {
      name: '主食材',
      id: 11,
      source: 10,
      target: 12,
      value: 1,
      from: 10,
      to: 12
    },
    {
      name: '辅料',
      id: 12,
      source: 10,
      target: 13,
      value: 1,
      from: 10,
      to: 13
    },
    {
      name: '辅料',
      id: 13,
      source: 10,
      target: 14,
      value: 1,
      from: 10,
      to: 14
    },
    {
      name: '辅料',
      id: 394,
      source: 273,
      target: 15,
      value: 1,
      from: 273,
      to: 15
    },
    {
      name: '辅料',
      id: 14,
      source: 10,
      target: 15,
      value: 1,
      from: 10,
      to: 15
    },
    {
      name: '主食材',
      id: 235,
      source: 178,
      target: 17,
      value: 1,
      from: 178,
      to: 17
    },
    {
      name: '主食材',
      id: 16,
      source: 16,
      target: 17,
      value: 1,
      from: 16,
      to: 17
    },
    {
      name: '辅料',
      id: 17,
      source: 16,
      target: 18,
      value: 1,
      from: 16,
      to: 18
    },
    {
      name: '主食材',
      id: 20,
      source: 19,
      target: 20,
      value: 1,
      from: 19,
      to: 20
    },
    {
      name: '辅料',
      id: 557,
      source: 341,
      target: 21,
      value: 1,
      from: 341,
      to: 21
    },
    {
      name: '辅料',
      id: 510,
      source: 320,
      target: 21,
      value: 1,
      from: 320,
      to: 21
    },
    {
      name: '辅料',
      id: 370,
      source: 259,
      target: 21,
      value: 1,
      from: 259,
      to: 21
    },
    {
      name: '辅料',
      id: 203,
      source: 159,
      target: 21,
      value: 1,
      from: 159,
      to: 21
    },
    {
      name: '辅料',
      id: 182,
      source: 142,
      target: 21,
      value: 1,
      from: 142,
      to: 21
    },
    {
      name: '辅料',
      id: 51,
      source: 43,
      target: 21,
      value: 1,
      from: 43,
      to: 21
    },
    {
      name: '辅料',
      id: 22,
      source: 19,
      target: 21,
      value: 1,
      from: 19,
      to: 21
    },
    {
      name: '主食材',
      id: 552,
      source: 340,
      target: 21,
      value: 1,
      from: 340,
      to: 21
    },
    {
      name: '主食材',
      id: 497,
      source: 315,
      target: 21,
      value: 1,
      from: 315,
      to: 21
    },
    {
      name: '主食材',
      id: 387,
      source: 271,
      target: 21,
      value: 1,
      from: 271,
      to: 21
    },
    {
      name: '主食材',
      id: 288,
      source: 212,
      target: 21,
      value: 1,
      from: 212,
      to: 21
    },
    {
      name: '辅料',
      id: 52,
      source: 43,
      target: 22,
      value: 1,
      from: 43,
      to: 22
    },
    {
      name: '辅料',
      id: 23,
      source: 19,
      target: 22,
      value: 1,
      from: 19,
      to: 22
    },
    {
      name: '辅料',
      id: 535,
      source: 328,
      target: 23,
      value: 1,
      from: 328,
      to: 23
    },
    {
      name: '辅料',
      id: 523,
      source: 327,
      target: 23,
      value: 1,
      from: 327,
      to: 23
    },
    {
      name: '辅料',
      id: 488,
      source: 309,
      target: 23,
      value: 1,
      from: 309,
      to: 23
    },
    {
      name: '辅料',
      id: 451,
      source: 297,
      target: 23,
      value: 1,
      from: 297,
      to: 23
    },
    {
      name: '辅料',
      id: 438,
      source: 293,
      target: 23,
      value: 1,
      from: 293,
      to: 23
    },
    {
      name: '辅料',
      id: 417,
      source: 283,
      target: 23,
      value: 1,
      from: 283,
      to: 23
    },
    {
      name: '辅料',
      id: 388,
      source: 271,
      target: 23,
      value: 1,
      from: 271,
      to: 23
    },
    {
      name: '辅料',
      id: 377,
      source: 262,
      target: 23,
      value: 1,
      from: 262,
      to: 23
    },
    {
      name: '辅料',
      id: 358,
      source: 251,
      target: 23,
      value: 1,
      from: 251,
      to: 23
    },
    {
      name: '辅料',
      id: 352,
      source: 249,
      target: 23,
      value: 1,
      from: 249,
      to: 23
    },
    {
      name: '辅料',
      id: 325,
      source: 234,
      target: 23,
      value: 1,
      from: 234,
      to: 23
    },
    {
      name: '辅料',
      id: 274,
      source: 202,
      target: 23,
      value: 1,
      from: 202,
      to: 23
    },
    {
      name: '辅料',
      id: 225,
      source: 171,
      target: 23,
      value: 1,
      from: 171,
      to: 23
    },
    {
      name: '辅料',
      id: 220,
      source: 165,
      target: 23,
      value: 1,
      from: 165,
      to: 23
    },
    {
      name: '辅料',
      id: 208,
      source: 163,
      target: 23,
      value: 1,
      from: 163,
      to: 23
    },
    {
      name: '辅料',
      id: 200,
      source: 157,
      target: 23,
      value: 1,
      from: 157,
      to: 23
    },
    {
      name: '辅料',
      id: 99,
      source: 80,
      target: 23,
      value: 1,
      from: 80,
      to: 23
    },
    {
      name: '辅料',
      id: 85,
      source: 68,
      target: 23,
      value: 1,
      from: 68,
      to: 23
    },
    {
      name: '辅料',
      id: 76,
      source: 63,
      target: 23,
      value: 1,
      from: 63,
      to: 23
    },
    {
      name: '辅料',
      id: 67,
      source: 58,
      target: 23,
      value: 1,
      from: 58,
      to: 23
    },
    {
      name: '辅料',
      id: 36,
      source: 31,
      target: 23,
      value: 1,
      from: 31,
      to: 23
    },
    {
      name: '辅料',
      id: 24,
      source: 19,
      target: 23,
      value: 1,
      from: 19,
      to: 23
    },
    {
      name: '辅料',
      id: 25,
      source: 19,
      target: 24,
      value: 1,
      from: 19,
      to: 24
    },
    {
      name: '主食材',
      id: 256,
      source: 192,
      target: 26,
      value: 1,
      from: 192,
      to: 26
    },
    {
      name: '主食材',
      id: 27,
      source: 25,
      target: 26,
      value: 1,
      from: 25,
      to: 26
    },
    {
      name: '主食材',
      id: 28,
      source: 25,
      target: 27,
      value: 1,
      from: 25,
      to: 27
    },
    {
      name: '辅料',
      id: 524,
      source: 327,
      target: 28,
      value: 1,
      from: 327,
      to: 28
    },
    {
      name: '辅料',
      id: 480,
      source: 309,
      target: 28,
      value: 1,
      from: 309,
      to: 28
    },
    {
      name: '辅料',
      id: 437,
      source: 293,
      target: 28,
      value: 1,
      from: 293,
      to: 28
    },
    {
      name: '辅料',
      id: 416,
      source: 283,
      target: 28,
      value: 1,
      from: 283,
      to: 28
    },
    {
      name: '辅料',
      id: 373,
      source: 262,
      target: 28,
      value: 1,
      from: 262,
      to: 28
    },
    {
      name: '辅料',
      id: 357,
      source: 251,
      target: 28,
      value: 1,
      from: 251,
      to: 28
    },
    {
      name: '辅料',
      id: 351,
      source: 249,
      target: 28,
      value: 1,
      from: 249,
      to: 28
    },
    {
      name: '辅料',
      id: 324,
      source: 234,
      target: 28,
      value: 1,
      from: 234,
      to: 28
    },
    {
      name: '辅料',
      id: 273,
      source: 202,
      target: 28,
      value: 1,
      from: 202,
      to: 28
    },
    {
      name: '辅料',
      id: 215,
      source: 165,
      target: 28,
      value: 1,
      from: 165,
      to: 28
    },
    {
      name: '辅料',
      id: 100,
      source: 80,
      target: 28,
      value: 1,
      from: 80,
      to: 28
    },
    {
      name: '辅料',
      id: 75,
      source: 63,
      target: 28,
      value: 1,
      from: 63,
      to: 28
    },
    {
      name: '辅料',
      id: 72,
      source: 60,
      target: 28,
      value: 1,
      from: 60,
      to: 28
    },
    {
      name: '辅料',
      id: 66,
      source: 58,
      target: 28,
      value: 1,
      from: 58,
      to: 28
    },
    {
      name: '辅料',
      id: 29,
      source: 25,
      target: 28,
      value: 1,
      from: 25,
      to: 28
    },
    {
      name: '辅料',
      id: 536,
      source: 328,
      target: 29,
      value: 1,
      from: 328,
      to: 29
    },
    {
      name: '辅料',
      id: 502,
      source: 316,
      target: 29,
      value: 1,
      from: 316,
      to: 29
    },
    {
      name: '辅料',
      id: 489,
      source: 309,
      target: 29,
      value: 1,
      from: 309,
      to: 29
    },
    {
      name: '辅料',
      id: 459,
      source: 300,
      target: 29,
      value: 1,
      from: 300,
      to: 29
    },
    {
      name: '辅料',
      id: 436,
      source: 293,
      target: 29,
      value: 1,
      from: 293,
      to: 29
    },
    {
      name: '辅料',
      id: 418,
      source: 283,
      target: 29,
      value: 1,
      from: 283,
      to: 29
    },
    {
      name: '辅料',
      id: 359,
      source: 251,
      target: 29,
      value: 1,
      from: 251,
      to: 29
    },
    {
      name: '辅料',
      id: 252,
      source: 188,
      target: 29,
      value: 1,
      from: 188,
      to: 29
    },
    {
      name: '辅料',
      id: 101,
      source: 80,
      target: 29,
      value: 1,
      from: 80,
      to: 29
    },
    {
      name: '辅料',
      id: 86,
      source: 68,
      target: 29,
      value: 1,
      from: 68,
      to: 29
    },
    {
      name: '辅料',
      id: 77,
      source: 63,
      target: 29,
      value: 1,
      from: 63,
      to: 29
    },
    {
      name: '辅料',
      id: 37,
      source: 31,
      target: 29,
      value: 1,
      from: 31,
      to: 29
    },
    {
      name: '辅料',
      id: 30,
      source: 25,
      target: 29,
      value: 1,
      from: 25,
      to: 29
    },
    {
      name: '辅料',
      id: 533,
      source: 328,
      target: 30,
      value: 1,
      from: 328,
      to: 30
    },
    {
      name: '辅料',
      id: 471,
      source: 304,
      target: 30,
      value: 1,
      from: 304,
      to: 30
    },
    {
      name: '辅料',
      id: 453,
      source: 297,
      target: 30,
      value: 1,
      from: 297,
      to: 30
    },
    {
      name: '辅料',
      id: 335,
      source: 238,
      target: 30,
      value: 1,
      from: 238,
      to: 30
    },
    {
      name: '辅料',
      id: 271,
      source: 202,
      target: 30,
      value: 1,
      from: 202,
      to: 30
    },
    {
      name: '辅料',
      id: 102,
      source: 80,
      target: 30,
      value: 1,
      from: 80,
      to: 30
    },
    {
      name: '辅料',
      id: 50,
      source: 43,
      target: 30,
      value: 1,
      from: 43,
      to: 30
    },
    {
      name: '辅料',
      id: 31,
      source: 25,
      target: 30,
      value: 1,
      from: 25,
      to: 30
    },
    {
      name: '主食材',
      id: 392,
      source: 273,
      target: 32,
      value: 1,
      from: 273,
      to: 32
    },
    {
      name: '主食材',
      id: 144,
      source: 116,
      target: 32,
      value: 1,
      from: 116,
      to: 32
    },
    {
      name: '主食材',
      id: 33,
      source: 31,
      target: 32,
      value: 1,
      from: 31,
      to: 32
    },
    {
      name: '主食材',
      id: 34,
      source: 31,
      target: 33,
      value: 1,
      from: 31,
      to: 33
    },
    {
      name: '辅料',
      id: 147,
      source: 116,
      target: 34,
      value: 1,
      from: 116,
      to: 34
    },
    {
      name: '辅料',
      id: 35,
      source: 31,
      target: 34,
      value: 1,
      from: 31,
      to: 34
    },
    {
      name: '辅料',
      id: 289,
      source: 212,
      target: 36,
      value: 1,
      from: 212,
      to: 36
    },
    {
      name: '主食材',
      id: 39,
      source: 35,
      target: 36,
      value: 1,
      from: 35,
      to: 36
    },
    {
      name: '辅料',
      id: 534,
      source: 328,
      target: 37,
      value: 1,
      from: 328,
      to: 37
    },
    {
      name: '辅料',
      id: 441,
      source: 295,
      target: 37,
      value: 1,
      from: 295,
      to: 37
    },
    {
      name: '辅料',
      id: 431,
      source: 292,
      target: 37,
      value: 1,
      from: 292,
      to: 37
    },
    {
      name: '辅料',
      id: 125,
      source: 97,
      target: 37,
      value: 1,
      from: 97,
      to: 37
    },
    {
      name: '辅料',
      id: 84,
      source: 68,
      target: 37,
      value: 1,
      from: 68,
      to: 37
    },
    {
      name: '辅料',
      id: 40,
      source: 35,
      target: 37,
      value: 1,
      from: 35,
      to: 37
    },
    {
      name: '辅料',
      id: 41,
      source: 35,
      target: 38,
      value: 1,
      from: 35,
      to: 38
    },
    {
      name: '辅料',
      id: 42,
      source: 35,
      target: 39,
      value: 1,
      from: 35,
      to: 39
    },
    {
      name: '主食材',
      id: 44,
      source: 40,
      target: 41,
      value: 1,
      from: 40,
      to: 41
    },
    {
      name: '辅料',
      id: 118,
      source: 92,
      target: 42,
      value: 1,
      from: 92,
      to: 42
    },
    {
      name: '辅料',
      id: 45,
      source: 40,
      target: 42,
      value: 1,
      from: 40,
      to: 42
    },
    {
      name: '辅料',
      id: 61,
      source: 53,
      target: 44,
      value: 1,
      from: 53,
      to: 44
    },
    {
      name: '主食材',
      id: 47,
      source: 43,
      target: 44,
      value: 1,
      from: 43,
      to: 44
    },
    {
      name: '主食材',
      id: 48,
      source: 43,
      target: 45,
      value: 1,
      from: 43,
      to: 45
    },
    {
      name: '辅料',
      id: 245,
      source: 180,
      target: 46,
      value: 1,
      from: 180,
      to: 46
    },
    {
      name: '辅料',
      id: 49,
      source: 43,
      target: 46,
      value: 1,
      from: 43,
      to: 46
    },
    {
      name: '主食材',
      id: 463,
      source: 304,
      target: 48,
      value: 1,
      from: 304,
      to: 48
    },
    {
      name: '主食材',
      id: 456,
      source: 300,
      target: 48,
      value: 1,
      from: 300,
      to: 48
    },
    {
      name: '主食材',
      id: 440,
      source: 295,
      target: 48,
      value: 1,
      from: 295,
      to: 48
    },
    {
      name: '主食材',
      id: 430,
      source: 292,
      target: 48,
      value: 1,
      from: 292,
      to: 48
    },
    {
      name: '主食材',
      id: 409,
      source: 282,
      target: 48,
      value: 1,
      from: 282,
      to: 48
    },
    {
      name: '主食材',
      id: 339,
      source: 241,
      target: 48,
      value: 1,
      from: 241,
      to: 48
    },
    {
      name: '主食材',
      id: 212,
      source: 165,
      target: 48,
      value: 1,
      from: 165,
      to: 48
    },
    {
      name: '主食材',
      id: 54,
      source: 47,
      target: 48,
      value: 1,
      from: 47,
      to: 48
    },
    {
      name: '辅料',
      id: 458,
      source: 300,
      target: 49,
      value: 1,
      from: 300,
      to: 49
    },
    {
      name: '辅料',
      id: 448,
      source: 297,
      target: 49,
      value: 1,
      from: 297,
      to: 49
    },
    {
      name: '辅料',
      id: 55,
      source: 47,
      target: 49,
      value: 1,
      from: 47,
      to: 49
    },
    {
      name: '辅料',
      id: 563,
      source: 343,
      target: 50,
      value: 1,
      from: 343,
      to: 50
    },
    {
      name: '辅料',
      id: 506,
      source: 318,
      target: 50,
      value: 1,
      from: 318,
      to: 50
    },
    {
      name: '辅料',
      id: 432,
      source: 292,
      target: 50,
      value: 1,
      from: 292,
      to: 50
    },
    {
      name: '辅料',
      id: 413,
      source: 282,
      target: 50,
      value: 1,
      from: 282,
      to: 50
    },
    {
      name: '辅料',
      id: 56,
      source: 47,
      target: 50,
      value: 1,
      from: 47,
      to: 50
    },
    {
      name: '辅料',
      id: 564,
      source: 343,
      target: 51,
      value: 1,
      from: 343,
      to: 51
    },
    {
      name: '辅料',
      id: 520,
      source: 322,
      target: 51,
      value: 1,
      from: 322,
      to: 51
    },
    {
      name: '辅料',
      id: 411,
      source: 282,
      target: 51,
      value: 1,
      from: 282,
      to: 51
    },
    {
      name: '辅料',
      id: 57,
      source: 47,
      target: 51,
      value: 1,
      from: 47,
      to: 51
    },
    {
      name: '辅料',
      id: 58,
      source: 47,
      target: 52,
      value: 1,
      from: 47,
      to: 52
    },
    {
      name: '主食材',
      id: 496,
      source: 315,
      target: 54,
      value: 1,
      from: 315,
      to: 54
    },
    {
      name: '主食材',
      id: 227,
      source: 173,
      target: 54,
      value: 1,
      from: 173,
      to: 54
    },
    {
      name: '主食材',
      id: 60,
      source: 53,
      target: 54,
      value: 1,
      from: 53,
      to: 54
    },
    {
      name: '辅料',
      id: 62,
      source: 53,
      target: 55,
      value: 1,
      from: 53,
      to: 55
    },
    {
      name: '辅料',
      id: 63,
      source: 53,
      target: 56,
      value: 1,
      from: 53,
      to: 56
    },
    {
      name: '主食材',
      id: 65,
      source: 58,
      target: 59,
      value: 1,
      from: 58,
      to: 59
    },
    {
      name: '主食材',
      id: 69,
      source: 60,
      target: 61,
      value: 1,
      from: 60,
      to: 61
    },
    {
      name: '辅料',
      id: 333,
      source: 238,
      target: 62,
      value: 1,
      from: 238,
      to: 62
    },
    {
      name: '辅料',
      id: 306,
      source: 222,
      target: 62,
      value: 1,
      from: 222,
      to: 62
    },
    {
      name: '辅料',
      id: 300,
      source: 218,
      target: 62,
      value: 1,
      from: 218,
      to: 62
    },
    {
      name: '辅料',
      id: 196,
      source: 153,
      target: 62,
      value: 1,
      from: 153,
      to: 62
    },
    {
      name: '辅料',
      id: 131,
      source: 102,
      target: 62,
      value: 1,
      from: 102,
      to: 62
    },
    {
      name: '辅料',
      id: 71,
      source: 60,
      target: 62,
      value: 1,
      from: 60,
      to: 62
    },
    {
      name: '主食材',
      id: 341,
      source: 241,
      target: 64,
      value: 1,
      from: 241,
      to: 64
    },
    {
      name: '主食材',
      id: 74,
      source: 63,
      target: 64,
      value: 1,
      from: 63,
      to: 64
    },
    {
      name: '主食材',
      id: 79,
      source: 65,
      target: 66,
      value: 1,
      from: 65,
      to: 66
    },
    {
      name: '辅料',
      id: 498,
      source: 315,
      target: 67,
      value: 1,
      from: 315,
      to: 67
    },
    {
      name: '辅料',
      id: 233,
      source: 173,
      target: 67,
      value: 1,
      from: 173,
      to: 67
    },
    {
      name: '辅料',
      id: 81,
      source: 65,
      target: 67,
      value: 1,
      from: 65,
      to: 67
    },
    {
      name: '主食材',
      id: 83,
      source: 68,
      target: 69,
      value: 1,
      from: 68,
      to: 69
    },
    {
      name: '辅料',
      id: 546,
      source: 335,
      target: 70,
      value: 1,
      from: 335,
      to: 70
    },
    {
      name: '辅料',
      id: 486,
      source: 309,
      target: 70,
      value: 1,
      from: 309,
      to: 70
    },
    {
      name: '辅料',
      id: 465,
      source: 304,
      target: 70,
      value: 1,
      from: 304,
      to: 70
    },
    {
      name: '辅料',
      id: 425,
      source: 286,
      target: 70,
      value: 1,
      from: 286,
      to: 70
    },
    {
      name: '辅料',
      id: 398,
      source: 275,
      target: 70,
      value: 1,
      from: 275,
      to: 70
    },
    {
      name: '辅料',
      id: 344,
      source: 241,
      target: 70,
      value: 1,
      from: 241,
      to: 70
    },
    {
      name: '辅料',
      id: 270,
      source: 202,
      target: 70,
      value: 1,
      from: 202,
      to: 70
    },
    {
      name: '辅料',
      id: 167,
      source: 126,
      target: 70,
      value: 1,
      from: 126,
      to: 70
    },
    {
      name: '辅料',
      id: 152,
      source: 120,
      target: 70,
      value: 1,
      from: 120,
      to: 70
    },
    {
      name: '辅料',
      id: 110,
      source: 80,
      target: 70,
      value: 1,
      from: 80,
      to: 70
    },
    {
      name: '辅料',
      id: 87,
      source: 68,
      target: 70,
      value: 1,
      from: 68,
      to: 70
    },
    {
      name: '辅料',
      id: 154,
      source: 120,
      target: 71,
      value: 1,
      from: 120,
      to: 71
    },
    {
      name: '辅料',
      id: 112,
      source: 80,
      target: 71,
      value: 1,
      from: 80,
      to: 71
    },
    {
      name: '辅料',
      id: 88,
      source: 68,
      target: 71,
      value: 1,
      from: 68,
      to: 71
    },
    {
      name: '主食材',
      id: 90,
      source: 72,
      target: 73,
      value: 1,
      from: 72,
      to: 73
    },
    {
      name: '主食材',
      id: 91,
      source: 72,
      target: 74,
      value: 1,
      from: 72,
      to: 74
    },
    {
      name: '辅料',
      id: 92,
      source: 72,
      target: 75,
      value: 1,
      from: 72,
      to: 75
    },
    {
      name: '主食材',
      id: 207,
      source: 163,
      target: 77,
      value: 1,
      from: 163,
      to: 77
    },
    {
      name: '主食材',
      id: 94,
      source: 76,
      target: 77,
      value: 1,
      from: 76,
      to: 77
    },
    {
      name: '辅料',
      id: 210,
      source: 163,
      target: 78,
      value: 1,
      from: 163,
      to: 78
    },
    {
      name: '主食材',
      id: 95,
      source: 76,
      target: 78,
      value: 1,
      from: 76,
      to: 78
    },
    {
      name: '辅料',
      id: 96,
      source: 76,
      target: 79,
      value: 1,
      from: 76,
      to: 79
    },
    {
      name: '主食材',
      id: 526,
      source: 328,
      target: 81,
      value: 1,
      from: 328,
      to: 81
    },
    {
      name: '主食材',
      id: 509,
      source: 320,
      target: 81,
      value: 1,
      from: 320,
      to: 81
    },
    {
      name: '主食材',
      id: 98,
      source: 80,
      target: 81,
      value: 1,
      from: 80,
      to: 81
    },
    {
      name: '辅料',
      id: 530,
      source: 328,
      target: 82,
      value: 1,
      from: 328,
      to: 82
    },
    {
      name: '辅料',
      id: 476,
      source: 304,
      target: 82,
      value: 1,
      from: 304,
      to: 82
    },
    {
      name: '辅料',
      id: 445,
      source: 295,
      target: 82,
      value: 1,
      from: 295,
      to: 82
    },
    {
      name: '辅料',
      id: 412,
      source: 282,
      target: 82,
      value: 1,
      from: 282,
      to: 82
    },
    {
      name: '辅料',
      id: 103,
      source: 80,
      target: 82,
      value: 1,
      from: 80,
      to: 82
    },
    {
      name: '辅料',
      id: 528,
      source: 328,
      target: 83,
      value: 1,
      from: 328,
      to: 83
    },
    {
      name: '辅料',
      id: 481,
      source: 309,
      target: 83,
      value: 1,
      from: 309,
      to: 83
    },
    {
      name: '辅料',
      id: 474,
      source: 304,
      target: 83,
      value: 1,
      from: 304,
      to: 83
    },
    {
      name: '辅料',
      id: 454,
      source: 297,
      target: 83,
      value: 1,
      from: 297,
      to: 83
    },
    {
      name: '辅料',
      id: 410,
      source: 282,
      target: 83,
      value: 1,
      from: 282,
      to: 83
    },
    {
      name: '辅料',
      id: 336,
      source: 238,
      target: 83,
      value: 1,
      from: 238,
      to: 83
    },
    {
      name: '辅料',
      id: 104,
      source: 80,
      target: 83,
      value: 1,
      from: 80,
      to: 83
    },
    {
      name: '辅料',
      id: 472,
      source: 304,
      target: 84,
      value: 1,
      from: 304,
      to: 84
    },
    {
      name: '辅料',
      id: 105,
      source: 80,
      target: 84,
      value: 1,
      from: 80,
      to: 84
    },
    {
      name: '主食材',
      id: 423,
      source: 286,
      target: 84,
      value: 1,
      from: 286,
      to: 84
    },
    {
      name: '辅料',
      id: 106,
      source: 80,
      target: 85,
      value: 1,
      from: 80,
      to: 85
    },
    {
      name: '辅料',
      id: 107,
      source: 80,
      target: 86,
      value: 1,
      from: 80,
      to: 86
    },
    {
      name: '辅料',
      id: 468,
      source: 304,
      target: 87,
      value: 1,
      from: 304,
      to: 87
    },
    {
      name: '辅料',
      id: 376,
      source: 262,
      target: 87,
      value: 1,
      from: 262,
      to: 87
    },
    {
      name: '辅料',
      id: 115,
      source: 90,
      target: 87,
      value: 1,
      from: 90,
      to: 87
    },
    {
      name: '辅料',
      id: 108,
      source: 80,
      target: 87,
      value: 1,
      from: 80,
      to: 87
    },
    {
      name: '辅料',
      id: 467,
      source: 304,
      target: 88,
      value: 1,
      from: 304,
      to: 88
    },
    {
      name: '辅料',
      id: 401,
      source: 275,
      target: 88,
      value: 1,
      from: 275,
      to: 88
    },
    {
      name: '辅料',
      id: 157,
      source: 120,
      target: 88,
      value: 1,
      from: 120,
      to: 88
    },
    {
      name: '辅料',
      id: 109,
      source: 80,
      target: 88,
      value: 1,
      from: 80,
      to: 88
    },
    {
      name: '辅料',
      id: 111,
      source: 80,
      target: 89,
      value: 1,
      from: 80,
      to: 89
    },
    {
      name: '主食材',
      id: 114,
      source: 90,
      target: 91,
      value: 1,
      from: 90,
      to: 91
    },
    {
      name: '主食材',
      id: 117,
      source: 92,
      target: 93,
      value: 1,
      from: 92,
      to: 93
    },
    {
      name: '辅料',
      id: 119,
      source: 92,
      target: 94,
      value: 1,
      from: 92,
      to: 94
    },
    {
      name: '辅料',
      id: 554,
      source: 340,
      target: 95,
      value: 1,
      from: 340,
      to: 95
    },
    {
      name: '辅料',
      id: 120,
      source: 92,
      target: 95,
      value: 1,
      from: 92,
      to: 95
    },
    {
      name: '主食材',
      id: 282,
      source: 207,
      target: 95,
      value: 1,
      from: 207,
      to: 95
    },
    {
      name: '辅料',
      id: 121,
      source: 92,
      target: 96,
      value: 1,
      from: 92,
      to: 96
    },
    {
      name: '主食材',
      id: 550,
      source: 340,
      target: 98,
      value: 1,
      from: 340,
      to: 98
    },
    {
      name: '主食材',
      id: 123,
      source: 97,
      target: 98,
      value: 1,
      from: 97,
      to: 98
    },
    {
      name: '辅料',
      id: 124,
      source: 97,
      target: 99,
      value: 1,
      from: 97,
      to: 99
    },
    {
      name: '辅料',
      id: 327,
      source: 234,
      target: 100,
      value: 1,
      from: 234,
      to: 100
    },
    {
      name: '辅料',
      id: 126,
      source: 97,
      target: 100,
      value: 1,
      from: 97,
      to: 100
    },
    {
      name: '主食材',
      id: 367,
      source: 259,
      target: 100,
      value: 1,
      from: 259,
      to: 100
    },
    {
      name: '主食材',
      id: 128,
      source: 102,
      target: 103,
      value: 1,
      from: 102,
      to: 103
    },
    {
      name: '辅料',
      id: 492,
      source: 312,
      target: 104,
      value: 1,
      from: 312,
      to: 104
    },
    {
      name: '辅料',
      id: 292,
      source: 212,
      target: 104,
      value: 1,
      from: 212,
      to: 104
    },
    {
      name: '辅料',
      id: 140,
      source: 106,
      target: 104,
      value: 1,
      from: 106,
      to: 104
    },
    {
      name: '主食材',
      id: 355,
      source: 251,
      target: 104,
      value: 1,
      from: 251,
      to: 104
    },
    {
      name: '主食材',
      id: 280,
      source: 207,
      target: 104,
      value: 1,
      from: 207,
      to: 104
    },
    {
      name: '主食材',
      id: 161,
      source: 126,
      target: 104,
      value: 1,
      from: 126,
      to: 104
    },
    {
      name: '主食材',
      id: 129,
      source: 102,
      target: 104,
      value: 1,
      from: 102,
      to: 104
    },
    {
      name: '辅料',
      id: 544,
      source: 335,
      target: 105,
      value: 1,
      from: 335,
      to: 105
    },
    {
      name: '辅料',
      id: 452,
      source: 297,
      target: 105,
      value: 1,
      from: 297,
      to: 105
    },
    {
      name: '辅料',
      id: 399,
      source: 275,
      target: 105,
      value: 1,
      from: 275,
      to: 105
    },
    {
      name: '辅料',
      id: 389,
      source: 271,
      target: 105,
      value: 1,
      from: 271,
      to: 105
    },
    {
      name: '辅料',
      id: 334,
      source: 238,
      target: 105,
      value: 1,
      from: 238,
      to: 105
    },
    {
      name: '辅料',
      id: 301,
      source: 218,
      target: 105,
      value: 1,
      from: 218,
      to: 105
    },
    {
      name: '辅料',
      id: 199,
      source: 157,
      target: 105,
      value: 1,
      from: 157,
      to: 105
    },
    {
      name: '辅料',
      id: 130,
      source: 102,
      target: 105,
      value: 1,
      from: 102,
      to: 105
    },
    {
      name: '主食材',
      id: 258,
      source: 192,
      target: 105,
      value: 1,
      from: 192,
      to: 105
    },
    {
      name: '主食材',
      id: 133,
      source: 106,
      target: 107,
      value: 1,
      from: 106,
      to: 107
    },
    {
      name: '主食材',
      id: 134,
      source: 106,
      target: 108,
      value: 1,
      from: 106,
      to: 108
    },
    {
      name: '主食材',
      id: 135,
      source: 106,
      target: 109,
      value: 1,
      from: 106,
      to: 109
    },
    {
      name: '主食材',
      id: 136,
      source: 106,
      target: 110,
      value: 1,
      from: 106,
      to: 110
    },
    {
      name: '主食材',
      id: 137,
      source: 106,
      target: 111,
      value: 1,
      from: 106,
      to: 111
    },
    {
      name: '辅料',
      id: 265,
      source: 199,
      target: 112,
      value: 1,
      from: 199,
      to: 112
    },
    {
      name: '主食材',
      id: 138,
      source: 106,
      target: 112,
      value: 1,
      from: 106,
      to: 112
    },
    {
      name: '辅料',
      id: 139,
      source: 106,
      target: 113,
      value: 1,
      from: 106,
      to: 113
    },
    {
      name: '辅料',
      id: 141,
      source: 106,
      target: 114,
      value: 1,
      from: 106,
      to: 114
    },
    {
      name: '辅料',
      id: 442,
      source: 295,
      target: 115,
      value: 1,
      from: 295,
      to: 115
    },
    {
      name: '辅料',
      id: 142,
      source: 106,
      target: 115,
      value: 1,
      from: 106,
      to: 115
    },
    {
      name: '主食材',
      id: 349,
      source: 249,
      target: 117,
      value: 1,
      from: 249,
      to: 117
    },
    {
      name: '主食材',
      id: 190,
      source: 149,
      target: 117,
      value: 1,
      from: 149,
      to: 117
    },
    {
      name: '主食材',
      id: 145,
      source: 116,
      target: 117,
      value: 1,
      from: 116,
      to: 117
    },
    {
      name: '主食材',
      id: 146,
      source: 116,
      target: 118,
      value: 1,
      from: 116,
      to: 118
    },
    {
      name: '辅料',
      id: 148,
      source: 116,
      target: 119,
      value: 1,
      from: 116,
      to: 119
    },
    {
      name: '主食材',
      id: 150,
      source: 120,
      target: 121,
      value: 1,
      from: 120,
      to: 121
    },
    {
      name: '辅料',
      id: 484,
      source: 309,
      target: 122,
      value: 1,
      from: 309,
      to: 122
    },
    {
      name: '辅料',
      id: 402,
      source: 275,
      target: 122,
      value: 1,
      from: 275,
      to: 122
    },
    {
      name: '辅料',
      id: 153,
      source: 120,
      target: 122,
      value: 1,
      from: 120,
      to: 122
    },
    {
      name: '辅料',
      id: 466,
      source: 304,
      target: 123,
      value: 1,
      from: 304,
      to: 123
    },
    {
      name: '辅料',
      id: 216,
      source: 165,
      target: 123,
      value: 1,
      from: 165,
      to: 123
    },
    {
      name: '辅料',
      id: 155,
      source: 120,
      target: 123,
      value: 1,
      from: 120,
      to: 123
    },
    {
      name: '辅料',
      id: 248,
      source: 186,
      target: 124,
      value: 1,
      from: 186,
      to: 124
    },
    {
      name: '辅料',
      id: 156,
      source: 120,
      target: 124,
      value: 1,
      from: 120,
      to: 124
    },
    {
      name: '辅料',
      id: 548,
      source: 335,
      target: 125,
      value: 1,
      from: 335,
      to: 125
    },
    {
      name: '辅料',
      id: 407,
      source: 279,
      target: 125,
      value: 1,
      from: 279,
      to: 125
    },
    {
      name: '辅料',
      id: 242,
      source: 180,
      target: 125,
      value: 1,
      from: 180,
      to: 125
    },
    {
      name: '辅料',
      id: 159,
      source: 120,
      target: 125,
      value: 1,
      from: 120,
      to: 125
    },
    {
      name: '辅料',
      id: 512,
      source: 320,
      target: 127,
      value: 1,
      from: 320,
      to: 127
    },
    {
      name: '主食材',
      id: 406,
      source: 279,
      target: 127,
      value: 1,
      from: 279,
      to: 127
    },
    {
      name: '主食材',
      id: 162,
      source: 126,
      target: 127,
      value: 1,
      from: 126,
      to: 127
    },
    {
      name: '辅料',
      id: 164,
      source: 126,
      target: 128,
      value: 1,
      from: 126,
      to: 128
    },
    {
      name: '辅料',
      id: 236,
      source: 178,
      target: 129,
      value: 1,
      from: 178,
      to: 129
    },
    {
      name: '辅料',
      id: 165,
      source: 126,
      target: 129,
      value: 1,
      from: 126,
      to: 129
    },
    {
      name: '辅料',
      id: 166,
      source: 126,
      target: 130,
      value: 1,
      from: 126,
      to: 130
    },
    {
      name: '主食材',
      id: 169,
      source: 131,
      target: 132,
      value: 1,
      from: 131,
      to: 132
    },
    {
      name: '辅料',
      id: 170,
      source: 131,
      target: 133,
      value: 1,
      from: 131,
      to: 133
    },
    {
      name: '辅料',
      id: 171,
      source: 131,
      target: 134,
      value: 1,
      from: 131,
      to: 134
    },
    {
      name: '辅料',
      id: 172,
      source: 131,
      target: 135,
      value: 1,
      from: 131,
      to: 135
    },
    {
      name: '辅料',
      id: 173,
      source: 131,
      target: 136,
      value: 1,
      from: 131,
      to: 136
    },
    {
      name: '主食材',
      id: 175,
      source: 137,
      target: 138,
      value: 1,
      from: 137,
      to: 138
    },
    {
      name: '主食材',
      id: 176,
      source: 137,
      target: 139,
      value: 1,
      from: 137,
      to: 139
    },
    {
      name: '主食材',
      id: 177,
      source: 137,
      target: 140,
      value: 1,
      from: 137,
      to: 140
    },
    {
      name: '辅料',
      id: 178,
      source: 137,
      target: 141,
      value: 1,
      from: 137,
      to: 141
    },
    {
      name: '主食材',
      id: 180,
      source: 142,
      target: 143,
      value: 1,
      from: 142,
      to: 143
    },
    {
      name: '主食材',
      id: 181,
      source: 142,
      target: 144,
      value: 1,
      from: 142,
      to: 144
    },
    {
      name: '辅料',
      id: 183,
      source: 142,
      target: 145,
      value: 1,
      from: 142,
      to: 145
    },
    {
      name: '主食材',
      id: 185,
      source: 146,
      target: 147,
      value: 1,
      from: 146,
      to: 147
    },
    {
      name: '辅料',
      id: 186,
      source: 146,
      target: 148,
      value: 1,
      from: 146,
      to: 148
    },
    {
      name: '主食材',
      id: 189,
      source: 149,
      target: 150,
      value: 1,
      from: 149,
      to: 150
    },
    {
      name: '主食材',
      id: 191,
      source: 149,
      target: 151,
      value: 1,
      from: 149,
      to: 151
    },
    {
      name: '辅料',
      id: 192,
      source: 149,
      target: 152,
      value: 1,
      from: 149,
      to: 152
    },
    {
      name: '主食材',
      id: 194,
      source: 153,
      target: 154,
      value: 1,
      from: 153,
      to: 154
    },
    {
      name: '主食材',
      id: 195,
      source: 153,
      target: 155,
      value: 1,
      from: 153,
      to: 155
    },
    {
      name: '主食材',
      id: 198,
      source: 157,
      target: 158,
      value: 1,
      from: 157,
      to: 158
    },
    {
      name: '主食材',
      id: 202,
      source: 159,
      target: 160,
      value: 1,
      from: 159,
      to: 160
    },
    {
      name: '辅料',
      id: 317,
      source: 231,
      target: 161,
      value: 1,
      from: 231,
      to: 161
    },
    {
      name: '辅料',
      id: 204,
      source: 159,
      target: 161,
      value: 1,
      from: 159,
      to: 161
    },
    {
      name: '辅料',
      id: 205,
      source: 159,
      target: 162,
      value: 1,
      from: 159,
      to: 162
    },
    {
      name: '辅料',
      id: 209,
      source: 163,
      target: 164,
      value: 1,
      from: 163,
      to: 164
    },
    {
      name: '主食材',
      id: 213,
      source: 165,
      target: 166,
      value: 1,
      from: 165,
      to: 166
    },
    {
      name: '辅料',
      id: 214,
      source: 165,
      target: 167,
      value: 1,
      from: 165,
      to: 167
    },
    {
      name: '辅料',
      id: 217,
      source: 165,
      target: 168,
      value: 1,
      from: 165,
      to: 168
    },
    {
      name: '辅料',
      id: 218,
      source: 165,
      target: 169,
      value: 1,
      from: 165,
      to: 169
    },
    {
      name: '辅料',
      id: 219,
      source: 165,
      target: 170,
      value: 1,
      from: 165,
      to: 170
    },
    {
      name: '主食材',
      id: 222,
      source: 171,
      target: 172,
      value: 1,
      from: 171,
      to: 172
    },
    {
      name: '主食材',
      id: 228,
      source: 173,
      target: 174,
      value: 1,
      from: 173,
      to: 174
    },
    {
      name: '辅料',
      id: 229,
      source: 173,
      target: 175,
      value: 1,
      from: 173,
      to: 175
    },
    {
      name: '辅料',
      id: 230,
      source: 173,
      target: 176,
      value: 1,
      from: 173,
      to: 176
    },
    {
      name: '主食材',
      id: 519,
      source: 322,
      target: 176,
      value: 1,
      from: 322,
      to: 176
    },
    {
      name: '辅料',
      id: 365,
      source: 254,
      target: 177,
      value: 1,
      from: 254,
      to: 177
    },
    {
      name: '辅料',
      id: 328,
      source: 234,
      target: 177,
      value: 1,
      from: 234,
      to: 177
    },
    {
      name: '辅料',
      id: 231,
      source: 173,
      target: 177,
      value: 1,
      from: 173,
      to: 177
    },
    {
      name: '辅料',
      id: 237,
      source: 178,
      target: 179,
      value: 1,
      from: 178,
      to: 179
    },
    {
      name: '主食材',
      id: 239,
      source: 180,
      target: 181,
      value: 1,
      from: 180,
      to: 181
    },
    {
      name: '辅料',
      id: 240,
      source: 180,
      target: 182,
      value: 1,
      from: 180,
      to: 182
    },
    {
      name: '主食材',
      id: 264,
      source: 199,
      target: 182,
      value: 1,
      from: 199,
      to: 182
    },
    {
      name: '辅料',
      id: 241,
      source: 180,
      target: 183,
      value: 1,
      from: 180,
      to: 183
    },
    {
      name: '辅料',
      id: 243,
      source: 180,
      target: 184,
      value: 1,
      from: 180,
      to: 184
    },
    {
      name: '辅料',
      id: 499,
      source: 315,
      target: 185,
      value: 1,
      from: 315,
      to: 185
    },
    {
      name: '辅料',
      id: 296,
      source: 212,
      target: 185,
      value: 1,
      from: 212,
      to: 185
    },
    {
      name: '辅料',
      id: 244,
      source: 180,
      target: 185,
      value: 1,
      from: 180,
      to: 185
    },
    {
      name: '主食材',
      id: 247,
      source: 186,
      target: 187,
      value: 1,
      from: 186,
      to: 187
    },
    {
      name: '主食材',
      id: 522,
      source: 327,
      target: 189,
      value: 1,
      from: 327,
      to: 189
    },
    {
      name: '主食材',
      id: 250,
      source: 188,
      target: 189,
      value: 1,
      from: 188,
      to: 189
    },
    {
      name: '主食材',
      id: 251,
      source: 188,
      target: 190,
      value: 1,
      from: 188,
      to: 190
    },
    {
      name: '辅料',
      id: 390,
      source: 271,
      target: 191,
      value: 1,
      from: 271,
      to: 191
    },
    {
      name: '辅料',
      id: 383,
      source: 268,
      target: 191,
      value: 1,
      from: 268,
      to: 191
    },
    {
      name: '辅料',
      id: 254,
      source: 188,
      target: 191,
      value: 1,
      from: 188,
      to: 191
    },
    {
      name: '辅料',
      id: 326,
      source: 234,
      target: 193,
      value: 1,
      from: 234,
      to: 193
    },
    {
      name: '辅料',
      id: 290,
      source: 212,
      target: 193,
      value: 1,
      from: 212,
      to: 193
    },
    {
      name: '主食材',
      id: 560,
      source: 343,
      target: 193,
      value: 1,
      from: 343,
      to: 193
    },
    {
      name: '主食材',
      id: 551,
      source: 340,
      target: 193,
      value: 1,
      from: 340,
      to: 193
    },
    {
      name: '主食材',
      id: 283,
      source: 207,
      target: 193,
      value: 1,
      from: 207,
      to: 193
    },
    {
      name: '主食材',
      id: 257,
      source: 192,
      target: 193,
      value: 1,
      from: 192,
      to: 193
    },
    {
      name: '主食材',
      id: 259,
      source: 192,
      target: 194,
      value: 1,
      from: 192,
      to: 194
    },
    {
      name: '辅料',
      id: 374,
      source: 262,
      target: 195,
      value: 1,
      from: 262,
      to: 195
    },
    {
      name: '主食材',
      id: 260,
      source: 192,
      target: 195,
      value: 1,
      from: 192,
      to: 195
    },
    {
      name: '主食材',
      id: 261,
      source: 192,
      target: 196,
      value: 1,
      from: 192,
      to: 196
    },
    {
      name: '辅料',
      id: 262,
      source: 192,
      target: 197,
      value: 1,
      from: 192,
      to: 197
    },
    {
      name: '辅料',
      id: 299,
      source: 218,
      target: 200,
      value: 1,
      from: 218,
      to: 200
    },
    {
      name: '辅料',
      id: 266,
      source: 199,
      target: 200,
      value: 1,
      from: 199,
      to: 200
    },
    {
      name: '辅料',
      id: 267,
      source: 199,
      target: 201,
      value: 1,
      from: 199,
      to: 201
    },
    {
      name: '主食材',
      id: 269,
      source: 202,
      target: 203,
      value: 1,
      from: 202,
      to: 203
    },
    {
      name: '辅料',
      id: 477,
      source: 304,
      target: 204,
      value: 1,
      from: 304,
      to: 204
    },
    {
      name: '辅料',
      id: 272,
      source: 202,
      target: 204,
      value: 1,
      from: 202,
      to: 204
    },
    {
      name: '辅料',
      id: 275,
      source: 202,
      target: 205,
      value: 1,
      from: 202,
      to: 205
    },
    {
      name: '辅料',
      id: 485,
      source: 309,
      target: 206,
      value: 1,
      from: 309,
      to: 206
    },
    {
      name: '辅料',
      id: 276,
      source: 202,
      target: 206,
      value: 1,
      from: 202,
      to: 206
    },
    {
      name: '主食材',
      id: 315,
      source: 231,
      target: 208,
      value: 1,
      from: 231,
      to: 208
    },
    {
      name: '主食材',
      id: 278,
      source: 207,
      target: 208,
      value: 1,
      from: 207,
      to: 208
    },
    {
      name: '主食材',
      id: 279,
      source: 207,
      target: 209,
      value: 1,
      from: 207,
      to: 209
    },
    {
      name: '辅料',
      id: 284,
      source: 207,
      target: 210,
      value: 1,
      from: 207,
      to: 210
    },
    {
      name: '辅料',
      id: 285,
      source: 207,
      target: 211,
      value: 1,
      from: 207,
      to: 211
    },
    {
      name: '主食材',
      id: 287,
      source: 212,
      target: 213,
      value: 1,
      from: 212,
      to: 213
    },
    {
      name: '辅料',
      id: 291,
      source: 212,
      target: 214,
      value: 1,
      from: 212,
      to: 214
    },
    {
      name: '辅料',
      id: 293,
      source: 212,
      target: 215,
      value: 1,
      from: 212,
      to: 215
    },
    {
      name: '辅料',
      id: 294,
      source: 212,
      target: 216,
      value: 1,
      from: 212,
      to: 216
    },
    {
      name: '主食材',
      id: 561,
      source: 343,
      target: 216,
      value: 1,
      from: 343,
      to: 216
    },
    {
      name: '辅料',
      id: 295,
      source: 212,
      target: 217,
      value: 1,
      from: 212,
      to: 217
    },
    {
      name: '主食材',
      id: 298,
      source: 218,
      target: 219,
      value: 1,
      from: 218,
      to: 219
    },
    {
      name: '辅料',
      id: 302,
      source: 218,
      target: 220,
      value: 1,
      from: 218,
      to: 220
    },
    {
      name: '辅料',
      id: 303,
      source: 218,
      target: 221,
      value: 1,
      from: 218,
      to: 221
    },
    {
      name: '主食材',
      id: 305,
      source: 222,
      target: 223,
      value: 1,
      from: 222,
      to: 223
    },
    {
      name: '主食材',
      id: 308,
      source: 224,
      target: 225,
      value: 1,
      from: 224,
      to: 225
    },
    {
      name: '辅料',
      id: 309,
      source: 224,
      target: 226,
      value: 1,
      from: 224,
      to: 226
    },
    {
      name: '辅料',
      id: 310,
      source: 224,
      target: 227,
      value: 1,
      from: 224,
      to: 227
    },
    {
      name: '辅料',
      id: 311,
      source: 224,
      target: 228,
      value: 1,
      from: 224,
      to: 228
    },
    {
      name: '辅料',
      id: 312,
      source: 224,
      target: 229,
      value: 1,
      from: 224,
      to: 229
    },
    {
      name: '辅料',
      id: 313,
      source: 224,
      target: 230,
      value: 1,
      from: 224,
      to: 230
    },
    {
      name: '辅料',
      id: 316,
      source: 231,
      target: 232,
      value: 1,
      from: 231,
      to: 232
    },
    {
      name: '辅料',
      id: 553,
      source: 340,
      target: 233,
      value: 1,
      from: 340,
      to: 233
    },
    {
      name: '辅料',
      id: 318,
      source: 231,
      target: 233,
      value: 1,
      from: 231,
      to: 233
    },
    {
      name: '主食材',
      id: 320,
      source: 234,
      target: 235,
      value: 1,
      from: 234,
      to: 235
    },
    {
      name: '辅料',
      id: 503,
      source: 316,
      target: 236,
      value: 1,
      from: 316,
      to: 236
    },
    {
      name: '辅料',
      id: 322,
      source: 234,
      target: 236,
      value: 1,
      from: 234,
      to: 236
    },
    {
      name: '辅料',
      id: 487,
      source: 309,
      target: 237,
      value: 1,
      from: 309,
      to: 237
    },
    {
      name: '辅料',
      id: 424,
      source: 286,
      target: 237,
      value: 1,
      from: 286,
      to: 237
    },
    {
      name: '辅料',
      id: 329,
      source: 234,
      target: 237,
      value: 1,
      from: 234,
      to: 237
    },
    {
      name: '主食材',
      id: 332,
      source: 238,
      target: 239,
      value: 1,
      from: 238,
      to: 239
    },
    {
      name: '辅料',
      id: 529,
      source: 328,
      target: 240,
      value: 1,
      from: 328,
      to: 240
    },
    {
      name: '辅料',
      id: 483,
      source: 309,
      target: 240,
      value: 1,
      from: 309,
      to: 240
    },
    {
      name: '辅料',
      id: 475,
      source: 304,
      target: 240,
      value: 1,
      from: 304,
      to: 240
    },
    {
      name: '辅料',
      id: 444,
      source: 295,
      target: 240,
      value: 1,
      from: 295,
      to: 240
    },
    {
      name: '辅料',
      id: 337,
      source: 238,
      target: 240,
      value: 1,
      from: 238,
      to: 240
    },
    {
      name: '主食材',
      id: 495,
      source: 315,
      target: 242,
      value: 1,
      from: 315,
      to: 242
    },
    {
      name: '主食材',
      id: 340,
      source: 241,
      target: 242,
      value: 1,
      from: 241,
      to: 242
    },
    {
      name: '主食材',
      id: 342,
      source: 241,
      target: 243,
      value: 1,
      from: 241,
      to: 243
    },
    {
      name: '主食材',
      id: 343,
      source: 241,
      target: 244,
      value: 1,
      from: 241,
      to: 244
    },
    {
      name: '辅料',
      id: 345,
      source: 241,
      target: 245,
      value: 1,
      from: 241,
      to: 245
    },
    {
      name: '辅料',
      id: 547,
      source: 335,
      target: 246,
      value: 1,
      from: 335,
      to: 246
    },
    {
      name: '辅料',
      id: 403,
      source: 275,
      target: 246,
      value: 1,
      from: 275,
      to: 246
    },
    {
      name: '辅料',
      id: 346,
      source: 241,
      target: 246,
      value: 1,
      from: 241,
      to: 246
    },
    {
      name: '辅料',
      id: 347,
      source: 241,
      target: 247,
      value: 1,
      from: 241,
      to: 247
    },
    {
      name: '主食材',
      id: 350,
      source: 249,
      target: 250,
      value: 1,
      from: 249,
      to: 250
    },
    {
      name: '主食材',
      id: 354,
      source: 251,
      target: 252,
      value: 1,
      from: 251,
      to: 252
    },
    {
      name: '主食材',
      id: 356,
      source: 251,
      target: 253,
      value: 1,
      from: 251,
      to: 253
    },
    {
      name: '主食材',
      id: 361,
      source: 254,
      target: 255,
      value: 1,
      from: 254,
      to: 255
    },
    {
      name: '辅料',
      id: 362,
      source: 254,
      target: 256,
      value: 1,
      from: 254,
      to: 256
    },
    {
      name: '辅料',
      id: 363,
      source: 254,
      target: 257,
      value: 1,
      from: 254,
      to: 257
    },
    {
      name: '辅料',
      id: 364,
      source: 254,
      target: 258,
      value: 1,
      from: 254,
      to: 258
    },
    {
      name: '辅料',
      id: 368,
      source: 259,
      target: 260,
      value: 1,
      from: 259,
      to: 260
    },
    {
      name: '辅料',
      id: 369,
      source: 259,
      target: 261,
      value: 1,
      from: 259,
      to: 261
    },
    {
      name: '主食材',
      id: 372,
      source: 262,
      target: 263,
      value: 1,
      from: 262,
      to: 263
    },
    {
      name: '辅料',
      id: 375,
      source: 262,
      target: 264,
      value: 1,
      from: 262,
      to: 264
    },
    {
      name: '主食材',
      id: 379,
      source: 265,
      target: 266,
      value: 1,
      from: 265,
      to: 266
    },
    {
      name: '辅料',
      id: 380,
      source: 265,
      target: 267,
      value: 1,
      from: 265,
      to: 267
    },
    {
      name: '主食材',
      id: 382,
      source: 268,
      target: 269,
      value: 1,
      from: 268,
      to: 269
    },
    {
      name: '辅料',
      id: 449,
      source: 297,
      target: 270,
      value: 1,
      from: 297,
      to: 270
    },
    {
      name: '辅料',
      id: 384,
      source: 268,
      target: 270,
      value: 1,
      from: 268,
      to: 270
    },
    {
      name: '主食材',
      id: 386,
      source: 271,
      target: 272,
      value: 1,
      from: 271,
      to: 272
    },
    {
      name: '辅料',
      id: 393,
      source: 273,
      target: 274,
      value: 1,
      from: 273,
      to: 274
    },
    {
      name: '主食材',
      id: 396,
      source: 275,
      target: 276,
      value: 1,
      from: 275,
      to: 276
    },
    {
      name: '辅料',
      id: 397,
      source: 275,
      target: 277,
      value: 1,
      from: 275,
      to: 277
    },
    {
      name: '辅料',
      id: 400,
      source: 275,
      target: 278,
      value: 1,
      from: 275,
      to: 278
    },
    {
      name: '主食材',
      id: 405,
      source: 279,
      target: 280,
      value: 1,
      from: 279,
      to: 280
    },
    {
      name: '主食材',
      id: 415,
      source: 283,
      target: 284,
      value: 1,
      from: 283,
      to: 284
    },
    {
      name: '辅料',
      id: 419,
      source: 283,
      target: 285,
      value: 1,
      from: 283,
      to: 285
    },
    {
      name: '主食材',
      id: 435,
      source: 293,
      target: 285,
      value: 1,
      from: 293,
      to: 285
    },
    {
      name: '主食材',
      id: 421,
      source: 286,
      target: 287,
      value: 1,
      from: 286,
      to: 287
    },
    {
      name: '主食材',
      id: 422,
      source: 286,
      target: 288,
      value: 1,
      from: 286,
      to: 288
    },
    {
      name: '辅料',
      id: 426,
      source: 286,
      target: 289,
      value: 1,
      from: 286,
      to: 289
    },
    {
      name: '辅料',
      id: 427,
      source: 286,
      target: 290,
      value: 1,
      from: 286,
      to: 290
    },
    {
      name: '辅料',
      id: 428,
      source: 286,
      target: 291,
      value: 1,
      from: 286,
      to: 291
    },
    {
      name: '主食材',
      id: 505,
      source: 318,
      target: 294,
      value: 1,
      from: 318,
      to: 294
    },
    {
      name: '主食材',
      id: 434,
      source: 293,
      target: 294,
      value: 1,
      from: 293,
      to: 294
    },
    {
      name: '辅料',
      id: 443,
      source: 295,
      target: 296,
      value: 1,
      from: 295,
      to: 296
    },
    {
      name: '主食材',
      id: 447,
      source: 297,
      target: 298,
      value: 1,
      from: 297,
      to: 298
    },
    {
      name: '辅料',
      id: 450,
      source: 297,
      target: 299,
      value: 1,
      from: 297,
      to: 299
    },
    {
      name: '辅料',
      id: 457,
      source: 300,
      target: 301,
      value: 1,
      from: 300,
      to: 301
    },
    {
      name: '辅料',
      id: 460,
      source: 300,
      target: 302,
      value: 1,
      from: 300,
      to: 302
    },
    {
      name: '辅料',
      id: 461,
      source: 300,
      target: 303,
      value: 1,
      from: 300,
      to: 303
    },
    {
      name: '主食材',
      id: 464,
      source: 304,
      target: 305,
      value: 1,
      from: 304,
      to: 305
    },
    {
      name: '辅料',
      id: 469,
      source: 304,
      target: 306,
      value: 1,
      from: 304,
      to: 306
    },
    {
      name: '辅料',
      id: 470,
      source: 304,
      target: 307,
      value: 1,
      from: 304,
      to: 307
    },
    {
      name: '辅料',
      id: 473,
      source: 304,
      target: 308,
      value: 1,
      from: 304,
      to: 308
    },
    {
      name: '主食材',
      id: 479,
      source: 309,
      target: 310,
      value: 1,
      from: 309,
      to: 310
    },
    {
      name: '辅料',
      id: 482,
      source: 309,
      target: 311,
      value: 1,
      from: 309,
      to: 311
    },
    {
      name: '主食材',
      id: 491,
      source: 312,
      target: 313,
      value: 1,
      from: 312,
      to: 313
    },
    {
      name: '主食材',
      id: 501,
      source: 316,
      target: 317,
      value: 1,
      from: 316,
      to: 317
    },
    {
      name: '辅料',
      id: 507,
      source: 318,
      target: 319,
      value: 1,
      from: 318,
      to: 319
    },
    {
      name: '辅料',
      id: 511,
      source: 320,
      target: 321,
      value: 1,
      from: 320,
      to: 321
    },
    {
      name: '主食材',
      id: 514,
      source: 322,
      target: 323,
      value: 1,
      from: 322,
      to: 323
    },
    {
      name: '主食材',
      id: 515,
      source: 322,
      target: 324,
      value: 1,
      from: 322,
      to: 324
    },
    {
      name: '主食材',
      id: 517,
      source: 322,
      target: 325,
      value: 1,
      from: 322,
      to: 325
    },
    {
      name: '主食材',
      id: 518,
      source: 322,
      target: 326,
      value: 1,
      from: 322,
      to: 326
    },
    {
      name: '主食材',
      id: 527,
      source: 328,
      target: 329,
      value: 1,
      from: 328,
      to: 329
    },
    {
      name: '辅料',
      id: 531,
      source: 328,
      target: 330,
      value: 1,
      from: 328,
      to: 330
    },
    {
      name: '辅料',
      id: 532,
      source: 328,
      target: 331,
      value: 1,
      from: 328,
      to: 331
    },
    {
      name: '辅料',
      id: 537,
      source: 328,
      target: 332,
      value: 1,
      from: 328,
      to: 332
    },
    {
      name: '辅料',
      id: 538,
      source: 328,
      target: 333,
      value: 1,
      from: 328,
      to: 333
    },
    {
      name: '辅料',
      id: 539,
      source: 328,
      target: 334,
      value: 1,
      from: 328,
      to: 334
    },
    {
      name: '主食材',
      id: 541,
      source: 335,
      target: 336,
      value: 1,
      from: 335,
      to: 336
    },
    {
      name: '主食材',
      id: 542,
      source: 335,
      target: 337,
      value: 1,
      from: 335,
      to: 337
    },
    {
      name: '主食材',
      id: 543,
      source: 335,
      target: 338,
      value: 1,
      from: 335,
      to: 338
    },
    {
      name: '辅料',
      id: 545,
      source: 335,
      target: 339,
      value: 1,
      from: 335,
      to: 339
    },
    {
      name: '主食材',
      id: 556,
      source: 341,
      target: 342,
      value: 1,
      from: 341,
      to: 342
    },
    {
      name: '主食材',
      id: 559,
      source: 343,
      target: 344,
      value: 1,
      from: 343,
      to: 344
    },
    {
      name: '主食材',
      id: 562,
      source: 343,
      target: 345,
      value: 1,
      from: 343,
      to: 345
    }
  ],
  layouts: {
    FORCE: {
      projectId: 5,
      type: 'FORCE',
      width: 0,
      height: 0,
      nodes: [
        {
          id: 1,
          x: -628.4802110724737,
          y: -1200.2606969168326
        },
        {
          id: 57,
          x: 1161.54433668383,
          y: -2052.5775225999937
        },
        {
          id: 101,
          x: 267.18483872044555,
          y: 1500.29443598624
        },
        {
          id: 156,
          x: -749.5864241182956,
          y: -908.3894350709165
        },
        {
          id: 198,
          x: -445.38188799875394,
          y: 666.682696367891
        },
        {
          id: 248,
          x: -529.2250623811899,
          y: -1077.2538147048006
        },
        {
          id: 281,
          x: 1664.167799455601,
          y: 98.85089636250336
        },
        {
          id: 314,
          x: 61.59158372320599,
          y: 151.5071838022836
        },
        {
          id: 3,
          x: -993.5264796813643,
          y: -1153.3755536980548
        },
        {
          id: 4,
          x: -453.9619129129796,
          y: -930.5071526879707
        },
        {
          id: 5,
          x: 11.859312479730088,
          y: -331.899180304674
        },
        {
          id: 6,
          x: -656.2552837310225,
          y: 394.1115198226722
        },
        {
          id: 7,
          x: -358.84268590203203,
          y: -237.86378620107965
        },
        {
          id: 8,
          x: -1175.2525667358163,
          y: -868.6582825150838
        },
        {
          id: 9,
          x: -326.91425619915077,
          y: -1366.9409427151763
        },
        {
          id: 11,
          x: 26.828728386418867,
          y: -2026.5326494400579
        },
        {
          id: 12,
          x: -613.0213819156871,
          y: -2627.999302611312
        },
        {
          id: 13,
          x: -769.9366652098648,
          y: -2569.038340568365
        },
        {
          id: 14,
          x: -882.6617506348887,
          y: -2462.9583963933746
        },
        {
          id: 15,
          x: -711.9321724695985,
          y: -1988.542767634535
        },
        {
          id: 17,
          x: -1880.005849697517,
          y: -781.2446746537405
        },
        {
          id: 18,
          x: -1906.0397141370022,
          y: -1337.622058655644
        },
        {
          id: 20,
          x: -943.8288551252632,
          y: -1818.4391371849733
        },
        {
          id: 21,
          x: -933.2816783839802,
          y: -182.00778674350994
        },
        {
          id: 22,
          x: -1186.1590711459517,
          y: -1231.770297905326
        },
        {
          id: 23,
          x: 762.2314296611243,
          y: -1114.6345513997578
        },
        {
          id: 24,
          x: -840.4541199123277,
          y: -1865.9110609178413
        },
        {
          id: 26,
          x: -169.27743762728184,
          y: -1047.4065339495878
        },
        {
          id: 27,
          x: 324.3138629141746,
          y: -1706.5473598249428
        },
        {
          id: 28,
          x: 992.9835991206387,
          y: -1236.1624861032137
        },
        {
          id: 29,
          x: 1111.9894507051333,
          y: -901.8374645376352
        },
        {
          id: 30,
          x: 913.9111381953036,
          y: -707.778897881223
        },
        {
          id: 32,
          x: 132.08412722706953,
          y: -258.0843100816943
        },
        {
          id: 33,
          x: 317.59509795638115,
          y: -1208.988747731955
        },
        {
          id: 34,
          x: 417.3094685688408,
          y: 46.98434694260917
        },
        {
          id: 36,
          x: -822.8717040685088,
          y: 232.54994909956127
        },
        {
          id: 37,
          x: 1317.5924028598427,
          y: -458.8987483108156
        },
        {
          id: 38,
          x: -581.0089595469443,
          y: -201.23438901548488
        },
        {
          id: 39,
          x: -425.5912012380029,
          y: -39.73118050598028
        },
        {
          id: 41,
          x: -487.61753839819386,
          y: -2446.0063557732224
        },
        {
          id: 42,
          x: -126.23472601561713,
          y: -2453.6116315655963
        },
        {
          id: 44,
          x: -1718.1725310334296,
          y: -881.6647752974302
        },
        {
          id: 45,
          x: -1619.165196155724,
          y: -699.3586595736768
        },
        {
          id: 46,
          x: -1719.8322083000944,
          y: -314.11477058850335
        },
        {
          id: 48,
          x: 1521.272523872576,
          y: 198.84710337336074
        },
        {
          id: 49,
          x: 1338.1748370504904,
          y: 376.8961675999946
        },
        {
          id: 50,
          x: 1017.9477130436052,
          y: 1017.2056426107221
        },
        {
          id: 51,
          x: 281.3082325518963,
          y: 813.4235870763475
        },
        {
          id: 52,
          x: 641.2226992154049,
          y: 725.8496823437657
        },
        {
          id: 54,
          x: -1440.440340138417,
          y: -939.7139539820946
        },
        {
          id: 55,
          x: -2127.686515136641,
          y: -1282.2826961409075
        },
        {
          id: 56,
          x: -2102.885424005433,
          y: -1427.9491021083136
        },
        {
          id: 59,
          x: 1452.2988023047933,
          y: -2040.7346251114511
        },
        {
          id: 61,
          x: 873.1391996357256,
          y: -1858.3790835041616
        },
        {
          id: 62,
          x: 419.0432375598171,
          y: 699.1937051777758
        },
        {
          id: 64,
          x: 1090.4031203537402,
          y: -628.2340118222572
        },
        {
          id: 66,
          x: 120.99048418978649,
          y: -2480.4174645140924
        },
        {
          id: 67,
          x: -681.2369410417549,
          y: -1521.5371781509123
        },
        {
          id: 69,
          x: 1700.02182956805,
          y: -1645.6429587442362
        },
        {
          id: 70,
          x: 1191.6916344242313,
          y: -206.6369944210175
        },
        {
          id: 71,
          x: 1191.3541601951724,
          y: -972.4654584142556
        },
        {
          id: 73,
          x: 1498.0855863395152,
          y: -2865.3474181592965
        },
        {
          id: 74,
          x: 1697.90750588438,
          y: -2734.578025020439
        },
        {
          id: 75,
          x: 1311.7396137517815,
          y: -2870.2157933974777
        },
        {
          id: 77,
          x: 691.2860723425566,
          y: -2294.4670100591743
        },
        {
          id: 78,
          x: 601.8413606589776,
          y: -2371.2281504363878
        },
        {
          id: 79,
          x: 1104.4772662970202,
          y: -2857.5379808968955
        },
        {
          id: 81,
          x: 1039.7255226646614,
          y: -509.8972107449709
        },
        {
          id: 82,
          x: 1899.1212725144208,
          y: -147.60198487076872
        },
        {
          id: 83,
          x: 1719.302823462937,
          y: -200.91295187438
        },
        {
          id: 84,
          x: 2218.8124622531946,
          y: -706.312462603756
        },
        {
          id: 85,
          x: 1996.3929519991445,
          y: -1355.467442604689
        },
        {
          id: 86,
          x: 1898.6997243246742,
          y: -1419.1345182799976
        },
        {
          id: 87,
          x: 1589.5404615998984,
          y: -1464.0435760166552
        },
        {
          id: 88,
          x: 1288.2638279161697,
          y: -633.4525166112581
        },
        {
          id: 89,
          x: 2072.2562729840083,
          y: -1255.2178164153463
        },
        {
          id: 91,
          x: 1863.1989606443844,
          y: -2345.8535461651877
        },
        {
          id: 93,
          x: 453.2216569747555,
          y: -2686.4210512749755
        },
        {
          id: 94,
          x: 580.9879762393554,
          y: -2624.286530562369
        },
        {
          id: 95,
          x: -392.69935324946977,
          y: -1060.1189953513724
        },
        {
          id: 96,
          x: 308.0071050912051,
          y: -2700.062471984176
        },
        {
          id: 98,
          x: 64.73059041524246,
          y: -1246.754290816069
        },
        {
          id: 99,
          x: 951.6318483090378,
          y: -2050.641867423657
        },
        {
          id: 100,
          x: -34.37073593475049,
          y: -1491.7423230857191
        },
        {
          id: 103,
          x: 447.37812197380805,
          y: 1585.0904598219968
        },
        {
          id: 104,
          x: -162.27132564487727,
          y: 726.9914509554745
        },
        {
          id: 105,
          x: 123.31517214031103,
          y: 291.5855083154841
        },
        {
          id: 107,
          x: -229.75255936601903,
          y: 2068.513413463933
        },
        {
          id: 108,
          x: 166.6825061074013,
          y: 2255.0312965629582
        },
        {
          id: 109,
          x: 337.34145411018983,
          y: 2186.3531043948515
        },
        {
          id: 110,
          x: -159.82624030204767,
          y: 2137.5919308958214
        },
        {
          id: 111,
          x: -47.68401655958692,
          y: 2227.551952687399
        },
        {
          id: 112,
          x: -524.4582596333247,
          y: 1950.4034487113292
        },
        {
          id: 113,
          x: 43.44780718426332,
          y: 2273.3336685476975
        },
        {
          id: 114,
          x: -152.71264930045092,
          y: 2231.6098193536436
        },
        {
          id: 115,
          x: 1010.1627319093386,
          y: 1410.8263824640876
        },
        {
          id: 117,
          x: 814.9482835275682,
          y: 661.5961840429302
        },
        {
          id: 118,
          x: 781.3956552508888,
          y: 1235.559145630636
        },
        {
          id: 119,
          x: 655.2228776780978,
          y: 1292.6073911300564
        },
        {
          id: 121,
          x: 273.8717939510574,
          y: -652.9483970011113
        },
        {
          id: 122,
          x: 1054.9013365946864,
          y: -377.74487033600167
        },
        {
          id: 123,
          x: 1235.3201157506599,
          y: -729.2113033435999
        },
        {
          id: 124,
          x: -208.58954839226348,
          y: -848.4026397426566
        },
        {
          id: 125,
          x: -482.49423351907956,
          y: 163.02952974839414
        },
        {
          id: 127,
          x: -595.557831904585,
          y: 229.63762537621665
        },
        {
          id: 128,
          x: -357.22984650684907,
          y: 878.6722116918322
        },
        {
          id: 129,
          x: -969.5313636912539,
          y: 183.20595319709366
        },
        {
          id: 130,
          x: -469.38853836525857,
          y: 813.9514796002953
        },
        {
          id: 132,
          x: 538.8831809193262,
          y: 2650.9557258771674
        },
        {
          id: 133,
          x: -10.17989527337271,
          y: 2573.0146789179867
        },
        {
          id: 134,
          x: 212.3639632439065,
          y: 2715.1058336812266
        },
        {
          id: 135,
          x: 374.52380275876754,
          y: 2720.430320714013
        },
        {
          id: 136,
          x: 83.23873286953787,
          y: 2660.6069618922834
        },
        {
          id: 138,
          x: 1032.045045862889,
          y: 2244.6356248627844
        },
        {
          id: 139,
          x: 964.1738650112321,
          y: 2362.884258368118
        },
        {
          id: 140,
          x: 705.5124730370478,
          y: 2480.7952984819235
        },
        {
          id: 141,
          x: 855.5883568916706,
          y: 2447.4861143023145
        },
        {
          id: 143,
          x: -964.7925118069959,
          y: 1481.8814663082971
        },
        {
          id: 144,
          x: -869.3456851282019,
          y: 1549.484313731755
        },
        {
          id: 145,
          x: -1064.3571599853663,
          y: 1392.066389494721
        },
        {
          id: 147,
          x: -649.4493993513731,
          y: 1882.3901970867398
        },
        {
          id: 148,
          x: -763.2198522966734,
          y: 1833.2494052917561
        },
        {
          id: 150,
          x: 1384.0102588922923,
          y: 1838.0278858759254
        },
        {
          id: 151,
          x: 1276.8879114173553,
          y: 1919.6339867173078
        },
        {
          id: 152,
          x: 1451.888470739588,
          y: 1721.4805382605657
        },
        {
          id: 154,
          x: 989.9157313988617,
          y: 1863.637204788103
        },
        {
          id: 155,
          x: 849.7750918001188,
          y: 1939.9238302931842
        },
        {
          id: 158,
          x: -329.40094573900524,
          y: -606.9865722608849
        },
        {
          id: 160,
          x: -2097.0156115851814,
          y: -203.1523719676452
        },
        {
          id: 161,
          x: -1936.584150425618,
          y: 200.25130928870692
        },
        {
          id: 162,
          x: -2063.612705388368,
          y: -81.79912760306439
        },
        {
          id: 164,
          x: 182.15649078028505,
          y: -2266.334195158767
        },
        {
          id: 166,
          x: 1045.2283089388932,
          y: -1482.706462312654
        },
        {
          id: 167,
          x: 1316.331846686998,
          y: -1264.5392198917646
        },
        {
          id: 168,
          x: 1249.1228956705404,
          y: -1364.1595765105894
        },
        {
          id: 169,
          x: 1144.9784259701426,
          y: -1439.6012959973827
        },
        {
          id: 170,
          x: 928.2107002799042,
          y: -1467.8693606152642
        },
        {
          id: 172,
          x: -527.8590247523462,
          y: -818.785587573324
        },
        {
          id: 174,
          x: -1538.2482233073854,
          y: -1646.6158345992858
        },
        {
          id: 175,
          x: -1435.0361587056063,
          y: -1743.7926571909566
        },
        {
          id: 176,
          x: -1198.3689015068542,
          y: -284.03795915221144
        },
        {
          id: 177,
          x: -984.4057634039011,
          y: -1016.7943244242931
        },
        {
          id: 179,
          x: -1946.617507169291,
          y: -405.5704650399733
        },
        {
          id: 181,
          x: -2118.281945319838,
          y: 376.800091354798
        },
        {
          id: 182,
          x: -1636.6041834716139,
          y: 1026.6700942442874
        },
        {
          id: 183,
          x: -2059.2159035194713,
          y: 479.69969178014605
        },
        {
          id: 184,
          x: -2141.9152648871454,
          y: 257.85838138120425
        },
        {
          id: 185,
          x: -1441.048129670268,
          y: 111.67754216593111
        },
        {
          id: 187,
          x: -1314.784309738227,
          y: -1568.2599008446148
        },
        {
          id: 189,
          x: 356.5728973623752,
          y: -1432.7541492042094
        },
        {
          id: 190,
          x: -10.753386995649196,
          y: -1597.2656963413278
        },
        {
          id: 191,
          x: -347.6648791850221,
          y: -1218.8326894728891
        },
        {
          id: 193,
          x: -649.4738174955595,
          y: 32.06416617182198
        },
        {
          id: 194,
          x: -1062.2114850075202,
          y: -687.4376701204901
        },
        {
          id: 195,
          x: -125.02823367961248,
          y: -1227.3620234138725
        },
        {
          id: 196,
          x: -1098.8898590154292,
          y: -575.2091076211204
        },
        {
          id: 197,
          x: -1066.2143658208813,
          y: -473.4549982486368
        },
        {
          id: 200,
          x: -651.3578526010848,
          y: 1633.4748598129322
        },
        {
          id: 201,
          x: -1247.2045049640235,
          y: 1913.593466458787
        },
        {
          id: 203,
          x: 1129.6553899840833,
          y: -84.06826821143652
        },
        {
          id: 204,
          x: 1504.9936108168827,
          y: -552.601034977271
        },
        {
          id: 205,
          x: 1280.3502975634594,
          y: -252.4660626228547
        },
        {
          id: 206,
          x: 1453.7277035425902,
          y: -406.32705677543237
        },
        {
          id: 208,
          x: -1335.0633412732807,
          y: 413.8031938289608
        },
        {
          id: 209,
          x: -1339.3203343542311,
          y: 167.8204286276927
        },
        {
          id: 210,
          x: -1193.6013659486487,
          y: 401.9647800190399
        },
        {
          id: 211,
          x: -1307.257634879352,
          y: 278.73811743225326
        },
        {
          id: 213,
          x: -1640.7677619834126,
          y: 725.9029875384435
        },
        {
          id: 214,
          x: -1554.815024346038,
          y: 904.636958248214
        },
        {
          id: 215,
          x: -1472.290676167975,
          y: 993.3348012126005
        },
        {
          id: 216,
          x: -789.5312393785713,
          y: 983.3988354934754
        },
        {
          id: 217,
          x: -1622.7813837411272,
          y: 829.2792829445974
        },
        {
          id: 219,
          x: -226.5265814822879,
          y: 1709.061445137332
        },
        {
          id: 220,
          x: -84.56007873207771,
          y: 1698.9350423061528
        },
        {
          id: 221,
          x: -354.3646524948307,
          y: 1677.6213250991266
        },
        {
          id: 223,
          x: 35.91971501882241,
          y: 1510.8842662475213
        },
        {
          id: 225,
          x: -1527.3142936416234,
          y: 1895.8784284630144
        },
        {
          id: 226,
          x: -1657.711797608017,
          y: 1864.8393293853503
        },
        {
          id: 227,
          x: -1764.7309265380902,
          y: 1791.6614051943857
        },
        {
          id: 228,
          x: -1841.0765081522786,
          y: 1695.4231178675616
        },
        {
          id: 229,
          x: -1885.9883557932508,
          y: 1580.824762428184
        },
        {
          id: 230,
          x: -1887.019885548234,
          y: 1456.9535444667665
        },
        {
          id: 232,
          x: -1951.6618758197897,
          y: 704.8660495294353
        },
        {
          id: 233,
          x: -1191.8918028508185,
          y: -14.172946631855732
        },
        {
          id: 235,
          x: -76.81604902391736,
          y: -484.9041127782177
        },
        {
          id: 236,
          x: 280.5082038940488,
          y: -492.4667195496004
        },
        {
          id: 237,
          x: 1249.9889211736008,
          y: -491.5989150328629
        },
        {
          id: 239,
          x: 1189.5273784951835,
          y: 770.5234594133844
        },
        {
          id: 240,
          x: 1735.1406498074518,
          y: 18.96038398780258
        },
        {
          id: 242,
          x: 23.6708627052324,
          y: -19.978856057296024
        },
        {
          id: 243,
          x: 1016.0556131545635,
          y: 637.5492126646723
        },
        {
          id: 244,
          x: 1149.9899892843532,
          y: 517.9933735794114
        },
        {
          id: 245,
          x: 1116.2327116508663,
          y: 631.872775217413
        },
        {
          id: 246,
          x: 499.39655295847484,
          y: 439.2526913676774
        },
        {
          id: 247,
          x: 1226.9787338947028,
          y: 551.5838118528274
        },
        {
          id: 250,
          x: 833.7599419798026,
          y: -595.4063142437222
        },
        {
          id: 252,
          x: 688.8223085571138,
          y: -802.8788687390429
        },
        {
          id: 253,
          x: 623.4993785815157,
          y: -1234.3760187866255
        },
        {
          id: 255,
          x: -2113.747029761465,
          y: -776.7787864036085
        },
        {
          id: 256,
          x: -2183.198059838454,
          y: -966.1528481714208
        },
        {
          id: 257,
          x: -2171.9217600615134,
          y: -866.0473672658342
        },
        {
          id: 258,
          x: -2178.1655458192936,
          y: -1075.8190611345524
        },
        {
          id: 260,
          x: -1175.0509758562052,
          y: -1680.976875515159
        },
        {
          id: 261,
          x: -1097.9435550477117,
          y: -1755.4858830273836
        },
        {
          id: 263,
          x: 489.9870393473119,
          y: -2029.4135747859032
        },
        {
          id: 264,
          x: 640.6965136957954,
          y: -2012.7915514756726
        },
        {
          id: 266,
          x: -1792.8617191093108,
          y: -1586.8952151029432
        },
        {
          id: 267,
          x: -1728.338561077738,
          y: -1718.3024955529022
        },
        {
          id: 269,
          x: -348.3918382219415,
          y: -1846.992094836216
        },
        {
          id: 270,
          x: 454.63181541465553,
          y: -790.1437703548266
        },
        {
          id: 272,
          x: -519.2567753731853,
          y: -417.70058399268106
        },
        {
          id: 274,
          x: -742.1912671347023,
          y: -1768.1700220754765
        },
        {
          id: 276,
          x: 340.1060616661066,
          y: 148.503476752041
        },
        {
          id: 277,
          x: 704.3775331884183,
          y: 179.8930231907638
        },
        {
          id: 278,
          x: 493.0416263591891,
          y: 206.81751063265685
        },
        {
          id: 280,
          x: -1431.0247079307826,
          y: -173.27928490204266
        },
        {
          id: 284,
          x: 1911.6005275360724,
          y: -1206.2726133897363
        },
        {
          id: 285,
          x: 1936.8140658935706,
          y: -1041.4851174349426
        },
        {
          id: 287,
          x: 2662.7500446791537,
          y: -64.15469124890517
        },
        {
          id: 288,
          x: 2521.9520924638246,
          y: 251.1308087653374
        },
        {
          id: 289,
          x: 2594.1337342750217,
          y: 173.35265584495178
        },
        {
          id: 290,
          x: 2642.0324084587373,
          y: 69.09766937997033
        },
        {
          id: 291,
          x: 2422.586106902142,
          y: 306.26846244248827
        },
        {
          id: 294,
          x: 1392.0309325926219,
          y: 16.057757388056636
        },
        {
          id: 296,
          x: 1923.0493490161077,
          y: 1039.0873276469435
        },
        {
          id: 298,
          x: 1286.9909758062906,
          y: 124.02563694935444
        },
        {
          id: 299,
          x: 1172.841095459982,
          y: 190.418282272723
        },
        {
          id: 301,
          x: 2183.900673194423,
          y: 757.6125798053978
        },
        {
          id: 302,
          x: 2079.97667130518,
          y: 810.5068678029984
        },
        {
          id: 303,
          x: 2265.212703689513,
          y: 667.4033368830112
        },
        {
          id: 305,
          x: 2332.6247368275654,
          y: -550.0205810397093
        },
        {
          id: 306,
          x: 2340.9895579414765,
          y: -655.4105699124651
        },
        {
          id: 307,
          x: 2303.8098038050816,
          y: -447.3907205989175
        },
        {
          id: 308,
          x: 2304.6003503860816,
          y: -790.6531394788789
        },
        {
          id: 310,
          x: 2076.8578380161784,
          y: -740.9586413516292
        },
        {
          id: 311,
          x: 2057.669784577833,
          y: -890.8450630553917
        },
        {
          id: 313,
          x: 843.9633040552453,
          y: 919.8341365360043
        },
        {
          id: 317,
          x: 837.5103858251586,
          y: -6.606944692826164
        },
        {
          id: 319,
          x: 1242.0432046892208,
          y: 1088.191603201254
        },
        {
          id: 321,
          x: -289.2861408688534,
          y: 335.86305141059984
        },
        {
          id: 323,
          x: -991.4748168542916,
          y: 1083.9814952226575
        },
        {
          id: 324,
          x: -1145.0828751168926,
          y: 967.9367594677358
        },
        {
          id: 325,
          x: -1090.2497176618876,
          y: 1045.4775765399752
        },
        {
          id: 326,
          x: -1194.9775035606117,
          y: 882.7077130010086
        },
        {
          id: 329,
          x: 2010.0180052907435,
          y: -243.52754801130115
        },
        {
          id: 330,
          x: 1835.8881226029375,
          y: 105.84531773632914
        },
        {
          id: 331,
          x: 1917.2945378874044,
          y: 41.40752687881416
        },
        {
          id: 332,
          x: 1941.7686305442562,
          y: -47.80546215639767
        },
        {
          id: 333,
          x: 2013.438946858707,
          y: -120.35048438021371
        },
        {
          id: 334,
          x: 1982.3309297837295,
          y: -354.8139004290522
        },
        {
          id: 336,
          x: 365.42911243373953,
          y: 1022.4944561517423
        },
        {
          id: 337,
          x: 245.48010569133126,
          y: 1042.8446809085096
        },
        {
          id: 338,
          x: 130.81886383636004,
          y: 1044.6232358310936
        },
        {
          id: 339,
          x: 9.79241104044912,
          y: 975.2701367953078
        },
        {
          id: 342,
          x: -992.9360308569061,
          y: 596.0520370765312
        },
        {
          id: 344,
          x: -325.01374999660914,
          y: 1334.7409071531383
        },
        {
          id: 345,
          x: -453.6205784267727,
          y: 1259.0230919808102
        },
        {
          id: 2,
          x: -782.3779219251053,
          y: -691.768592215306
        },
        {
          id: 10,
          x: -561.0670541664886,
          y: -2246.2856268387063
        },
        {
          id: 16,
          x: -1500.0004903039392,
          y: -1197.0584925853188
        },
        {
          id: 19,
          x: -685.2480953717478,
          y: -1433.2220336944306
        },
        {
          id: 25,
          x: 424.9942659463067,
          y: -1298.2957070000434
        },
        {
          id: 31,
          x: 304.103995417489,
          y: -820.2753186565344
        },
        {
          id: 35,
          x: -214.83375049352873,
          y: -348.39377114125284
        },
        {
          id: 40,
          x: -492.7241648090709,
          y: -2041.6252678139826
        },
        {
          id: 43,
          x: -1197.7005992878733,
          y: -749.9091295954959
        },
        {
          id: 47,
          x: 599.9396656099149,
          y: 303.78946094088826
        },
        {
          id: 53,
          x: -1707.2185789956307,
          y: -1286.8270872069065
        },
        {
          id: 58,
          x: 1188.3907440026753,
          y: -1729.0081710370566
        },
        {
          id: 60,
          x: 675.1852024869686,
          y: -1452.7061154839355
        },
        {
          id: 63,
          x: 1264.795886281549,
          y: -1481.8861885743956
        },
        {
          id: 65,
          x: 150.98543157235108,
          y: -2046.2578369615735
        },
        {
          id: 68,
          x: 1454.262902185333,
          y: -1273.2438634792827
        },
        {
          id: 72,
          x: 1424.4484259237931,
          y: -2533.898789413846
        },
        {
          id: 76,
          x: 1029.3277918484089,
          y: -2527.6792095441597
        },
        {
          id: 80,
          x: 1671.27201369176,
          y: -1044.8569432759994
        },
        {
          id: 90,
          x: 1680.1314324492257,
          y: -2045.8225022068054
        },
        {
          id: 92,
          x: 341.5705284957258,
          y: -2293.8018784659016
        },
        {
          id: 97,
          x: 742.0252801659376,
          y: -1655.5373577149012
        },
        {
          id: 102,
          x: 285.73237283675456,
          y: 1192.4849987243274
        },
        {
          id: 106,
          x: 131.95770601640447,
          y: 1898.6642331025453
        },
        {
          id: 116,
          x: 516.4240048794869,
          y: 879.5250935122185
        },
        {
          id: 120,
          x: 477.9156768408213,
          y: -384.73773256142834
        },
        {
          id: 126,
          x: -180.31390762423385,
          y: 506.40740046515157
        },
        {
          id: 131,
          x: 324.74369675703207,
          y: 2372.104978643076
        },
        {
          id: 137,
          x: 670.0797766168054,
          y: 2129.5850398603056
        },
        {
          id: 142,
          x: -711.1136137989656,
          y: 1156.1412430660885
        },
        {
          id: 146,
          x: -475.90032650841533,
          y: 1490.339349028016
        },
        {
          id: 149,
          x: 1072.519249093504,
          y: 1581.518243640297
        },
        {
          id: 153,
          x: 704.7725511044206,
          y: 1587.7631663200464
        },
        {
          id: 157,
          x: 56.2297138083023,
          y: -628.9591354012647
        },
        {
          id: 159,
          x: -1653.4398920750816,
          y: -228.9554286940309
        },
        {
          id: 163,
          x: 251.9921316585428,
          y: -1848.4683593065474
        },
        {
          id: 165,
          x: 964.5902102373511,
          y: -1065.69043476536
        },
        {
          id: 171,
          x: -142.6104503560557,
          y: -720.3626994325833
        },
        {
          id: 173,
          x: -1233.055398498683,
          y: -1332.4797723615484
        },
        {
          id: 178,
          x: -1498.7292884417254,
          y: -461.8474596653303
        },
        {
          id: 180,
          x: -1710.3150832396498,
          y: 227.87149304648065
        },
        {
          id: 186,
          x: -954.6377386972035,
          y: -1285.7910397890269
        },
        {
          id: 188,
          x: 100.62480585877711,
          y: -1135.138994237136
        },
        {
          id: 192,
          x: -662.3653790607378,
          y: -600.6792989260665
        },
        {
          id: 199,
          x: -1088.1176757278663,
          y: 1552.4941100158826
        },
        {
          id: 202,
          x: 882.6424399529334,
          y: -391.5959623248637
        },
        {
          id: 207,
          x: -932.1841037841824,
          y: 105.61459477991511
        },
        {
          id: 212,
          x: -1208.699571364262,
          y: 658.4107881707914
        },
        {
          id: 218,
          x: -173.86821913260766,
          y: 1307.8014513811743
        },
        {
          id: 222,
          x: -59.51287780320411,
          y: 1115.7994294616642
        },
        {
          id: 224,
          x: -1504.292781498183,
          y: 1518.7800416965533
        },
        {
          id: 231,
          x: -1556.7349514612918,
          y: 524.6580990999737
        },
        {
          id: 234,
          x: 16.784905675783772,
          y: -807.2965909130737
        },
        {
          id: 238,
          x: 894.8524420089548,
          y: 372.180047421373
        },
        {
          id: 241,
          x: 850.2447443023203,
          y: 261.6917318132826
        },
        {
          id: 249,
          x: 524.4781157402894,
          y: -666.0846745890927
        },
        {
          id: 251,
          x: 379.51085531423627,
          y: -943.2163446621179
        },
        {
          id: 254,
          x: -1755.3046693274123,
          y: -1028.2887147627919
        },
        {
          id: 259,
          x: -873.9425018165031,
          y: -1354.1598342989662
        },
        {
          id: 262,
          x: 522.8480816673537,
          y: -1616.9856578777983
        },
        {
          id: 265,
          x: -1381.5016273119102,
          y: -1436.0310826946727
        },
        {
          id: 268,
          x: -165.1250132522647,
          y: -1464.7319814652517
        },
        {
          id: 271,
          x: -189.75526152401738,
          y: -617.5531516847147
        },
        {
          id: 273,
          x: -485.3345190746598,
          y: -1444.564678261377
        },
        {
          id: 275,
          x: 572.8901385087559,
          y: -154.82992086177788
        },
        {
          id: 279,
          x: -984.9666229173037,
          y: -285.6825139362159
        },
        {
          id: 282,
          x: 1515.3070267328205,
          y: 646.9788165113409
        },
        {
          id: 283,
          x: 1539.346043366137,
          y: -994.2003548026053
        },
        {
          id: 286,
          x: 2271.775749183718,
          y: -70.57052477846278
        },
        {
          id: 292,
          x: 1628.6615936007504,
          y: 503.91660622762595
        },
        {
          id: 293,
          x: 1509.3378257965799,
          y: -780.4457733130694
        },
        {
          id: 295,
          x: 1744.7570442762694,
          y: 655.8084679679014
        },
        {
          id: 297,
          x: 997.1327154356492,
          y: -171.72911852205533
        },
        {
          id: 300,
          x: 1935.5282697150494,
          y: 410.25422709185057
        },
        {
          id: 304,
          x: 1897.2101712933272,
          y: -578.6550327148643
        },
        {
          id: 309,
          x: 1679.661475119969,
          y: -681.4488959805626
        },
        {
          id: 312,
          x: 686.9095408161562,
          y: 479.4803883159777
        },
        {
          id: 315,
          x: -817.8488385851324,
          y: -440.70086295345885
        },
        {
          id: 316,
          x: 639.2928035254175,
          y: -318.9494807251923
        },
        {
          id: 318,
          x: 932.6133342263059,
          y: 713.5860576763037
        },
        {
          id: 320,
          x: -160.9321404440894,
          y: -27.26208150566834
        },
        {
          id: 322,
          x: -808.1550278900264,
          y: 705.5593008465473
        },
        {
          id: 327,
          x: 525.3258897338404,
          y: -891.6127652780698
        },
        {
          id: 328,
          x: 1565.0484648423767,
          y: -272.5682789338348
        },
        {
          id: 335,
          x: 183.2718509673356,
          y: 637.152399152528
        },
        {
          id: 340,
          x: -556.6178618852882,
          y: -499.9697381546015
        },
        {
          id: 341,
          x: -679.2979591609386,
          y: 303.0376733705044
        },
        {
          id: 343,
          x: -182.26707513306403,
          y: 946.7418258388749
        }
      ]
    },
    GRID: {
      projectId: 5,
      type: 'GRID',
      width: 0,
      height: 0,
      nodes: [
        {
          id: 1,
          x: -4626.271072387695,
          y: -665
        },
        {
          id: 57,
          x: -4626.271072387695,
          y: -475
        },
        {
          id: 101,
          x: -4626.271072387695,
          y: -285
        },
        {
          id: 156,
          x: -4626.271072387695,
          y: -95
        },
        {
          id: 198,
          x: -4626.271072387695,
          y: 95
        },
        {
          id: 248,
          x: -4626.271072387695,
          y: 285
        },
        {
          id: 281,
          x: -4626.271072387695,
          y: 475
        },
        {
          id: 314,
          x: -4626.271072387695,
          y: 665
        },
        {
          id: 3,
          x: -3960.059768676758,
          y: -23560
        },
        {
          id: 4,
          x: -3960.059768676758,
          y: -23370
        },
        {
          id: 5,
          x: -3960.059768676758,
          y: -23180
        },
        {
          id: 6,
          x: -3960.059768676758,
          y: -22990
        },
        {
          id: 7,
          x: -3960.059768676758,
          y: -22800
        },
        {
          id: 8,
          x: -3960.059768676758,
          y: -22610
        },
        {
          id: 9,
          x: -3960.059768676758,
          y: -22420
        },
        {
          id: 11,
          x: -3960.059768676758,
          y: -22230
        },
        {
          id: 12,
          x: -3960.059768676758,
          y: -22040
        },
        {
          id: 13,
          x: -3960.059768676758,
          y: -21850
        },
        {
          id: 14,
          x: -3960.059768676758,
          y: -21660
        },
        {
          id: 15,
          x: -3960.059768676758,
          y: -21470
        },
        {
          id: 17,
          x: -3960.059768676758,
          y: -21280
        },
        {
          id: 18,
          x: -3960.059768676758,
          y: -21090
        },
        {
          id: 20,
          x: -3960.059768676758,
          y: -20900
        },
        {
          id: 21,
          x: -3960.059768676758,
          y: -20710
        },
        {
          id: 22,
          x: -3960.059768676758,
          y: -20520
        },
        {
          id: 23,
          x: -3960.059768676758,
          y: -20330
        },
        {
          id: 24,
          x: -3960.059768676758,
          y: -20140
        },
        {
          id: 26,
          x: -3960.059768676758,
          y: -19950
        },
        {
          id: 27,
          x: -3960.059768676758,
          y: -19760
        },
        {
          id: 28,
          x: -3960.059768676758,
          y: -19570
        },
        {
          id: 29,
          x: -3960.059768676758,
          y: -19380
        },
        {
          id: 30,
          x: -3960.059768676758,
          y: -19190
        },
        {
          id: 32,
          x: -3960.059768676758,
          y: -19000
        },
        {
          id: 33,
          x: -3960.059768676758,
          y: -18810
        },
        {
          id: 34,
          x: -3960.059768676758,
          y: -18620
        },
        {
          id: 36,
          x: -3960.059768676758,
          y: -18430
        },
        {
          id: 37,
          x: -3960.059768676758,
          y: -18240
        },
        {
          id: 38,
          x: -3960.059768676758,
          y: -18050
        },
        {
          id: 39,
          x: -3960.059768676758,
          y: -17860
        },
        {
          id: 41,
          x: -3960.059768676758,
          y: -17670
        },
        {
          id: 42,
          x: -3960.059768676758,
          y: -17480
        },
        {
          id: 44,
          x: -3960.059768676758,
          y: -17290
        },
        {
          id: 45,
          x: -3960.059768676758,
          y: -17100
        },
        {
          id: 46,
          x: -3960.059768676758,
          y: -16910
        },
        {
          id: 48,
          x: -3960.059768676758,
          y: -16720
        },
        {
          id: 49,
          x: -3960.059768676758,
          y: -16530
        },
        {
          id: 50,
          x: -3960.059768676758,
          y: -16340
        },
        {
          id: 51,
          x: -3960.059768676758,
          y: -16150
        },
        {
          id: 52,
          x: -3960.059768676758,
          y: -15960
        },
        {
          id: 54,
          x: -3960.059768676758,
          y: -15770
        },
        {
          id: 55,
          x: -3960.059768676758,
          y: -15580
        },
        {
          id: 56,
          x: -3960.059768676758,
          y: -15390
        },
        {
          id: 59,
          x: -3960.059768676758,
          y: -15200
        },
        {
          id: 61,
          x: -3960.059768676758,
          y: -15010
        },
        {
          id: 62,
          x: -3960.059768676758,
          y: -14820
        },
        {
          id: 64,
          x: -3960.059768676758,
          y: -14630
        },
        {
          id: 66,
          x: -3960.059768676758,
          y: -14440
        },
        {
          id: 67,
          x: -3960.059768676758,
          y: -14250
        },
        {
          id: 69,
          x: -3960.059768676758,
          y: -14060
        },
        {
          id: 70,
          x: -3960.059768676758,
          y: -13870
        },
        {
          id: 71,
          x: -3960.059768676758,
          y: -13680
        },
        {
          id: 73,
          x: -3960.059768676758,
          y: -13490
        },
        {
          id: 74,
          x: -3960.059768676758,
          y: -13300
        },
        {
          id: 75,
          x: -3960.059768676758,
          y: -13110
        },
        {
          id: 77,
          x: -3960.059768676758,
          y: -12920
        },
        {
          id: 78,
          x: -3960.059768676758,
          y: -12730
        },
        {
          id: 79,
          x: -3960.059768676758,
          y: -12540
        },
        {
          id: 81,
          x: -3960.059768676758,
          y: -12350
        },
        {
          id: 82,
          x: -3960.059768676758,
          y: -12160
        },
        {
          id: 83,
          x: -3960.059768676758,
          y: -11970
        },
        {
          id: 84,
          x: -3960.059768676758,
          y: -11780
        },
        {
          id: 85,
          x: -3960.059768676758,
          y: -11590
        },
        {
          id: 86,
          x: -3960.059768676758,
          y: -11400
        },
        {
          id: 87,
          x: -3960.059768676758,
          y: -11210
        },
        {
          id: 88,
          x: -3960.059768676758,
          y: -11020
        },
        {
          id: 89,
          x: -3960.059768676758,
          y: -10830
        },
        {
          id: 91,
          x: -3960.059768676758,
          y: -10640
        },
        {
          id: 93,
          x: -3960.059768676758,
          y: -10450
        },
        {
          id: 94,
          x: -3960.059768676758,
          y: -10260
        },
        {
          id: 95,
          x: -3960.059768676758,
          y: -10070
        },
        {
          id: 96,
          x: -3960.059768676758,
          y: -9880
        },
        {
          id: 98,
          x: -3960.059768676758,
          y: -9690
        },
        {
          id: 99,
          x: -3960.059768676758,
          y: -9500
        },
        {
          id: 100,
          x: -3960.059768676758,
          y: -9310
        },
        {
          id: 103,
          x: -3960.059768676758,
          y: -9120
        },
        {
          id: 104,
          x: -3960.059768676758,
          y: -8930
        },
        {
          id: 105,
          x: -3960.059768676758,
          y: -8740
        },
        {
          id: 107,
          x: -3960.059768676758,
          y: -8550
        },
        {
          id: 108,
          x: -3960.059768676758,
          y: -8360
        },
        {
          id: 109,
          x: -3960.059768676758,
          y: -8170
        },
        {
          id: 110,
          x: -3960.059768676758,
          y: -7980
        },
        {
          id: 111,
          x: -3960.059768676758,
          y: -7790
        },
        {
          id: 112,
          x: -3960.059768676758,
          y: -7600
        },
        {
          id: 113,
          x: -3960.059768676758,
          y: -7410
        },
        {
          id: 114,
          x: -3960.059768676758,
          y: -7220
        },
        {
          id: 115,
          x: -3960.059768676758,
          y: -7030
        },
        {
          id: 117,
          x: -3960.059768676758,
          y: -6840
        },
        {
          id: 118,
          x: -3960.059768676758,
          y: -6650
        },
        {
          id: 119,
          x: -3960.059768676758,
          y: -6460
        },
        {
          id: 121,
          x: -3960.059768676758,
          y: -6270
        },
        {
          id: 122,
          x: -3960.059768676758,
          y: -6080
        },
        {
          id: 123,
          x: -3960.059768676758,
          y: -5890
        },
        {
          id: 124,
          x: -3960.059768676758,
          y: -5700
        },
        {
          id: 125,
          x: -3960.059768676758,
          y: -5510
        },
        {
          id: 127,
          x: -3960.059768676758,
          y: -5320
        },
        {
          id: 128,
          x: -3960.059768676758,
          y: -5130
        },
        {
          id: 129,
          x: -3960.059768676758,
          y: -4940
        },
        {
          id: 130,
          x: -3960.059768676758,
          y: -4750
        },
        {
          id: 132,
          x: -3960.059768676758,
          y: -4560
        },
        {
          id: 133,
          x: -3960.059768676758,
          y: -4370
        },
        {
          id: 134,
          x: -3960.059768676758,
          y: -4180
        },
        {
          id: 135,
          x: -3960.059768676758,
          y: -3990
        },
        {
          id: 136,
          x: -3960.059768676758,
          y: -3800
        },
        {
          id: 138,
          x: -3960.059768676758,
          y: -3610
        },
        {
          id: 139,
          x: -3960.059768676758,
          y: -3420
        },
        {
          id: 140,
          x: -3960.059768676758,
          y: -3230
        },
        {
          id: 141,
          x: -3960.059768676758,
          y: -3040
        },
        {
          id: 143,
          x: -3960.059768676758,
          y: -2850
        },
        {
          id: 144,
          x: -3960.059768676758,
          y: -2660
        },
        {
          id: 145,
          x: -3960.059768676758,
          y: -2470
        },
        {
          id: 147,
          x: -3960.059768676758,
          y: -2280
        },
        {
          id: 148,
          x: -3960.059768676758,
          y: -2090
        },
        {
          id: 150,
          x: -3960.059768676758,
          y: -1900
        },
        {
          id: 151,
          x: -3960.059768676758,
          y: -1710
        },
        {
          id: 152,
          x: -3960.059768676758,
          y: -1520
        },
        {
          id: 154,
          x: -3960.059768676758,
          y: -1330
        },
        {
          id: 155,
          x: -3960.059768676758,
          y: -1140
        },
        {
          id: 158,
          x: -3960.059768676758,
          y: -950
        },
        {
          id: 160,
          x: -3960.059768676758,
          y: -760
        },
        {
          id: 161,
          x: -3960.059768676758,
          y: -570
        },
        {
          id: 162,
          x: -3960.059768676758,
          y: -380
        },
        {
          id: 164,
          x: -3960.059768676758,
          y: -190
        },
        {
          id: 166,
          x: -3960.059768676758,
          y: 0
        },
        {
          id: 167,
          x: -3960.059768676758,
          y: 190
        },
        {
          id: 168,
          x: -3960.059768676758,
          y: 380
        },
        {
          id: 169,
          x: -3960.059768676758,
          y: 570
        },
        {
          id: 170,
          x: -3960.059768676758,
          y: 760
        },
        {
          id: 172,
          x: -3960.059768676758,
          y: 950
        },
        {
          id: 174,
          x: -3960.059768676758,
          y: 1140
        },
        {
          id: 175,
          x: -3960.059768676758,
          y: 1330
        },
        {
          id: 176,
          x: -3960.059768676758,
          y: 1520
        },
        {
          id: 177,
          x: -3960.059768676758,
          y: 1710
        },
        {
          id: 179,
          x: -3960.059768676758,
          y: 1900
        },
        {
          id: 181,
          x: -3960.059768676758,
          y: 2090
        },
        {
          id: 182,
          x: -3960.059768676758,
          y: 2280
        },
        {
          id: 183,
          x: -3960.059768676758,
          y: 2470
        },
        {
          id: 184,
          x: -3960.059768676758,
          y: 2660
        },
        {
          id: 185,
          x: -3960.059768676758,
          y: 2850
        },
        {
          id: 187,
          x: -3960.059768676758,
          y: 3040
        },
        {
          id: 189,
          x: -3960.059768676758,
          y: 3230
        },
        {
          id: 190,
          x: -3960.059768676758,
          y: 3420
        },
        {
          id: 191,
          x: -3960.059768676758,
          y: 3610
        },
        {
          id: 193,
          x: -3960.059768676758,
          y: 3800
        },
        {
          id: 194,
          x: -3960.059768676758,
          y: 3990
        },
        {
          id: 195,
          x: -3960.059768676758,
          y: 4180
        },
        {
          id: 196,
          x: -3960.059768676758,
          y: 4370
        },
        {
          id: 197,
          x: -3960.059768676758,
          y: 4560
        },
        {
          id: 200,
          x: -3960.059768676758,
          y: 4750
        },
        {
          id: 201,
          x: -3960.059768676758,
          y: 4940
        },
        {
          id: 203,
          x: -3960.059768676758,
          y: 5130
        },
        {
          id: 204,
          x: -3960.059768676758,
          y: 5320
        },
        {
          id: 205,
          x: -3960.059768676758,
          y: 5510
        },
        {
          id: 206,
          x: -3960.059768676758,
          y: 5700
        },
        {
          id: 208,
          x: -3960.059768676758,
          y: 5890
        },
        {
          id: 209,
          x: -3960.059768676758,
          y: 6080
        },
        {
          id: 210,
          x: -3960.059768676758,
          y: 6270
        },
        {
          id: 211,
          x: -3960.059768676758,
          y: 6460
        },
        {
          id: 213,
          x: -3960.059768676758,
          y: 6650
        },
        {
          id: 214,
          x: -3960.059768676758,
          y: 6840
        },
        {
          id: 215,
          x: -3960.059768676758,
          y: 7030
        },
        {
          id: 216,
          x: -3960.059768676758,
          y: 7220
        },
        {
          id: 217,
          x: -3960.059768676758,
          y: 7410
        },
        {
          id: 219,
          x: -3960.059768676758,
          y: 7600
        },
        {
          id: 220,
          x: -3960.059768676758,
          y: 7790
        },
        {
          id: 221,
          x: -3960.059768676758,
          y: 7980
        },
        {
          id: 223,
          x: -3960.059768676758,
          y: 8170
        },
        {
          id: 225,
          x: -3960.059768676758,
          y: 8360
        },
        {
          id: 226,
          x: -3960.059768676758,
          y: 8550
        },
        {
          id: 227,
          x: -3960.059768676758,
          y: 8740
        },
        {
          id: 228,
          x: -3960.059768676758,
          y: 8930
        },
        {
          id: 229,
          x: -3960.059768676758,
          y: 9120
        },
        {
          id: 230,
          x: -3960.059768676758,
          y: 9310
        },
        {
          id: 232,
          x: -3960.059768676758,
          y: 9500
        },
        {
          id: 233,
          x: -3960.059768676758,
          y: 9690
        },
        {
          id: 235,
          x: -3960.059768676758,
          y: 9880
        },
        {
          id: 236,
          x: -3960.059768676758,
          y: 10070
        },
        {
          id: 237,
          x: -3960.059768676758,
          y: 10260
        },
        {
          id: 239,
          x: -3960.059768676758,
          y: 10450
        },
        {
          id: 240,
          x: -3960.059768676758,
          y: 10640
        },
        {
          id: 242,
          x: -3960.059768676758,
          y: 10830
        },
        {
          id: 243,
          x: -3960.059768676758,
          y: 11020
        },
        {
          id: 244,
          x: -3960.059768676758,
          y: 11210
        },
        {
          id: 245,
          x: -3960.059768676758,
          y: 11400
        },
        {
          id: 246,
          x: -3960.059768676758,
          y: 11590
        },
        {
          id: 247,
          x: -3960.059768676758,
          y: 11780
        },
        {
          id: 250,
          x: -3960.059768676758,
          y: 11970
        },
        {
          id: 252,
          x: -3960.059768676758,
          y: 12160
        },
        {
          id: 253,
          x: -3960.059768676758,
          y: 12350
        },
        {
          id: 255,
          x: -3960.059768676758,
          y: 12540
        },
        {
          id: 256,
          x: -3960.059768676758,
          y: 12730
        },
        {
          id: 257,
          x: -3960.059768676758,
          y: 12920
        },
        {
          id: 258,
          x: -3960.059768676758,
          y: 13110
        },
        {
          id: 260,
          x: -3960.059768676758,
          y: 13300
        },
        {
          id: 261,
          x: -3960.059768676758,
          y: 13490
        },
        {
          id: 263,
          x: -3960.059768676758,
          y: 13680
        },
        {
          id: 264,
          x: -3960.059768676758,
          y: 13870
        },
        {
          id: 266,
          x: -3960.059768676758,
          y: 14060
        },
        {
          id: 267,
          x: -3960.059768676758,
          y: 14250
        },
        {
          id: 269,
          x: -3960.059768676758,
          y: 14440
        },
        {
          id: 270,
          x: -3960.059768676758,
          y: 14630
        },
        {
          id: 272,
          x: -3960.059768676758,
          y: 14820
        },
        {
          id: 274,
          x: -3960.059768676758,
          y: 15010
        },
        {
          id: 276,
          x: -3960.059768676758,
          y: 15200
        },
        {
          id: 277,
          x: -3960.059768676758,
          y: 15390
        },
        {
          id: 278,
          x: -3960.059768676758,
          y: 15580
        },
        {
          id: 280,
          x: -3960.059768676758,
          y: 15770
        },
        {
          id: 284,
          x: -3960.059768676758,
          y: 15960
        },
        {
          id: 285,
          x: -3960.059768676758,
          y: 16150
        },
        {
          id: 287,
          x: -3960.059768676758,
          y: 16340
        },
        {
          id: 288,
          x: -3960.059768676758,
          y: 16530
        },
        {
          id: 289,
          x: -3960.059768676758,
          y: 16720
        },
        {
          id: 290,
          x: -3960.059768676758,
          y: 16910
        },
        {
          id: 291,
          x: -3960.059768676758,
          y: 17100
        },
        {
          id: 294,
          x: -3960.059768676758,
          y: 17290
        },
        {
          id: 296,
          x: -3960.059768676758,
          y: 17480
        },
        {
          id: 298,
          x: -3960.059768676758,
          y: 17670
        },
        {
          id: 299,
          x: -3960.059768676758,
          y: 17860
        },
        {
          id: 301,
          x: -3960.059768676758,
          y: 18050
        },
        {
          id: 302,
          x: -3960.059768676758,
          y: 18240
        },
        {
          id: 303,
          x: -3960.059768676758,
          y: 18430
        },
        {
          id: 305,
          x: -3960.059768676758,
          y: 18620
        },
        {
          id: 306,
          x: -3960.059768676758,
          y: 18810
        },
        {
          id: 307,
          x: -3960.059768676758,
          y: 19000
        },
        {
          id: 308,
          x: -3960.059768676758,
          y: 19190
        },
        {
          id: 310,
          x: -3960.059768676758,
          y: 19380
        },
        {
          id: 311,
          x: -3960.059768676758,
          y: 19570
        },
        {
          id: 313,
          x: -3960.059768676758,
          y: 19760
        },
        {
          id: 317,
          x: -3960.059768676758,
          y: 19950
        },
        {
          id: 319,
          x: -3960.059768676758,
          y: 20140
        },
        {
          id: 321,
          x: -3960.059768676758,
          y: 20330
        },
        {
          id: 323,
          x: -3960.059768676758,
          y: 20520
        },
        {
          id: 324,
          x: -3960.059768676758,
          y: 20710
        },
        {
          id: 325,
          x: -3960.059768676758,
          y: 20900
        },
        {
          id: 326,
          x: -3960.059768676758,
          y: 21090
        },
        {
          id: 329,
          x: -3960.059768676758,
          y: 21280
        },
        {
          id: 330,
          x: -3960.059768676758,
          y: 21470
        },
        {
          id: 331,
          x: -3960.059768676758,
          y: 21660
        },
        {
          id: 332,
          x: -3960.059768676758,
          y: 21850
        },
        {
          id: 333,
          x: -3960.059768676758,
          y: 22040
        },
        {
          id: 334,
          x: -3960.059768676758,
          y: 22230
        },
        {
          id: 336,
          x: -3960.059768676758,
          y: 22420
        },
        {
          id: 337,
          x: -3960.059768676758,
          y: 22610
        },
        {
          id: 338,
          x: -3960.059768676758,
          y: 22800
        },
        {
          id: 339,
          x: -3960.059768676758,
          y: 22990
        },
        {
          id: 342,
          x: -3960.059768676758,
          y: 23180
        },
        {
          id: 344,
          x: -3960.059768676758,
          y: 23370
        },
        {
          id: 345,
          x: -3960.059768676758,
          y: 23560
        },
        {
          id: 2,
          x: 3005.215925216675,
          y: -8265
        },
        {
          id: 10,
          x: 3005.215925216675,
          y: -8075
        },
        {
          id: 16,
          x: 3005.215925216675,
          y: -7885
        },
        {
          id: 19,
          x: 3005.215925216675,
          y: -7695
        },
        {
          id: 25,
          x: 3005.215925216675,
          y: -7505
        },
        {
          id: 31,
          x: 3005.215925216675,
          y: -7315
        },
        {
          id: 35,
          x: 3005.215925216675,
          y: -7125
        },
        {
          id: 40,
          x: 3005.215925216675,
          y: -6935
        },
        {
          id: 43,
          x: 3005.215925216675,
          y: -6745
        },
        {
          id: 47,
          x: 3005.215925216675,
          y: -6555
        },
        {
          id: 53,
          x: 3005.215925216675,
          y: -6365
        },
        {
          id: 58,
          x: 3005.215925216675,
          y: -6175
        },
        {
          id: 60,
          x: 3005.215925216675,
          y: -5985
        },
        {
          id: 63,
          x: 3005.215925216675,
          y: -5795
        },
        {
          id: 65,
          x: 3005.215925216675,
          y: -5605
        },
        {
          id: 68,
          x: 3005.215925216675,
          y: -5415
        },
        {
          id: 72,
          x: 3005.215925216675,
          y: -5225
        },
        {
          id: 76,
          x: 3005.215925216675,
          y: -5035
        },
        {
          id: 80,
          x: 3005.215925216675,
          y: -4845
        },
        {
          id: 90,
          x: 3005.215925216675,
          y: -4655
        },
        {
          id: 92,
          x: 3005.215925216675,
          y: -4465
        },
        {
          id: 97,
          x: 3005.215925216675,
          y: -4275
        },
        {
          id: 102,
          x: 3005.215925216675,
          y: -4085
        },
        {
          id: 106,
          x: 3005.215925216675,
          y: -3895
        },
        {
          id: 116,
          x: 3005.215925216675,
          y: -3705
        },
        {
          id: 120,
          x: 3005.215925216675,
          y: -3515
        },
        {
          id: 126,
          x: 3005.215925216675,
          y: -3325
        },
        {
          id: 131,
          x: 3005.215925216675,
          y: -3135
        },
        {
          id: 137,
          x: 3005.215925216675,
          y: -2945
        },
        {
          id: 142,
          x: 3005.215925216675,
          y: -2755
        },
        {
          id: 146,
          x: 3005.215925216675,
          y: -2565
        },
        {
          id: 149,
          x: 3005.215925216675,
          y: -2375
        },
        {
          id: 153,
          x: 3005.215925216675,
          y: -2185
        },
        {
          id: 157,
          x: 3005.215925216675,
          y: -1995
        },
        {
          id: 159,
          x: 3005.215925216675,
          y: -1805
        },
        {
          id: 163,
          x: 3005.215925216675,
          y: -1615
        },
        {
          id: 165,
          x: 3005.215925216675,
          y: -1425
        },
        {
          id: 171,
          x: 3005.215925216675,
          y: -1235
        },
        {
          id: 173,
          x: 3005.215925216675,
          y: -1045
        },
        {
          id: 178,
          x: 3005.215925216675,
          y: -855
        },
        {
          id: 180,
          x: 3005.215925216675,
          y: -665
        },
        {
          id: 186,
          x: 3005.215925216675,
          y: -475
        },
        {
          id: 188,
          x: 3005.215925216675,
          y: -285
        },
        {
          id: 192,
          x: 3005.215925216675,
          y: -95
        },
        {
          id: 199,
          x: 3005.215925216675,
          y: 95
        },
        {
          id: 202,
          x: 3005.215925216675,
          y: 285
        },
        {
          id: 207,
          x: 3005.215925216675,
          y: 475
        },
        {
          id: 212,
          x: 3005.215925216675,
          y: 665
        },
        {
          id: 218,
          x: 3005.215925216675,
          y: 855
        },
        {
          id: 222,
          x: 3005.215925216675,
          y: 1045
        },
        {
          id: 224,
          x: 3005.215925216675,
          y: 1235
        },
        {
          id: 231,
          x: 3005.215925216675,
          y: 1425
        },
        {
          id: 234,
          x: 3005.215925216675,
          y: 1615
        },
        {
          id: 238,
          x: 3005.215925216675,
          y: 1805
        },
        {
          id: 241,
          x: 3005.215925216675,
          y: 1995
        },
        {
          id: 249,
          x: 3005.215925216675,
          y: 2185
        },
        {
          id: 251,
          x: 3005.215925216675,
          y: 2375
        },
        {
          id: 254,
          x: 3005.215925216675,
          y: 2565
        },
        {
          id: 259,
          x: 3005.215925216675,
          y: 2755
        },
        {
          id: 262,
          x: 3005.215925216675,
          y: 2945
        },
        {
          id: 265,
          x: 3005.215925216675,
          y: 3135
        },
        {
          id: 268,
          x: 3005.215925216675,
          y: 3325
        },
        {
          id: 271,
          x: 3005.215925216675,
          y: 3515
        },
        {
          id: 273,
          x: 3005.215925216675,
          y: 3705
        },
        {
          id: 275,
          x: 3005.215925216675,
          y: 3895
        },
        {
          id: 279,
          x: 3005.215925216675,
          y: 4085
        },
        {
          id: 282,
          x: 3005.215925216675,
          y: 4275
        },
        {
          id: 283,
          x: 3005.215925216675,
          y: 4465
        },
        {
          id: 286,
          x: 3005.215925216675,
          y: 4655
        },
        {
          id: 292,
          x: 3005.215925216675,
          y: 4845
        },
        {
          id: 293,
          x: 3005.215925216675,
          y: 5035
        },
        {
          id: 295,
          x: 3005.215925216675,
          y: 5225
        },
        {
          id: 297,
          x: 3005.215925216675,
          y: 5415
        },
        {
          id: 300,
          x: 3005.215925216675,
          y: 5605
        },
        {
          id: 304,
          x: 3005.215925216675,
          y: 5795
        },
        {
          id: 309,
          x: 3005.215925216675,
          y: 5985
        },
        {
          id: 312,
          x: 3005.215925216675,
          y: 6175
        },
        {
          id: 315,
          x: 3005.215925216675,
          y: 6365
        },
        {
          id: 316,
          x: 3005.215925216675,
          y: 6555
        },
        {
          id: 318,
          x: 3005.215925216675,
          y: 6745
        },
        {
          id: 320,
          x: 3005.215925216675,
          y: 6935
        },
        {
          id: 322,
          x: 3005.215925216675,
          y: 7125
        },
        {
          id: 327,
          x: 3005.215925216675,
          y: 7315
        },
        {
          id: 328,
          x: 3005.215925216675,
          y: 7505
        },
        {
          id: 335,
          x: 3005.215925216675,
          y: 7695
        },
        {
          id: 340,
          x: 3005.215925216675,
          y: 7885
        },
        {
          id: 341,
          x: 3005.215925216675,
          y: 8075
        },
        {
          id: 343,
          x: 3005.215925216675,
          y: 8265
        }
      ]
    },
    FIXED: {
      projectId: 5,
      type: 'FIXED',
      width: 0,
      height: 0,
      nodes: [
        {
          id: 1,
          x: -683.4586372703883,
          y: -1064.542549688358
        },
        {
          id: 57,
          x: 47.26511943416294,
          y: -1205.7097407363901
        },
        {
          id: 101,
          x: -1260.226562046889,
          y: -909.5626316721326
        },
        {
          id: 156,
          x: -364.58287781503253,
          y: -477.69051984853144
        },
        {
          id: 198,
          x: -438.4856191786999,
          y: 1355.4203767532579
        },
        {
          id: 248,
          x: -942.1310906781027,
          y: 367.0797777444306
        },
        {
          id: 281,
          x: 1211.2346430878815,
          y: 865.0956505837491
        },
        {
          id: 314,
          x: 328.21369406961253,
          y: 1075.9773174683858
        },
        {
          id: 3,
          x: 178.01529443432455,
          y: -1539.0968550868506
        },
        {
          id: 4,
          x: 220.3366325466064,
          y: -497.81966814557546
        },
        {
          id: 5,
          x: -87.54383385307732,
          y: -356.4188778029767
        },
        {
          id: 6,
          x: -697.1106922988118,
          y: 242.50378493737253
        },
        {
          id: 7,
          x: -113.76952858508363,
          y: -543.8516449811773
        },
        {
          id: 8,
          x: 150.96954854316436,
          y: -1266.4200380366321
        },
        {
          id: 9,
          x: 548.7706705146597,
          y: -951.880143589434
        },
        {
          id: 11,
          x: -804.2487085262073,
          y: -1725.5978069088405
        },
        {
          id: 12,
          x: -487.99725009336424,
          y: -2553.225660836237
        },
        {
          id: 13,
          x: -612.7409405019084,
          y: -2631.845334401318
        },
        {
          id: 14,
          x: -787.8025818981232,
          y: -2650.210281250396
        },
        {
          id: 15,
          x: -1004.9530451302194,
          y: -1748.2006876617108
        },
        {
          id: 17,
          x: 159.60604750113927,
          y: -2132.3151497565145
        },
        {
          id: 18,
          x: 3553.880579511768,
          y: -2416.9681641420966
        },
        {
          id: 20,
          x: 372.1486866302664,
          y: -1536.8173000522766
        },
        {
          id: 21,
          x: -336.10491815917635,
          y: 183.6128282812292
        },
        {
          id: 22,
          x: 631.6280976768475,
          y: -1251.45920260561
        },
        {
          id: 23,
          x: 172.81218622062676,
          y: -186.05552362854542
        },
        {
          id: 24,
          x: 164.41391880654723,
          y: -1466.1642906113127
        },
        {
          id: 26,
          x: -243.1749087140649,
          y: -85.57200189424
        },
        {
          id: 27,
          x: 661.4644232145303,
          y: -726.5416852597574
        },
        {
          id: 28,
          x: 290.32972295411827,
          y: -305.90399471798344
        },
        {
          id: 29,
          x: 508.74390278124156,
          y: 67.45181663596749
        },
        {
          id: 30,
          x: 1091.9188082283783,
          y: 185.06273262844664
        },
        {
          id: 32,
          x: -432.93604575935353,
          y: -1341.5345699501386
        },
        {
          id: 33,
          x: 180.46580817855008,
          y: -1352.0269742873036
        },
        {
          id: 34,
          x: -131.35282316120538,
          y: -1526.5225170598492
        },
        {
          id: 36,
          x: 1485.8037806578955,
          y: 373.4188098038722
        },
        {
          id: 37,
          x: 1322.3707169579993,
          y: 24.600296176654673
        },
        {
          id: 38,
          x: 2343.630436531216,
          y: -416.92477161300184
        },
        {
          id: 39,
          x: 2267.317597322323,
          y: -535.3073082441523
        },
        {
          id: 41,
          x: -12.632836824915989,
          y: -2899.162598331167
        },
        {
          id: 42,
          x: -220.17565039266924,
          y: -2187.9553586904217
        },
        {
          id: 44,
          x: 1435.7278745322792,
          y: -1253.3570107011628
        },
        {
          id: 45,
          x: 1189.034969262087,
          y: -1134.7194281909933
        },
        {
          id: 46,
          x: 775.1707007209712,
          y: -336.46924479636345
        },
        {
          id: 48,
          x: 1670.7874895801124,
          y: 1046.554007388033
        },
        {
          id: 49,
          x: 799.0978788827039,
          y: 1829.7314365579637
        },
        {
          id: 50,
          x: 1012.0435254034707,
          y: 2056.2206380352886
        },
        {
          id: 51,
          x: 864.8645311636109,
          y: 1987.6220313514343
        },
        {
          id: 52,
          x: 1297.594017769267,
          y: 2370.282175310075
        },
        {
          id: 54,
          x: 1420.680998214935,
          y: -946.4075515505463
        },
        {
          id: 55,
          x: 1833.2959598449884,
          y: -1833.6215026778573
        },
        {
          id: 56,
          x: 2005.7440240063834,
          y: -1761.1741415189256
        },
        {
          id: 59,
          x: -195.14405271070913,
          y: -1120.7910075430445
        },
        {
          id: 61,
          x: -976.0556410927464,
          y: -1101.849392889715
        },
        {
          id: 62,
          x: -1207.5442628975413,
          y: 422.92989562094067
        },
        {
          id: 64,
          x: 881.2342601229898,
          y: 711.0240943969754
        },
        {
          id: 66,
          x: 725.1233093974068,
          y: -1941.3974823097906
        },
        {
          id: 67,
          x: 1014.4088255849642,
          y: -996.2288120203816
        },
        {
          id: 69,
          x: 826.8913221194985,
          y: -871.5003461725095
        },
        {
          id: 70,
          x: 976.1549712512906,
          y: 605.9709044863857
        },
        {
          id: 71,
          x: 1114.4497396135775,
          y: -308.09038229857833
        },
        {
          id: 73,
          x: -1001.3268293038329,
          y: -2169.7095279561045
        },
        {
          id: 74,
          x: -938.4875338837595,
          y: -2278.831234727163
        },
        {
          id: 75,
          x: -839.2709817518531,
          y: -2369.250399349313
        },
        {
          id: 77,
          x: -1089.829514055616,
          y: -1320.148300800268
        },
        {
          id: 78,
          x: -1210.6396819341714,
          y: -1382.577137540421
        },
        {
          id: 79,
          x: -1095.0992835216925,
          y: -1811.493339455807
        },
        {
          id: 81,
          x: 973.6639445881826,
          y: 487.4357480155171
        },
        {
          id: 82,
          x: 1805.1650373628343,
          y: 678.0534098846097
        },
        {
          id: 83,
          x: 1415.882459084921,
          y: 824.1557796222484
        },
        {
          id: 84,
          x: 1822.0385946276942,
          y: 533.5384399403162
        },
        {
          id: 85,
          x: 1759.9689477421198,
          y: -182.06279080069004
        },
        {
          id: 86,
          x: 1714.2595269363076,
          y: -290.6226917125807
        },
        {
          id: 87,
          x: 1202.7691147579978,
          y: -498.1216788408235
        },
        {
          id: 88,
          x: 1241.821513195585,
          y: 327.0754217277658
        },
        {
          id: 89,
          x: 1707.3371223986917,
          y: 37.46226870710162
        },
        {
          id: 91,
          x: 727.7690548966026,
          y: -1630.808462200797
        },
        {
          id: 93,
          x: -407.70896130013017,
          y: -1928.8464561628311
        },
        {
          id: 94,
          x: -550.1136397743088,
          y: -1964.6198765527056
        },
        {
          id: 95,
          x: -866.1456935087775,
          y: -195.3928672555459
        },
        {
          id: 96,
          x: -657.8598095228954,
          y: -1867.346255534144
        },
        {
          id: 98,
          x: -624.1308561565065,
          y: 114.1882596186523
        },
        {
          id: 99,
          x: -554.4018700820972,
          y: -489.00918152112354
        },
        {
          id: 100,
          x: -586.5269627286845,
          y: 45.55360081764064
        },
        {
          id: 103,
          x: -1549.2387534901197,
          y: -148.22261815577215
        },
        {
          id: 104,
          x: -120.00220881379865,
          y: 20.259707335171804
        },
        {
          id: 105,
          x: -542.3249293134198,
          y: 905.3682793821508
        },
        {
          id: 107,
          x: 1076.0548835864697,
          y: -1531.7165005172567
        },
        {
          id: 108,
          x: 1007.0545921700598,
          y: -1634.9331248402295
        },
        {
          id: 109,
          x: 951.2704690909611,
          y: -1728.4670237571224
        },
        {
          id: 110,
          x: 1157.2374542651671,
          y: -1571.0062909089133
        },
        {
          id: 111,
          x: 1068.0974482565625,
          y: -1712.0966084003503
        },
        {
          id: 112,
          x: 164.24948352581714,
          y: -660.3889699463134
        },
        {
          id: 113,
          x: 761.667946784784,
          y: -1755.7489266191963
        },
        {
          id: 114,
          x: 862.2651238984753,
          y: -1754.3693241815042
        },
        {
          id: 115,
          x: 1422.826122444095,
          y: -830.2255621412852
        },
        {
          id: 117,
          x: -972.2462982426202,
          y: -1343.5148002836481
        },
        {
          id: 118,
          x: -373.428627929023,
          y: -2004.811406207697
        },
        {
          id: 119,
          x: -523.9930401821734,
          y: -2100.5689538991287
        },
        {
          id: 121,
          x: 999.154253038525,
          y: -473.94811029214003
        },
        {
          id: 122,
          x: 757.5699692543768,
          y: 403.375151465377
        },
        {
          id: 123,
          x: 1490.0622762715934,
          y: -250.8439575747656
        },
        {
          id: 124,
          x: 146.93732008182218,
          y: -579.3065599261215
        },
        {
          id: 125,
          x: 116.74079012045215,
          y: 775.8162062846861
        },
        {
          id: 127,
          x: -614.2425617059871,
          y: 418.4940999721191
        },
        {
          id: 128,
          x: -841.6895703184334,
          y: -601.2551552763325
        },
        {
          id: 129,
          x: -466.1099874958427,
          y: -1031.600304349344
        },
        {
          id: 130,
          x: -925.4110113712094,
          y: -533.0780648562243
        },
        {
          id: 132,
          x: -2087.3420611707174,
          y: -1668.3182886635395
        },
        {
          id: 133,
          x: -1662.6780836968767,
          y: -2041.2498719535777
        },
        {
          id: 134,
          x: -1951.3818824499212,
          y: -1954.010943863182
        },
        {
          id: 135,
          x: -2053.5861445746195,
          y: -1828.3347379767465
        },
        {
          id: 136,
          x: -1816.962705557256,
          y: -2039.7490494926958
        },
        {
          id: 138,
          x: -2412.951559339181,
          y: -779.5409964573397
        },
        {
          id: 139,
          x: -2463.5406893963127,
          y: -1050.3080395601535
        },
        {
          id: 140,
          x: -2398.9220762682166,
          y: -1202.5437240096926
        },
        {
          id: 141,
          x: -2477.6746672252116,
          y: -903.0755707265599
        },
        {
          id: 143,
          x: -1967.260160233673,
          y: -306.61209387430927
        },
        {
          id: 144,
          x: -1941.3427031043066,
          y: -509.82224240784575
        },
        {
          id: 145,
          x: -2003.7647933073936,
          y: -414.37734289193276
        },
        {
          id: 147,
          x: -1832.313033470189,
          y: -793.5259385533712
        },
        {
          id: 148,
          x: -1922.458144390387,
          y: -681.9079832592888
        },
        {
          id: 150,
          x: -1854.2896276436004,
          y: -1591.1873945615862
        },
        {
          id: 151,
          x: -1953.477809539212,
          y: -1308.8556047448
        },
        {
          id: 152,
          x: -1949.9434707329804,
          y: -1453.1784489704494
        },
        {
          id: 154,
          x: -2239.273145629166,
          y: -203.82219570500948
        },
        {
          id: 155,
          x: -2234.1120436637907,
          y: -59.53032217324095
        },
        {
          id: 158,
          x: -839.2159968030385,
          y: 285.1705288325152
        },
        {
          id: 160,
          x: -1814.79201869507,
          y: 90.27663010546807
        },
        {
          id: 161,
          x: -1679.2062834704332,
          y: 748.3887128937482
        },
        {
          id: 162,
          x: -1851.4474401297603,
          y: 218.84520183878854
        },
        {
          id: 164,
          x: -1066.2573213436942,
          y: -1206.960819950227
        },
        {
          id: 166,
          x: 1624.4815256781442,
          y: -708.9676044441931
        },
        {
          id: 167,
          x: 1723.5779485751482,
          y: -570.1484350290142
        },
        {
          id: 168,
          x: 1744.11240295554,
          y: -667.3725856348364
        },
        {
          id: 169,
          x: 1707.8451580288381,
          y: -773.0634491660999
        },
        {
          id: 170,
          x: 1622.4920370485945,
          y: -845.5498130880022
        },
        {
          id: 172,
          x: -1058.2589994408675,
          y: -448.5499626911189
        },
        {
          id: 174,
          x: 1150.6930355125983,
          y: -813.9028237570939
        },
        {
          id: 175,
          x: 1099.6529866922356,
          y: -904.5983194240625
        },
        {
          id: 176,
          x: 424.49749172436907,
          y: 570.0701710771341
        },
        {
          id: 177,
          x: 49.303601949995375,
          y: 375.80152870199476
        },
        {
          id: 179,
          x: -42.65650053227095,
          y: -1917.8308426523452
        },
        {
          id: 181,
          x: 749.1697906909309,
          y: 114.60187672121151
        },
        {
          id: 182,
          x: -73.76683176331706,
          y: 582.9118055097805
        },
        {
          id: 183,
          x: 90.0415553650437,
          y: 39.64411732354981
        },
        {
          id: 184,
          x: 315.0714540762929,
          y: 652.5391494671715
        },
        {
          id: 185,
          x: 893.4146120469265,
          y: 425.6373099461778
        },
        {
          id: 187,
          x: -982.360029082542,
          y: -879.7269230588413
        },
        {
          id: 189,
          x: -446.1604781288972,
          y: 115.17815823812536
        },
        {
          id: 190,
          x: -1163.4477706661737,
          y: -255.73974105644473
        },
        {
          id: 191,
          x: -1434.7257624001736,
          y: 329.3253971140481
        },
        {
          id: 193,
          x: -195.57202627712013,
          y: 945.0061654504922
        },
        {
          id: 194,
          x: -1302.7843885318346,
          y: -50.279705617602524
        },
        {
          id: 195,
          x: -568.9050761967089,
          y: -158.0177718603158
        },
        {
          id: 196,
          x: -1338.4483785898992,
          y: 51.514491832057146
        },
        {
          id: 197,
          x: -1338.6301952695662,
          y: 175.42862751551777
        },
        {
          id: 200,
          x: -1001.1846519389925,
          y: 1029.3842324599427
        },
        {
          id: 201,
          x: -915.6852007284592,
          y: 728.2574041366431
        },
        {
          id: 203,
          x: 887.0112148959058,
          y: 923.8312355238834
        },
        {
          id: 204,
          x: 1357.5524299564415,
          y: 515.5527449051262
        },
        {
          id: 205,
          x: 596.1582126972585,
          y: 1007.0088898055088
        },
        {
          id: 206,
          x: 1132.3802540949914,
          y: 623.8357974844436
        },
        {
          id: 208,
          x: -1133.5673885345802,
          y: 1148.735394857572
        },
        {
          id: 209,
          x: -1228.6452973552716,
          y: 770.1658431081917
        },
        {
          id: 210,
          x: -1189.2529788169315,
          y: 889.118652031883
        },
        {
          id: 211,
          x: -947.83897042578,
          y: 1087.8626892504576
        },
        {
          id: 213,
          x: 863.0339073346511,
          y: 1220.4876548667978
        },
        {
          id: 214,
          x: 981.6911981759192,
          y: 1178.54935624902
        },
        {
          id: 215,
          x: 1037.9666860380983,
          y: 1095.7072607046953
        },
        {
          id: 216,
          x: 772.5971517415293,
          y: 1590.269333065797
        },
        {
          id: 217,
          x: 953.3835272222763,
          y: 1287.1853092182582
        },
        {
          id: 219,
          x: -1525.8924492586416,
          y: 1740.3639171494613
        },
        {
          id: 220,
          x: -1428.0032097412372,
          y: 1818.3511622172387
        },
        {
          id: 221,
          x: -1613.5207410545624,
          y: 1655.1727189371197
        },
        {
          id: 223,
          x: -1665.5929438452504,
          y: 1292.4574267910305
        },
        {
          id: 225,
          x: -574.080561779622,
          y: 2523.1325675221387
        },
        {
          id: 226,
          x: -690.2860779762048,
          y: 2590.446545879099
        },
        {
          id: 227,
          x: -825.2346769403343,
          y: 2603.25587952646
        },
        {
          id: 228,
          x: -969.516754975032,
          y: 2562.0946007301814
        },
        {
          id: 229,
          x: -1089.7698180056195,
          y: 2471.0418065606286
        },
        {
          id: 230,
          x: -1162.3180218262935,
          y: 2342.931878771195
        },
        {
          id: 232,
          x: -1822.9921213974778,
          y: 1554.4932253169775
        },
        {
          id: 233,
          x: -1213.6048500004642,
          y: 1116.1227020290958
        },
        {
          id: 235,
          x: 453.73290840880514,
          y: -210.2740994922603
        },
        {
          id: 236,
          x: 597.005171737158,
          y: 230.18838843571535
        },
        {
          id: 237,
          x: 1189.1026646341472,
          y: 551.9484462872607
        },
        {
          id: 239,
          x: 134.10623863775166,
          y: 1245.7969027897502
        },
        {
          id: 240,
          x: 1584.8498739974905,
          y: 461.7937335989122
        },
        {
          id: 242,
          x: 1283.1298761113462,
          y: 857.3852420754517
        },
        {
          id: 243,
          x: 1304.9619597078472,
          y: 1834.4027578894477
        },
        {
          id: 244,
          x: 1487.0818887240646,
          y: 1749.6151364660655
        },
        {
          id: 245,
          x: 1422.7208702420096,
          y: 1830.3257915772483
        },
        {
          id: 246,
          x: 849.99185042657,
          y: 1732.025819973212
        },
        {
          id: 247,
          x: 1564.296561822049,
          y: 1675.0317933033227
        },
        {
          id: 250,
          x: -644.805123650567,
          y: -986.2214715747679
        },
        {
          id: 252,
          x: -304.81815429061174,
          y: -578.0572022987043
        },
        {
          id: 253,
          x: -457.3068289129627,
          y: -542.2260865238463
        },
        {
          id: 255,
          x: -798.5534790249071,
          y: 1736.6727549819673
        },
        {
          id: 256,
          x: -986.7980380942513,
          y: 1684.912739146075
        },
        {
          id: 257,
          x: -914.8053774945225,
          y: 1761.2238401962725
        },
        {
          id: 258,
          x: -1091.0079370121748,
          y: 1660.1264717716945
        },
        {
          id: 260,
          x: -1722.7156741218448,
          y: 518.4396320823802
        },
        {
          id: 261,
          x: -1767.8631279759438,
          y: 417.57528719666635
        },
        {
          id: 263,
          x: 218.26253220411377,
          y: -767.8542708664696
        },
        {
          id: 264,
          x: 341.2781122997082,
          y: -658.2332809972597
        },
        {
          id: 266,
          x: -2045.5259772438194,
          y: 1060.9459904025118
        },
        {
          id: 267,
          x: -2129.266295816114,
          y: 927.7660697681795
        },
        {
          id: 269,
          x: -1836.8046847150815,
          y: 945.958261112638
        },
        {
          id: 270,
          x: -549.528160061951,
          y: 1171.942934559534
        },
        {
          id: 272,
          x: -1361.1188390045315,
          y: 595.3361621561726
        },
        {
          id: 274,
          x: -1163.4004915074827,
          y: -1376.5328750380606
        },
        {
          id: 276,
          x: 493.0854731652381,
          y: 1485.6021711914425
        },
        {
          id: 277,
          x: 776.7689488696204,
          y: 1433.00414089203
        },
        {
          id: 278,
          x: 645.446978553692,
          y: 1472.5981388106106
        },
        {
          id: 280,
          x: -1085.8579596719949,
          y: 1288.4214007843284
        },
        {
          id: 284,
          x: 1014.2814272979936,
          y: -303.5789401428988
        },
        {
          id: 285,
          x: 367.75321084169985,
          y: 163.5268339666046
        },
        {
          id: 287,
          x: 2262.304851083395,
          y: 1123.817268409163
        },
        {
          id: 288,
          x: 2092.024747295813,
          y: 1414.268362136142
        },
        {
          id: 289,
          x: 2180.571277452552,
          y: 1350.832834438239
        },
        {
          id: 290,
          x: 2247.118572029072,
          y: 1251.020968878592
        },
        {
          id: 291,
          x: 2003.4248365538642,
          y: 1486.4396985502797
        },
        {
          id: 294,
          x: 44.1515290759568,
          y: 1223.6709707929494
        },
        {
          id: 296,
          x: 2270.2136985353536,
          y: -146.34800804001682
        },
        {
          id: 298,
          x: 251.314549687495,
          y: 1493.6790364609533
        },
        {
          id: 299,
          x: 10.295601856051722,
          y: 1405.7986930093944
        },
        {
          id: 301,
          x: 815.1584633794507,
          y: 1707.4472941136232
        },
        {
          id: 302,
          x: 616.0571616803524,
          y: 1644.1057810860575
        },
        {
          id: 303,
          x: 693.1461497245806,
          y: 1722.2757380760618
        },
        {
          id: 305,
          x: 2314.6564652743596,
          y: 233.59253255284236
        },
        {
          id: 306,
          x: 2308.0084995292286,
          y: 141.67512620988043
        },
        {
          id: 307,
          x: 2316.9448514338137,
          y: 346.05424401612873
        },
        {
          id: 308,
          x: 2272.6607135437303,
          y: 45.244965244663206
        },
        {
          id: 310,
          x: 1706.603637292427,
          y: 154.11884987184803
        },
        {
          id: 311,
          x: 1632.549209742673,
          y: -14.581688850044955
        },
        {
          id: 313,
          x: -76.36085476856667,
          y: 476.0735066982523
        },
        {
          id: 317,
          x: 878.0322174159488,
          y: 342.0851543259316
        },
        {
          id: 319,
          x: -145.4941663205476,
          y: 2201.780771511832
        },
        {
          id: 321,
          x: -273.0454709526023,
          y: 1119.9501178024836
        },
        {
          id: 323,
          x: 43.84355815804797,
          y: 1798.6527952035099
        },
        {
          id: 324,
          x: -174.46595358755545,
          y: 1758.614998637451
        },
        {
          id: 325,
          x: -85.69904308915581,
          y: 1810.983880540823
        },
        {
          id: 326,
          x: -259.0786270347371,
          y: 1708.7913849357856
        },
        {
          id: 329,
          x: 1939.2216708302944,
          y: 595.18973785731
        },
        {
          id: 330,
          x: 1964.7276589941832,
          y: 719.065865548977
        },
        {
          id: 331,
          x: 1857.3007505471874,
          y: 883.6965540279656
        },
        {
          id: 332,
          x: 1940.572374047633,
          y: 812.4841010024323
        },
        {
          id: 333,
          x: 2024.820058904809,
          y: 615.7400947627232
        },
        {
          id: 334,
          x: 1968.6623584370511,
          y: 471.6613461282334
        },
        {
          id: 336,
          x: 288.9219567135979,
          y: 2161.4925327767046
        },
        {
          id: 337,
          x: 195.30008673094528,
          y: 2180.557419040857
        },
        {
          id: 338,
          x: 100.93710152780437,
          y: 2173.6696457880703
        },
        {
          id: 339,
          x: 8.330179618971012,
          y: 2133.2746444883937
        },
        {
          id: 342,
          x: -621.0138821433991,
          y: 1180.2984657382979
        },
        {
          id: 344,
          x: 628.4468391112393,
          y: 2338.7824250463973
        },
        {
          id: 345,
          x: 496.0796859112808,
          y: 2381.3589516083803
        },
        {
          id: 2,
          x: -79.8728334927412,
          y: -970.6478849706351
        },
        {
          id: 10,
          x: -755.7751651757742,
          y: -2285.9665898367607
        },
        {
          id: 16,
          x: 2359.467361229025,
          y: -2555.595222363733
        },
        {
          id: 19,
          x: 243.66253874032094,
          y: -1080.4064109482904
        },
        {
          id: 25,
          x: 517.1969956121178,
          y: -361.19838642444125
        },
        {
          id: 31,
          x: 114.0038791347283,
          y: -980.0717825207746
        },
        {
          id: 35,
          x: 2036.5383932607567,
          y: -233.53849006993158
        },
        {
          id: 40,
          x: 2.192396730905589,
          y: -2568.4104441454956
        },
        {
          id: 43,
          x: 931.9006459623923,
          y: -786.644862455226
        },
        {
          id: 47,
          x: 1325.5552499230746,
          y: 2034.094297831671
        },
        {
          id: 53,
          x: 1817.3831254661454,
          y: -1491.943917528405
        },
        {
          id: 58,
          x: -6.679916522014127,
          y: -789.9000898575454
        },
        {
          id: 60,
          x: -667.0608675478501,
          y: -851.312593720021
        },
        {
          id: 63,
          x: 560.1793803839132,
          y: -145.8706904557196
        },
        {
          id: 65,
          x: 651.2192155925851,
          y: -1510.8163966283355
        },
        {
          id: 68,
          x: 719.6158364624391,
          y: -463.9970074432528
        },
        {
          id: 72,
          x: -669.3502007725202,
          y: -2048.1809342776787
        },
        {
          id: 76,
          x: -772.8512677395935,
          y: -1559.7657601486242
        },
        {
          id: 80,
          x: 1384.2045784114914,
          y: -69.7127046021684
        },
        {
          id: 90,
          x: 755.4833859570628,
          y: -1220.8283441388037
        },
        {
          id: 92,
          x: -510.51624061331705,
          y: -1538.099444060728
        },
        {
          id: 97,
          x: -164.26869091786762,
          y: -343.6082067948646
        },
        {
          id: 102,
          x: -1094.1294680864048,
          y: -7.10011049468031
        },
        {
          id: 106,
          x: 789.3946531264789,
          y: -1342.488986560457
        },
        {
          id: 116,
          x: -651.8471240438985,
          y: -1702.2102956155313
        },
        {
          id: 120,
          x: 672.6577339496628,
          y: -201.5002526386039
        },
        {
          id: 126,
          x: -538.1857582381781,
          y: -361.0726535147687
        },
        {
          id: 131,
          x: -1723.9730689494854,
          y: -1702.53290300014
        },
        {
          id: 137,
          x: -2134.1156840566396,
          y: -996.9638785574521
        },
        {
          id: 142,
          x: -1609.0097772553088,
          y: -382.75659183746194
        },
        {
          id: 146,
          x: -1572.9911868814768,
          y: -559.599370943198
        },
        {
          id: 149,
          x: -1613.569769346784,
          y: -1372.8743275831378
        },
        {
          id: 153,
          x: -1867.8200075391812,
          y: -182.9406242921739
        },
        {
          id: 157,
          x: -440.41366910762355,
          y: 269.0034979221464
        },
        {
          id: 159,
          x: -1466.8664158841711,
          y: 138.68355695367552
        },
        {
          id: 163,
          x: -763.9022499113911,
          y: -1017.563750822732
        },
        {
          id: 165,
          x: 1360.879737945855,
          y: -513.209684832749
        },
        {
          id: 171,
          x: -678.1385670363122,
          y: -300.8709977666679
        },
        {
          id: 173,
          x: 781.9051923581762,
          y: -532.4644117180101
        },
        {
          id: 178,
          x: -219.12186527837957,
          y: -1572.7933649597546
        },
        {
          id: 180,
          x: 390.5095647288815,
          y: 273.0124722777055
        },
        {
          id: 186,
          x: -549.16543848388,
          y: -842.2998105335383
        },
        {
          id: 188,
          x: -807.6051107451145,
          y: -75.80769080177113
        },
        {
          id: 192,
          x: -963.1779315104369,
          y: 144.21763261866437
        },
        {
          id: 199,
          x: -520.4046303891427,
          y: 605.1274980945399
        },
        {
          id: 202,
          x: 675.6583791278496,
          y: 651.2451161787817
        },
        {
          id: 207,
          x: -844.3786043189424,
          y: 703.5670456815618
        },
        {
          id: 212,
          x: 669.5269105523848,
          y: 963.2300664739431
        },
        {
          id: 218,
          x: -1280.507263888717,
          y: 1490.3464007669586
        },
        {
          id: 222,
          x: -1315.3407723107903,
          y: 1173.618818136794
        },
        {
          id: 224,
          x: -813.3662794030037,
          y: 2263.2784694192937
        },
        {
          id: 231,
          x: -1486.6022232149498,
          y: 1389.6497698511873
        },
        {
          id: 234,
          x: 224.2517230013825,
          y: 83.06084206218813
        },
        {
          id: 238,
          x: 310.99294617040925,
          y: 883.2305028135353
        },
        {
          id: 241,
          x: 1222.5786734776436,
          y: 1493.6545694917954
        },
        {
          id: 249,
          x: -558.007881925436,
          y: -613.2379015072943
        },
        {
          id: 251,
          x: -289.13096241402485,
          y: -176.23749241999283
        },
        {
          id: 254,
          x: -808.9501108724598,
          y: 1391.0154115946507
        },
        {
          id: 259,
          x: -1353.4174342363951,
          y: 403.73605102715754
        },
        {
          id: 262,
          x: 35.80693916936312,
          y: -383.6366270145109
        },
        {
          id: 265,
          x: -1760.4181671241097,
          y: 836.7004839613068
        },
        {
          id: 268,
          x: -1391.6436681187745,
          y: 889.079310002159
        },
        {
          id: 271,
          x: -979.6820690648801,
          y: 477.27613560522764
        },
        {
          id: 273,
          x: -1043.6646258179887,
          y: -978.7600106066739
        },
        {
          id: 275,
          x: 507.39352375560907,
          y: 1142.9505169243096
        },
        {
          id: 279,
          x: -815.762954566074,
          y: 958.7137667534831
        },
        {
          id: 282,
          x: 1510.2439804114977,
          y: 1460.005076746132
        },
        {
          id: 283,
          x: 752.3435391294337,
          y: -23.05786996634748
        },
        {
          id: 286,
          x: 1906.0720422254226,
          y: 1127.5425873169133
        },
        {
          id: 292,
          x: 1422.566400198839,
          y: 1244.6094729466452
        },
        {
          id: 293,
          x: 275.4524935050742,
          y: 544.0223622894327
        },
        {
          id: 295,
          x: 1944.8826809398151,
          y: 51.85316431205848
        },
        {
          id: 297,
          x: 291.2819189160994,
          y: 1134.6309177490853
        },
        {
          id: 300,
          x: 882.829570660997,
          y: 1344.186207322029
        },
        {
          id: 304,
          x: 1944.2820422957884,
          y: 249.0359928124609
        },
        {
          id: 309,
          x: 1286.1842316027157,
          y: 173.23981200702377
        },
        {
          id: 312,
          x: 291.31383148580517,
          y: 358.14901646706863
        },
        {
          id: 315,
          x: 1003.0244822353715,
          y: -21.241441643653435
        },
        {
          id: 316,
          x: 572.250801978369,
          y: 606.9156326573686
        },
        {
          id: 318,
          x: 130.93776021591478,
          y: 1914.2216133662928
        },
        {
          id: 320,
          x: -80.49570608648949,
          y: 778.0837695752667
        },
        {
          id: 322,
          x: 59.77257189474931,
          y: 1474.2088200191322
        },
        {
          id: 327,
          x: -3.6095008001864226,
          y: 265.26203903922914
        },
        {
          id: 328,
          x: 1575.367581132148,
          y: 624.7436519273176
        },
        {
          id: 335,
          x: 242.31032723809633,
          y: 1792.512535930271
        },
        {
          id: 340,
          x: -669.4450345108025,
          y: 730.2778385615715
        },
        {
          id: 341,
          x: -315.28900540722026,
          y: 906.0408223506428
        },
        {
          id: 343,
          x: 476.66172389232463,
          y: 2009.4014687153438
        }
      ]
    }
  }
}

export const graphDataTransformer = data => {
  // console.log('origin', data)
  const { projectId, nodes, relations, layout } = data
  const layouts = layoutsTransformer(layout)
  return {
    projectId,
    nodes: nodes.map(n => responseItemTranformer('node', n)),
    links: relations.map(r => responseItemTranformer('link', r)),
    layouts
  }
}
